{
    "elements": {
        "2211.03062_f53842e0a6273f09a7a537508e0f5e6b": "Document Root 2211.03062",
        "2211.03062_4b09adc2daa8cae31186ee33d973da92": "1]",
        "2211.03062_e604f4348031a3aa7d7d89c9653bf105": "2]",
        "2211.03062_fb61a5b58a369c994f0317fe1744362c": "3,4]",
        "2211.03062_1fa141ff09e1411ef0cde29db7127ebe": "[cor1]",
        "2211.03062_35dba5d75538a9bbe0b4da4422759a0e": "[1]",
        "2211.03062_beb4dbf9af069aa2df7b147229965085": "[2]",
        "2211.03062_f2577a6fc29b900fe7d4c6321346be48": "[3]",
        "2211.03062_e962e23c139e7252904b9221d9967442": "[4]",
        "2211.03062_e353dbe42c8654f33588d4da0b517469": "Abstract",
        "2211.03062_6d85c36a484779e5acd9bcc4e735320c": "Myocardial pathology segmentation (MyoPS) can be a prerequisite for the accurate diagnosis and treatment planning of myocardial infarction",
        "2211.03062_e191ca1c01d4a3cc6248948fea3e488b": "However, achieving this segmentation is challenging, mainly due to the inadequate and indistinct information from an image",
        "2211.03062_7a77e445cc814ed395570cead4f81ac4": "In this work, we develop an end-to-end deep neural network, referred to as MyoPS-Net, to flexibly combine five-sequence cardiac magnetic resonance (CMR) images for MyoPS",
        "2211.03062_2570b1b1952be91de7eaac7ceee4e0ca": "To extract precise and adequate information, we design an effective yet flexible architecture to extract and fuse cross-modal features",
        "2211.03062_63be768c57b50febd2b4925eef598c35": "This architecture can tackle different numbers of CMR images and complex combinations of modalities, with output branches targeting specific pathologies",
        "2211.03062_229114c871312ad62d34ed20c1580424": "To impose anatomical knowledge on the segmentation results, we first propose a module to regularize myocardium consistency and localize the pathologies, and then introduce an inclusiveness loss to utilize relations between myocardial scars and edema",
        "2211.03062_884db4ce31a2ab008b5e5386e6daea71": "We evaluated the proposed MyoPS-Net on two datasets,",
        "2211.03062_1681212a91720bcf8916f6c24966cbac": "a private one consisting of 50 paired multi-sequence CMR images and a public one from MICCAI2020 MyoPS Challenge",
        "2211.03062_537b5bde5296058fcb93c9f149bce4f5": "Experimental results showed that MyoPS-Net could achieve state-of-the-art performance in various scenarios",
        "2211.03062_e183c8c0ec3ff3e30b5d18caf4f3ac59": "Note that in practical clinics, the subjects may not have full sequences, such as missing LGE CMR or mapping CMR scans",
        "2211.03062_c9e75df993431a0ed6809b6114dcb505": "We therefore conducted extensive experiments to investigate the performance of the proposed method in dealing with such complex combinations of different CMR sequences",
        "2211.03062_ab7d66125e9fdb9902659be385dd8e43": "Results proved the superiority and generalizability of MyoPS-Net, and more importantly, indicated a practical clinical application.",
        "2211.03062_8c906464552018426817e73509edfdbc": "Multi-sequence CMR, Myocardial pathology segmentation, Missing modality, Practical clinics",
        "2211.03062_0b79795d3efc95b9976c7c5b933afce2": "Introduction",
        "2211.03062_685c8557a8939092b145c45fb0ebe78e": "\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=0.9\\textwidth]{pic/CMR_examples.pdf}\\\\[-2ex]\n\\caption{Examples of the five-sequence CMR images, namely bSSFP, LGE, T2, T1 mapping and T2* mapping CMR. The left five columns display CMR images, and the sixth column presents the MyoPS results overlaid on the ventricles. Scar and edema regions are rendered in dark red and dark green, respectively. Note that here T1 mapping and T2* mapping CMR are displayed in colored images using jet colormap, while in the other figures of this manuscript they are displayed in gray images.}\n\\label{example}\n\\end{figure*}",
        "2211.03062_574606699763002813607cf21f8a465b": "Myocardial infarction (MI), a common cardiovascular disease, is one of the leading causes of death in the world",
        "2211.03062_750b66ba7b1259574f6095004c10ba22": "\\citep{thygesen2007universal}",
        "2211.03062_8f429fd02c31a70a1973527792d68912": "Quantitative evaluation of myocardial scars and edema is in great demand for effective diagnosis and treatment of MI",
        "2211.03062_47fe20e174eb8a72f568f3b0ebf75ebd": "\\citep{richardson2015physiological}",
        "2211.03062_a4ae2b761d1c76cce130ef6d7ba0e81b": "In real clinical scenarios, multi-sequence cardiac magnetic resonance (CMR) imaging is usually employed as an efficacious tool for MI evaluation",
        "2211.03062_c709b2d64ad8bea31c5d355dcac77085": "In this work, we propose to consider five clinically available CMR sequences, including balanced steady-state free precession (bSSFP) sequence, late gadolinium enhancement (LGE) sequence, T2-weighted sequence, T1 mapping sequence and T2* mapping sequence",
        "2211.03062_83496df4b1e73c3ec95a6adf22e2db10": "Examples of these sequences are presented in Fig.",
        "2211.03062_eae13b2591c74f12904095370697fd41": "Specifically, bSSFP CMR can provide clear boundaries of the myocardium and left ventricle (LV) for scar and edema evaluation; LGE CMR reveals the scar regions with distinctive brightness compared to the healthy myocardium, while T2, T1 mapping and T2* mapping images provide pathological information without injection of contrast agents",
        "2211.03062_6bcd3fd8a68fdf081d0f72dae6ba3346": "To conduct quantitative analysis of multi-sequence CMR images, accurate and efficient segmentation of myocardial pathology regions becomes a necessity",
        "2211.03062_f2cf43652246d8b70224e17da413bc66": "Because of the difficulty in manual delineation, which is time-consuming and sometimes subjective, automating this segmentation is highly demanded",
        "2211.03062_0f729bfd55514a9be78bbc37192ad455": "However, achieving such automatic segmentation is still arduous, mainly due to inferior image quality, blurry pathology boundaries, various pathology appearances and the difficulty in fusing multi-sequence information",
        "2211.03062_2570d9f94a8359d40a198c3e4341edde": "Limited studies have been reported on automatic myocardial scar and edema segmentation",
        "2211.03062_60f96fa8c5163946a13430d4f98e63f9": "A large number of approaches on MyoPS solely focus on one type of pathologies,",
        "2211.03062_cfd917398e9d1ce30d6eb9b0adb0786e": "either scars or edema",
        "2211.03062_b3adae4156d780a03594d9e5c06b270e": "For instance,",
        "2211.03062_3c3667b915dc5886ebc233e9118fc7ee": "\\citet{sandfort2017automatic}",
        "2211.03062_be5d5d37542d75f93a87094459f76678": "and",
        "2211.03062_a406bfcd1310f170bea1c0ebb6f45d7b": "\\citet{kolipaka2005segmentation}",
        "2211.03062_a3c78c7ad5783c8a1511503c20269319": "proposed threshold-based methods to perform scar segmentation, while",
        "2211.03062_c7b0b299d76db5981709592fdbd95d7f": "\\citet{kadir2010automatic}",
        "2211.03062_c269d4913fb1c67f2a038ca51b853f6f": "developed similar method for edema segmentation",
        "2211.03062_f58a135fee0e2a92ab83c9bc602adefc": "Besides, given the difficulty in mining multi-sequence information, most of the reported algorithms barely employed a single sequence for MyoPS, especially LGE CMR which probably contains the most information",
        "2211.03062_85d9b1872e21d9578aad0fc78b72408d": "\\citep{MRI}",
        "2211.03062_0210b101ac5348d2740d4c7a6c8e7eaa": ", in spite of the drawback of injecting contrast agents",
        "2211.03062_cabbc139b7f74771c47e3eb24d94c92b": "For example,",
        "2211.03062_0d80de3827bb542fbae6c9452f5a8f8f": "\\citet{brahim20213d}",
        "2211.03062_0c06e4aa1fd760b476a1f7177d47b810": "proposed a 3D network for myocardial disease segmentation with LGE CMR images",
        "2211.03062_2a297b54cdfa5b3403e2f23251c9ed45": "However, multi-sequence CMR images can offer supplementary pathology-related features for scar and edema segmentation",
        "2211.03062_e1c4758e05c2086fb193b9b2aafbe0ec": "Effectively extracting instructive features from multi-sequence CMR images becomes essential for MyoPS",
        "2211.03062_e3a78be8c6d101be7bce4a55b1467e09": "Furthermore, to better localize the tiny pathologies, existing methods were usually designed in a two-stage manner",
        "2211.03062_a24d519f5a52f50f4dedcdfa8fc699a2": "\\citep{myopschallenge-twostage-2,myopschallenge-twostage-1,myopschallenge-twostage-3}",
        "2211.03062_3f2bbf72532174fa6cdbc651d7bc3970": ", namely first extracting the myocardium and then segmenting scars and edema on the extracted myocardium",
        "2211.03062_fa18f2ce410b87ca639039f9985fa106": "In this work, we propose an end-to-end deep learning framework for MyoPS combining multi-sequence CMR images, which can be abbreviated as MyoPS-Net",
        "2211.03062_3f7d8f9814e6e5123a84828167e286f6": "The CMR images considered here include the end-diastolic (ED) phase of the cine bSSFP sequence, referred to as C0 image, and four other CMR sequences,",
        "2211.03062_99723484ff16d8126ef1e117147943f0": "LGE, T2, T1 mapping and T2* mapping, at the same ED phase",
        "2211.03062_1a23e41c4f01d83fd7a8bb8bcb9a0cb6": "The former provides clear anatomical information, while the latter four offer critical information for the myocardial pathologies, namely scars and edema",
        "2211.03062_b702454930df369caf563c8fdb4d3519": "To deal with the complex information from multi-sequence images, we introduce a cross-modal feature fusion architecture to learn both inter- and intra-sequence pathological features",
        "2211.03062_97796e53d5ecaf4ef5375a6a6e996803": "To efficiently localize the pathology regions, we adopt a myocardium prior and consistency module to impose constraints on the myocardium",
        "2211.03062_cd7bb9de95547152bb43c745d039abf4": "Finally, considering the spatial relations between the pathologies,",
        "2211.03062_33fa9c1dbdc5b2cd2253949c386c0c10": "scars lying inside edema, we further develop an inclusiveness loss, as a regularization term, to incorporate this prior knowledge into the process of feature learning and segmentation inference",
        "2211.03062_386d92d86eeb85e75890843890009150": "The remaining paper is organized as follows: Section",
        "2211.03062_9cb2f8fdcf38db65e1a82888168769cc": "reviews the related research",
        "2211.03062_d203ca9666704752dc63fc3b28375a28": "The detailed structure of MyoPS-Net is described in Section",
        "2211.03062_d2c24d59e0baff4d0155fbdf62590867": "Section",
        "2211.03062_4a8d7448ef7202c82a85f6a0ad1d8e55": "illustrates the experiments and results and Section",
        "2211.03062_b367226749a0cc9c23d7da27d9ce96e1": "presents the discussion and conclusion.",
        "2211.03062_92e1f3949b053f63865cd5024bf136be": "Related work",
        "2211.03062_78caf05d246a613f68a89bcca2feec33": "\\begin{figure*}[!t]\n\\centering\n\\includegraphics[width=0.99\\textwidth]{pic/structure.pdf}\n\\caption{The proposed MyoPS-Net consists of three major parts. MPC represents the myocardium prior and consistency module and CMFF denotes the cross-modal feature fusion module. For the optional scar/edema decoders, which are detailed in Section~\\ref{3.1}, one can either use one decoder or two decoders to perform pathology segmentation. The parenthesis and numbers are indices of equations in the text, and Myo and LV represent the myocardium and left ventricle, respectively. Here, mappings (T1 mapping and T2* mapping CMR images) are fed into the CMR encoder in two channels.}\n\\label{structure}\n\\end{figure*}",
        "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8": "Myocardial pathology segmentation",
        "2211.03062_024de845b61e77213c75531ed466b6a3": "For myocardial pathology segmentation, there exists a series of conventional algorithms",
        "2211.03062_330a1ed86c878ba3dceb06027459f7cf": "utilized threshold methods for scar segmentation based on the intensity differences between healthy and diseased myocardium.",
        "2211.03062_dc19dc2df4ffd97d8482237c9e15c85d": "combined the threshold segmentation with a morphological filtering algorithm for edema segmentation",
        "2211.03062_fd0040964b176e1a0074a97292f6e496": "Considering the drawbacks of thresholding methods,",
        "2211.03062_c8b38645106bdcf8cfab94b845d10e3b": "\\citet{ukwatta2015myocardial}",
        "2211.03062_267809db8f707901ac58a00469f361dc": "formulated a continuous max-flow optimization problem for edema segmentation",
        "2211.03062_5b5ec79ead23daf80afad1a6b7e7c2e7": "Moreover, graph-cuts were also employed for pathology segmentation",
        "2211.03062_7f87f1009814a5423fa10f26906376f3": "\\citep{lu2012automated}",
        "2211.03062_7b03c033fe6e6df993d85348f92fab49": "Recently, deep learning (DL)-based algorithms have presented satisfying performance in the field of medical image segmentation",
        "2211.03062_d8095b5466ca746231b4c47e363fa25b": "In particular, convolution neural networks (CNNs)",
        "2211.03062_555cd12384bfc07623549e15de02923f": "\\citep{albawi2017understanding,sultana2020evolution}",
        "2211.03062_5a5bb627a87a8467ffe230d0723d2bc1": "have the widest applications in the field of image segmentation",
        "2211.03062_1a94acbb1f769aca032b0993a1a1f95f": "\\citet{li2020atrial}",
        "2211.03062_a487ff942b8ecbe877cadedcff88d321": "proposed a LearnGC framework for scar quantification from LGE CMR images by combining CNNs and graph-cuts.",
        "2211.03062_0d59f9005baeabf707319e2f670f0493": "\\citet{moccia2019development}",
        "2211.03062_8f64f0018ee018045504e117d07f9241": "introduced fully convolutional networks to quantitatively evaluate myocardial scars",
        "2211.03062_63b4671937fec3f0d7076c819a3b2857": "Specially, with the emergence of U-Net",
        "2211.03062_ace07cd9962cfe7dae4a78ad2bd4c7f5": "\\citep{unet}",
        "2211.03062_49c20dd31e5546aac8da9cde423d3bb2": ", an extremely huge proportion of medical image segmentation frameworks are proposed on the basis of U-Net",
        "2211.03062_15d7a063b0b63dfbd497eee0267a652e": "\\citet{li2020joint,li2022atrialjsqnet}",
        "2211.03062_ef2e9ad96a07d09e87311470bcad283c": "proposed a multi-branch U-Net to perform multi-task learning of joint left atrial segmentation and scar quantification on LGE CMR images.",
        "2211.03062_d1c60133086bb93910f7992b4c11d622": "\\citet{zabihollahy2020fully}",
        "2211.03062_0ba8c587dbcc0e6461ce12f85b99dc04": "performed automatic scar segmentation with a cascaded multi-planar U-Net",
        "2211.03062_8e026f3398f1ae72f3327ea5bf769392": "To the best of our knowledge, most of the work merely concentrated on either scar or edema segmentation and usually employed a single CMR sequence",
        "2211.03062_189e67550ed1c5ec6ac1f625f248d4f0": "With the growth of the modeling ability of deep learning frameworks, studies have recently focused on combining multi-sequence information for MyoPS to leverage abundant pathology-related features provided by multi-sequence CMR images",
        "2211.03062_f7cf5c3b29a96c793981fd3e00594974": "A two-stage segmentation strategy has been proposed to segment scars and edema simultaneously",
        "2211.03062_a7f5937801e45f2b821c95c709aba28f": "\\citep{myopschallenge-twostage-2,myopschallenge-twostage-1, myopschallenge-twostage-3}",
        "2211.03062_a20b71d61c482ad25c30489f4c08761f": ", in a coarse-to-fine manner.",
        "2211.03062_29216d2ab318dafb96bc57820ab0f087": "\\citet{myopschallenge-twostage-3}",
        "2211.03062_2ac264861e905b05a09665c85bca0fbf": "employed a modified nnUNet",
        "2211.03062_b5b7118c9d0b0a7b7528ad91e528a59c": "\\citep{nnunet}",
        "2211.03062_f87f22a162bec3653efc4e1149f94f37": "to effectively modeling pathological information.",
        "2211.03062_11228d63a88a838a295704622b19f3ae": "\\citet{CMS-UNet}",
        "2211.03062_6deef392afc20a82c730b5c5f760561b": "employed one shared encoder to collect features from multi-sequence CMR images.",
        "2211.03062_116c29ddcab78e05516b95a2b5b1acea": "\\citet{ApplicationtoCMR}",
        "2211.03062_4137e03436514c9db384d444c86ffdea": "proposed a fully automatic pathology segmentation framework consisting of an anatomical structure segmentation network and a pathological region segmentation network.",
        "2211.03062_de5d123feaa9e889d9357d3b11474f8f": "\\citet{Dual-Path}",
        "2211.03062_1dfb7ac7762504ef9abdb485d557664f": "introduced a multi-layer fusion to merge features from multi-sequence CMR images",
        "2211.03062_e905df6d9e5e591f26da4eb4ce28bffd": "From a new perspective,",
        "2211.03062_0cfb633205a664cdcd70de039512e043": "\\citet{AWSnet}",
        "2211.03062_b2a55a02f9aaf2ab94f0ca3bc9a3a50e": "combinedly utilized deep supervision and deep reinforcement learning for MyoPS",
        "2211.03062_f8d715d6e6e63767334008e554a123fd": "Besides, considering the fuzzy boundaries and the class-imbalance problem of scars and edema,",
        "2211.03062_544d25b26de15bbdff824a977d8e06e3": "\\citet{EfficientSeg}",
        "2211.03062_dcb87f2d1791d89cfb4a6e48903fb355": "proposed a boundary loss to perform MyoPS based on an efficient net",
        "2211.03062_41742ada7ab8d10c40aadcf91903c72b": "\\citep{tan2019efficientnet}",
        "2211.03062_5058f1af8388633f609cadb75a75dc9d": ".",
        "2211.03062_92268b880ae01443108d3e3f99b66222": "Deep learning based multi-modality medical image segmentation",
        "2211.03062_ce6574a4858c67183217dc992a02efad": "Multi-modality is a typical characteristic in the field of medical image analysis",
        "2211.03062_ab21f902445527864db83d839df33903": "As multi-modality images could usually provide much more information than single modality ones, studying multi-modality images has thus become a hot spot",
        "2211.03062_e974155c077b762bb19490d2068e69a1": "\\citep{journal/MedIA_review/li2022}",
        "2211.03062_27764ed5dfae9275c7ad301f58e1e740": "Recently, some challenges were held for multi-modality medical image segmentation, such as BraTS Challenge",
        "2211.03062_e18f222365511da65bdace49deb08cec": "\\citep{menze2014multimodal}",
        "2211.03062_2d702c6cd167f4c2a413a3d34ad3ad60": ", CHAOS Challenge",
        "2211.03062_504c008c7d04f46aec1b662d0e2078f0": "\\citep{chaos}",
        "2211.03062_cf59205576503e6f8e1476a339a42610": ", MM-WHS Challenge",
        "2211.03062_7850062ce9582eb376817a8a6a6880b8": "\\citep{journal/MedIA/zhuang2019}",
        "2211.03062_00b133511f6a363534ceb99b00153798": ", MS-CMRSeg Challenge",
        "2211.03062_d0a81d66ceb2d2ba2bc87f6e2b3ce648": "\\citep{journal/MedIA/zhuang2022}",
        "2211.03062_b64d84b771c46227fb9a831f73c38f4c": "and MyoPS Challenge",
        "2211.03062_4c1566e303a454fbf7dc3b2e5bd114f5": "\\citep{myopsbenchmark}",
        "2211.03062_038a2599b47494be6cd60e8f647236da": "These challenges further arouse the research interest towards fusing multi-modality information",
        "2211.03062_25c1ca3f0650fcddb44592a2f64cc4b2": "\\citep{zhou2019review}",
        "2211.03062_23761c713e8a689e714aad067051fe1d": "Specifically, the fusion strategy of network architectures can be divided into three categories, namely input-level fusion, layer-level fusion and decision-level fusion",
        "2211.03062_f4e41c08ca6f6d53069f0251bab107b2": "The proposed MyoPS-Net introduces a fusion strategy from the layer level",
        "2211.03062_f896fdba89f53407d63171d02f996a0c": "As for the input-level fusion strategy, medical images from multi-modality are directly concatenated to generate the multi-channel inputs of the network",
        "2211.03062_3f1f63fb3007b2b28d566a28239e2d67": "\\citep{input-1,input-2,input-3}",
        "2211.03062_0af4a202d50fc5fb4bb3c8d67bc335ce": "This strategy obviously treats multi-modality images equally and thus concentrates on the formulation of the network architecture",
        "2211.03062_e6b6392495f1ee7549f33716ec06b31d": "\\citet{yang2018automatic}",
        "2211.03062_588a4a3792a780958a709618b61fe838": "employed a residual U-Net and generative adversarial networks to perform brain tumor segmentation simply by fusing multi-modality images as multi-channel inputs",
        "2211.03062_614aaed9584d92dd8a545f5e3162ac0d": "When it comes to the layer-level fusion method, each modality image is individually transferred into the network to extract features",
        "2211.03062_1efe7cf6719d7200b430155c12dc3e19": "Different from input-level strategy, layer-level fusion focuses on modifying the network architectures",
        "2211.03062_312e430b1ab81faceac383b47a27b432": "The multi-modality features are fused inside the layer of the networks and are then synthesized into a unified feature representation for the final segmentation.",
        "2211.03062_d5f2ed6d7f1d408d7cf07cead76a4d14": "\\citet{layer-1}",
        "2211.03062_93e98d82849acb9a489f656e097ca2a1": "proposed a convolution neural framework based on DenseNets with dense connections between multi-modality features.",
        "2211.03062_dd042bcd43ad78aee0d19ace0e6834a8": "introduced a dual-path strategy to fuse features from multi-sequence CMR images for MyoPS.",
        "2211.03062_3f1ce56760d72f2dfcb749b3591effa0": "\\citet{zhao2021united}",
        "2211.03062_30eeb536c7f0468912971ab4179c6e7b": "combined layer-level fusion with adversarial learning for liver tumor segmentation",
        "2211.03062_921a8eea27f40856d2f8ed22966e216d": "Further, some disentanglement-based methods were recently introduced for multi-modality segmentation",
        "2211.03062_1c040f93eba02c0728b7243af7a13d36": "\\citep{chen2019robust,pei2021disentangle}",
        "2211.03062_286362fa6ab295744e2f36cb5a1af40c": "In the decision-level strategy, similar to the above layer-level one, multi-modality images are trained with independent networks to generate the corresponding features",
        "2211.03062_a412fa40e8e57c4fd0d341cccd1754a9": "However, there exist none of feature transmissions between different modalities",
        "2211.03062_1b03c4df6a77b721bf6ba0f7d752098f": "The multi-modality information is fused at the lower layer of the encoders and these mixed features will be employed to acquire the segmentation results",
        "2211.03062_ec8496ba9bf6616ae95f1b48b51061e6": "\\citep{decision-1}",
        "2211.03062_4c3880bb027f159e801041b1021e88e8": "Method",
        "2211.03062_09574c63724673b99ce2941ede757bc2": "Fig.",
        "2211.03062_c88d0726d10389525344e3776516ff05": "provides an overview of the proposed MyoPS-Net that can combine different CMR images, such as C0, LGE, T2, T1 mapping and T2* mapping CMR images for MyoPS",
        "2211.03062_53fe925bbd3d38885bfddd0125520e37": "MyoPS-Net is an end-to-end architecture consisting of a cross-modal feature fusion module (Section",
        "2211.03062_e0124ae12f01f6ccb4180b58802f1217": "), two assisting modules for imposing myocardium prior and consistency (Section",
        "2211.03062_bb0219b78405f5acdd6941f9ac5cd38f": ") and pathology inclusiveness constraints (Section",
        "2211.03062_9371d7a2e3ae86a00aab4771e39d255d": ")",
        "2211.03062_30d6a6c03fdda920b0475e8e665e2c6f": "Besides, the proposed MyoPS-Net can be applied to four different scenarios in practical clinics (Section",
        "2211.03062_ce96ce64475d88003b81a20710c10f5e": ").",
        "2211.03062_ee5da2a90cdaef173f131eb51284df2e": "Cross-modal feature fusion for multi-sequence CMR",
        "2211.03062_bd3043243380402482d55ea31217975d": "Each of the multi-sequence CMR images has a specific influence on the final results of MyoPS",
        "2211.03062_7a065296b38812bbd176365cc4a9c5f8": "For example, LGE CMR is promising in discriminating myocardial scars, but it also provides complementary information for edema segmentation",
        "2211.03062_7ad0f5cb7670b5a2fec2b2f63a4df830": "Therefore, it is crucial to fuse multi-sequence features to excavate hidden inter-sequence relations",
        "2211.03062_04eee1a4413912f5b33a438434482c5b": "We propose a cross-modal feature fusion (CMFF) module to fuse multi-sequence information",
        "2211.03062_f39cdd6f932c4e50c2cd2d72f95ea927": "CMFF is the main architecture of MyoPS-Net, as Fig.",
        "2211.03062_19a6f8c4116f0a27fcf122422af6785b": "shows, and is designed to effectively extract the features contained in the CMR images (via CMR encoders), and fuse them for pathology segmentation (via scar/ edema decoders)",
        "2211.03062_35f94b37cc9079b591a56264d02e073e": "For feature fusion, CMFF adopts two operations, namely max operation and skip connection",
        "2211.03062_4b78aaca46338de8abba835dd0a26a9f": "illustrates the detail of network architecture",
        "2211.03062_cae6404c4aecf46684930fe2a86676a6": "Let",
        "2211.03062_98fae63be17ea3bea5c3d646520a918e": "$\\phi_{n}^{l}$",
        "2211.03062_7851067219972c69b562351387321194": "be the multi-scale features of CMR encoders, where",
        "2211.03062_0af07ec463ca3b53e12d99864e721fcd": "$n \\in \\{1,\\cdots,N\\}$",
        "2211.03062_5e1acaa186b7bdf41cde7caa4d90e729": "denotes the index of CMR sequences except C0, and",
        "2211.03062_f0978eb3e52dce313e6e9f74ce9c378c": "$l \\in \\{1,\\cdots,k\\}$",
        "2211.03062_7979896a44edf3ec77821c17a493286f": "means the index of layers of encoders",
        "2211.03062_69c3ec0e7db052185c869f6ac083987f": "Therefore, a pixel-wise max operation is performed on these features as follows,",
        "2211.03062_d2d97accc13f671c72189be388fb2995": "\\begin{align}\n    \\hat{\\phi}_{n}^{l} &= \\max\\{\\phi_{1}^{l}, \\phi_{2}^{l}, \\cdots,\\phi_{n-1}^{l}, \\phi_{n+1}^{l}, \\cdots, \\phi_{N}^{l}\\},\n\\end{align}",
        "2211.03062_567904efe9e64d9faf3e41ef402cb568": "where",
        "2211.03062_8226196109aadeaaac59d7de9a9d1645": "$\\hat{\\phi}_{n}^{l}\\ (n \\in \\{1,2,\\cdots,N\\})$",
        "2211.03062_f148a579b50ca37aa363eb41495724e5": "means the fused features from all other",
        "2211.03062_e35caf405a5e9b4afd75a0d338c4dc12": "$N-1$",
        "2211.03062_b12839c73cf6018651f4b4c3d4a6aaa7": "sequences except the sequence",
        "2211.03062_55a049b8f161ae7cfeb0197d75aff967": "$n$",
        "2211.03062_847c10c4d4b1b0f01e5f2ea7bbc6aca3": "Denote",
        "2211.03062_cb262f3521d52153877b8697e0659e2e": "$D_\\text{scar}$",
        "2211.03062_8288e85a4f6f484399f0dd374474621b": "$D_\\text{edema}$",
        "2211.03062_1ed70afcf72430a8a9fa37d91bc7d636": "as the sets of scar decoders and edema decoders, respectively",
        "2211.03062_407eb80678563a78ce227e8ef725fe2d": "When the fused features are obtained, we then introduce connections from",
        "2211.03062_2195a984fd9a202c45bcb7bf5751db4e": "$\\hat{\\phi}_{n}^{l}$",
        "2211.03062_8e8acf1944b5cf89578b43fb0bee6f4a": "to the corresponding layers of pathology (scar or edema) decoder",
        "2211.03062_df8a69d7c8c99faf6fd1317d383de069": "in the set",
        "2211.03062_e81c4e4f2b7b93b481e13a8553c2ae1b": "or",
        "2211.03062_231acad5a014d4abb8f37277a8888567": "With this module, the pathology segmentation networks can learn cross-modal information through multi-scale features from all other sequences",
        "2211.03062_272dfca67902622664228cdcc7d68211": "In our application, we have four CMR sequences to perform pathology segmentation,",
        "2211.03062_7e53b1e945ee23f69fa84252894db208": "LGE, T2, T1 mapping and T2* mapping CMR",
        "2211.03062_80dd67ce287f238e6429e81f7bcab53c": "We adopt three encoders for these four CMR sequences,",
        "2211.03062_e2940bea2a80cee8d542fad04800ed38": "one for LGE, another for T2 and a third for mappings (T1 mapping and T2* mapping), to extract pathological features",
        "2211.03062_8305b1b69b4ae416992d2a31bb965cb0": "For decoders, note that for each CMR sequence above, one can either use two decoders, respectively for scars and edema, to perform pathology segmentation, or use just one to more effectively segment one type of pathology",
        "2211.03062_6efba753c07c851106bfaae790eea012": "For example, in this work we propose to couple a scar decoder to LGE CMR, an edema decoder to T2 CMR, and a scar decoder to mapping CMR according to the clinical knowledge and experimental results from Section",
        "2211.03062_ab4fbedc92fc024e8f15e5849134cf24": "\\begin{figure}[!t]\n\\centering\n\\includegraphics[width=0.99\\linewidth]{pic/cross_modal_module.pdf}\n\\caption{Architecture of cross-modal feature fusion module on $s$-th CMR sequence. Here, we take the CMR 2 Scar Decoder ($s=2$) as an example for illustration.}\n\\label{crossmodal}\n\\end{figure}",
        "2211.03062_0aff06c7bccefdf718b3a5381462c47f": "Constraint for myocardium prior and consistency",
        "2211.03062_3e4d2242a93534f3032d7b919f986964": "Since scars and edema lie in the myocardium, it is straightforward to consider the myocardium as a prior",
        "2211.03062_5a12429f67bdb4be4d06574b0bbe0278": "Existing methods usually segment the myocardium via a separated network and then employ the cropped ROIs for further MyoPS",
        "2211.03062_c34ebc039c7df2328daf4acd0512cd69": "This requires the myocardial segmentation tool to be reliable, since it is the prerequisite for following MyoPS",
        "2211.03062_23fca316be4a96dfb53d13e22447e1b0": "Here, we instead propose to embed a myocardium prior and consistency (MPC) module in the MyoPS-Net to localize the pathologies",
        "2211.03062_02d9436fc5a7d4ab006c2a4ae2bf03ef": "Denote the five sequences of CMR images, namely C0, LGE, T2, T1 mapping and T2* mapping CMR, as",
        "2211.03062_789c9e1d65a8b3f2bf1341368609154c": "$I_{\\text{C0}}$",
        "2211.03062_c0cb5f0fcf239ab3d9c1fcd31fff1efc": ",",
        "2211.03062_0f73ebb36ef896bd18d208a1d80c72d2": "$I_{\\text{LGE}}$",
        "2211.03062_a28a01f55d872c60303139b4dc9f908f": "$I_{\\text{T2}}$",
        "2211.03062_25dfcebab04922793a9238895428e8e2": "$I_{\\text{T1m}}$",
        "2211.03062_91d53c2bade5617037b7a4fc261042d3": "$I_{\\text{T2*m}}$",
        "2211.03062_576628cb9e2d81362dfb92e73256c54e": "The input of the MPC module, as shown in Fig.",
        "2211.03062_2449c915f16da484b302a12a784f6655": ", is obtained by directly concatenating these five-sequence images, which can be explicitly expressed as",
        "2211.03062_bfcb33ffbf55e6e521eac88efd6b944e": "$x_{\\text{MPC}} = \\{I_{\\text{C0}}, I_{\\text{LGE}}, I_{\\text{T2}}, I_{\\text{T1m}}, I_{\\text{T2*m}}\\}$",
        "2211.03062_2f9cad8bc680bd74035cfe69cc279b85": "Therefore, the MPC module which employs U-Net",
        "2211.03062_9ba5f1fdb17fb175fb0145f53b9bdacc": "as the backbone can merge distinct features of cardiac structure from the five images and achieve the probability map containing the myocardium (Myo) and left ventricle (LV) information, which is represented as",
        "2211.03062_df79eb87af8c54a204513a6b5a4451ea": "$\\psi_{\\text{MPC}}$",
        "2211.03062_6f86cf596d3559e5d8357c4a0edccb44": "One can easily concatenate these features with the raw images",
        "2211.03062_448fab9fa2e5bafab36ddd60054fcebb": "\\begin{align}\n    x_{\\text{LGE}} &= \\{I_{\\text{LGE}}, \\psi_{\\text{MPC}}\\},\\\\\n    x_{\\text{T2}} &= \\{I_{\\text{T2}}, \\psi_{\\text{MPC}}\\},\\\\\n    x_{\\text{mappings}} &= \\{I_{\\text{T1m}}, I_{\\text{T2*m}}, \\psi_{\\text{MPC}}\\},\n\\end{align}",
        "2211.03062_c46683834c3cab6a8fb005997d9e2862": "as inputs of pathology networks, which then benefit from the myocardium prior for localizing and segmenting pathologies within the myocardium",
        "2211.03062_4475f6636739e9f4a47f9dc956175077": "Therefore, we propose a consistency loss on the MPC module, to regularize the invariability of the myocardium",
        "2211.03062_717c2c5c214f38439160261887860d49": "Specifically, we reformulated the probability maps into two parts,",
        "2211.03062_7a9d8237846e73034b6172723921c281": "$myo$",
        "2211.03062_6a659c135db4dcca9c3bde19fd2fb5ab": "$\\overline{myo}$",
        "2211.03062_8e712c6376fdada573a2512853a7ba91": "Here,",
        "2211.03062_da853580ee25afaf3f870ac3067d6346": "illustrated the probability of being identified as the myocardium, while",
        "2211.03062_426440680bde60f5c0e4c0e597b094a8": "indicates the probability of all other structures except the myocardium",
        "2211.03062_fe13a5c9f632393ad11e108d62ca1498": "The reformulated probability maps are defined as follows,",
        "2211.03062_41d693af9f0557fce9c121def08ab892": "\\begin{align}\n    \\hat{\\psi}_{\\text{MPC}} &= \\{\\psi_{\\text{MPC}}^{myo},\\psi_{\\text{MPC}}^{\\overline{myo}}\\},\\\\\n    \\hat{\\psi}_{s} &= \\{\\psi_{s}^{myo},\\psi_{s}^{\\overline{myo}}\\},\\\\\n    \\hat{\\psi}_{e} &= \\{\\psi_{e}^{myo},\\psi_{e}^{\\overline{myo}}\\},\n\\end{align}",
        "2211.03062_10d45d2a9ee410c6cde408f174479905": "$\\hat{\\psi}_{\\text{MPC}}$",
        "2211.03062_182f7a093187408727176e7a1c69aa14": "represent the modified and original probability maps of the MPC module, respectively.",
        "2211.03062_eb33163f1bcf2cef867d768b6ef0d9ce": "$\\hat{\\psi}_{s}$",
        "2211.03062_04428787ec9dab0b4905016b3bf89dab": "$\\psi_{s}$",
        "2211.03062_f59ea332bbde9c6ed9bf1a90a3d5b6ff": "are the probability maps where",
        "2211.03062_2600d241b3f714f21203f760b89abc8d": "$s \\in D_\\text{scar}$",
        "2211.03062_3cb1735e7fc14ee61771dbc63a75bc49": ", while",
        "2211.03062_2a07cf48a9efc34c147b97e5ca5afd58": "$\\hat{\\psi}_{e}$",
        "2211.03062_9d5b017135195b67c0933dd59e17b3d5": "$\\psi_{e}$",
        "2211.03062_473f12b4a2b1577e4932017179bcb1ac": "stand for the probability maps where",
        "2211.03062_2a14b84f0741839a149116347831d620": "$e \\in D_\\text{edema}$",
        "2211.03062_4bbe9a2137a5377a318b7f2b58175a17": "The consistency loss is then given by,",
        "2211.03062_a81d1f3e6423d4be12514073ad01fe47": "\\begin{align}\n    \\mathcal{L}_{con} = \\sum_{i\\in D_\\text{scar} \\cup D_\\text{edema}} \\mathcal{L}_{cos}(\\hat{\\psi}_{\\text{MPC}},\\hat{\\psi}_{i}),\n\\end{align}",
        "2211.03062_cae4b68e74b5bff6536b16cfc67ae29f": "\\begin{align}\n    \\mathcal{L}_{cos}(\\hat{\\psi}_1,\\hat{\\psi}_2) = 1 - \\frac{\\hat{\\psi}_1 \\cdot \\hat{\\psi}_2}{\\Vert \\hat{\\psi}_1 \\Vert \\cdot \\Vert \\hat{\\psi}_2 \\Vert},\n\\end{align}",
        "2211.03062_bba94edd3580ea1ab3fe2d2f154d9d1e": "is the cosine similarity loss and",
        "2211.03062_3b1658c4f4f5f8ff3dd23a0b1519c6b0": "$\\Vert \\cdot \\Vert$",
        "2211.03062_a2a551a6458a8de22446cc76d639a9e9": "is",
        "2211.03062_4327ea69d9c5edcc8ddaf24f1d5b47e4": "$L_2$",
        "2211.03062_695a464bd05db859f8720e5bb34ecf52": "norm.",
        "2211.03062_902df40a1344cebf5412dec73776bc07": "Constraint for pathology inclusiveness",
        "2211.03062_3fc1fd1b081ca50c86bc56f9c93e61cd": "As shown in Fig.",
        "2211.03062_1889d9abfb4c376e8f1bbf5fe9f8544c": ", scars lie inside of edema",
        "2211.03062_04f0cf8472bf8cac6e60e65ce2ad5be4": "To embed this prior knowledge, we introduce a pathology inclusiveness (PI) loss in the MyoPS-Net which can be applied to both labeled and unlabeled data.",
        "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1": "Pathology inclusiveness loss for labeled data",
        "2211.03062_f931fbafe40dbe2de2a57dccb7d79fde": "$y_\\text{scar}$",
        "2211.03062_73c7f00002864b85e14bca87c6554d71": "$y_\\text{edema}$",
        "2211.03062_676842ca8d00749cc725228f25900f80": "represent the ground truth of scars and edema, respectively",
        "2211.03062_5c1ca4e2f301c88b4719cf737cb548ad": "The inclusiveness loss on labeled data (",
        "2211.03062_ddcb483302ed36a59286424aa5e0be17": "$L$",
        "2211.03062_60e3c6bee8b840810926c1ff5c81c486": ") is then formulated as follows,",
        "2211.03062_959df9970b29ed08ffde4e49a5f6ec38": "\\begin{align}\n    \\label{eq:incloss:L}\n    \\mathcal{L}_{inc,S}^{L} & = - \\frac{1}{\\omega_{\\text{edema}}} \\sum_{s \\in D_\\text{scar}} \\sum_{i \\in \\Omega} (1-y_\\text{edema})\\log (1-\\psi_{s}^\\text{scar}), \\\\\n    \\mathcal{L}_{inc,E}^{L} & = - \\frac{1}{\\omega_{\\text{scar}}} \\sum_{e \\in D_\\text{edema}} \\sum_{i \\in \\Omega} y_\\text{scar}\\log \\psi_{e}^\\text{edema},\n\\end{align}",
        "2211.03062_58224af49e0b9c55ba84740bed7e456e": "$\\mathcal{L}_{inc,S}^{L}$",
        "2211.03062_f66f0982703539d259f00ddea45b5418": "$\\mathcal{L}_{inc,E}^{L}$",
        "2211.03062_2951180cc453b1995ae7d39b680ca99c": "are respectively for scar and edema decoders, and the superscripts scar and edema refer to the corresponding channel of the probability maps",
        "2211.03062_2017a42786202e4de1e70fe372a5ddf2": "These two factors",
        "2211.03062_86c7e8538301d93c2c2f3e9a9d16f360": "$\\omega_{\\text{scar}}, \\omega_{\\text{edema}}$",
        "2211.03062_4ca9893001742dd2c46ff6e08b2b842a": "are employed to guarantee the robustness of the inclusiveness loss against diverse sizes of pathology areas, with the expressions of",
        "2211.03062_4549920b85c667f6afc13ffeac4e398b": "$\\omega_{\\text{scar}} = \\sum_y y_\\text{scar}, \\omega_{\\text{edema}} = \\sum_y (1-y_\\text{edema})$",
        "2211.03062_2df508a5e9e5ea2fc7d9dc5947420fc1": "Therefore, the total inclusiveness loss for MyoPS-Net on labeled data can be expressed as,",
        "2211.03062_88537b2ad34251c73257bc33c88bbd45": "\\begin{equation}\n    \\mathcal{L}_{inc}^{L} = \\mathcal{L}_{inc,S}^{L} + \\mathcal{L}_{inc,E}^{L}.\n\\end{equation}",
        "2211.03062_df28b8e0988673de57828c5c79d36d85": "\\begin{figure}[!t]\n    \\centering\n    \\includegraphics[width=0.85\\linewidth]{pic/inclusiveness.pdf}\\\\[-1ex]\n    \\caption{The pathology inclusiveness between myocardial scars and edema.}\n    \\label{inclusive}\n\\end{figure}",
        "2211.03062_9cca6cedf5aed3dd04af8db1ff4fee87": "Pathology inclusiveness loss for unlabeled data",
        "2211.03062_7fac4135749bb14bf51374830d207fcf": "Overall loss",
        "2211.03062_2d7675b2de74ca494f1e2a8f483a3a92": "\\begin{table*}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{\\label{practical}The detailed settings of four scenarios for practical usage of the proposed MyoPS-Net. The last two columns $D_\\text{scar}$ and $D_\\text{edema}$ represent the sets of scar decoders and edema decoders, respectively.}\n    \\centering\n    \\resizebox{0.99\\linewidth}{!}{\n    \\begin{tabular}{p{2.5cm}|p{1.5cm}<{\\centering}p{2cm}<{\\centering}p{2.5cm}<{\\centering}|p{6.5cm}|p{3cm}}\n         \\toprule\n         \\multirow{2}*{Model} & \\multicolumn{3}{c|}{Training/ Test Data} & \\multirow{2}*{$D_\\text{scar}$} & \\multirow{2}*{$D_\\text{edema}$}\\\\\n         \\cline{2-4}\n    \t  ~ & All CMRs & \\{C0,T2,LGE\\} & \\{C0,T2,mappings\\} & ~ & ~\\\\\n        \\midrule\n        MyoPS-Net & $\\checkmark$ & $\\times$ & $\\times$ & \\{LGE scar decoder, mappings scar decoder\\} & \\{T2 edema decoder\\}\\\\\n        MyoPS-Net-L & $\\times$ & $\\checkmark$ & $\\times$ & \\{LGE scar decoder\\} & \\{T2 edema decoder\\}\\\\\n        MyoPS-Net-M & $\\times$ & $\\times$ & $\\checkmark$ & \\{Mappings scar decoder\\} & \\{T2 edema decoder\\}\\\\\n        MyoPS-Net-mix & $\\checkmark$ & $\\checkmark$ & $\\checkmark$ & \\{LGE scar decoder, mappings scar decoder\\} & \\{T2 edema decoder\\}\\\\\n        \\bottomrule\n    \\end{tabular}}\n\\end{table*}",
        "2211.03062_520f8149e12c17ad03ffa2edbf931cb1": "The ground truth of myocardial scars and edema may be missing due to time-consuming and laborious manual delineation",
        "2211.03062_4f2169d3ab4dde1e612baf83526005c3": "Therefore, the inclusiveness loss can be modified to operate between the predictions for these unlabeled data (",
        "2211.03062_6bac6ec50c01592407695ef84f457232": "$U$",
        "2211.03062_37967e2e82ae946fd9c12295c29bfcf0": "),",
        "2211.03062_eb648c412cc926ffbd101094d4cb5d40": "\\begin{align}\n    \\label{eq:incloss:U}\n    \\mathcal{L}_{inc,S}^{U} & = - \\sum_{s \\in D_\\text{scar}} \\sum_{e \\in D_\\text{edema}}  \\frac{\\sum_{i \\in \\Omega} (1-\\psi_{e}^\\text{edema})\\log (1-\\psi_{s}^\\text{scar})}{\\sum_{i \\in \\Omega} (1-\\psi_{e}^\\text{edema})},\\\\\n    \\mathcal{L}_{inc,E}^{U} & = - \\sum_{e \\in D_\\text{edema}} \\sum_{s \\in D_\\text{scar}}  \\frac{\\sum_{i \\in \\Omega} \\psi_{s}^\\text{scar}\\log \\psi_{e}^\\text{edema}}{\\sum_{i \\in \\Omega} \\psi_{s}^\\text{scar}},\n\\end{align}",
        "2211.03062_5f181ddbf59d50a7869bfdd0205725b5": "$\\mathcal{L}_{inc,S}^{U}$",
        "2211.03062_3c5054f50fc39db68f2a8f806aeebb6d": "$\\mathcal{L}_{inc,E}^{U}$",
        "2211.03062_66c65df569b7014eff59e89252cf7e91": "are respectively for scar and edema decoders and then the inclusiveness loss for unlabeled data is formulated as follows,",
        "2211.03062_72916bb1f4b20eb4862b3a281834eb94": "\\begin{equation}\n    \\mathcal{L}_{inc}^{U} = \\mathcal{L}_{inc,S}^{U} + \\mathcal{L}_{inc,E}^{U}.\n\\end{equation}",
        "2211.03062_9d426501f072f15bd8c17a0eb2077b35": "With this loss, the pathology networks can effectively perceive the spatial relationship between scars and edema for both labeled and unlabeled data",
        "2211.03062_5bc88f0a0433a0ef5ce9f391c7e1d84d": "With the above three modules, our proposed framework can then be flexibly applied to both labeled and unlabeled data.",
        "2211.03062_1f123bb73ab054f84f25c71ffc419912": "Overall loss for labeled data",
        "2211.03062_027a3f74bf98d4f1d3ac433b943a45b8": "The overall loss function for labeled data is defined as,",
        "2211.03062_ef20f773caa019d41a9c4e08441b8e29": "\\begin{align}\n\\label{all:L}\n    \\mathcal{L}^{L} = \\mathcal{L}_{seg} + \\lambda_{con} \\mathcal{L}_{con} + \\lambda_{inc} \\mathcal{L}_{inc}^{L},\n\\end{align}",
        "2211.03062_98db0943ee7adafbc5ebd36e5ad353bd": "$\\lambda_{con}$",
        "2211.03062_dc90a72c6f762d76ee85881a720e6a0f": "$\\lambda_{inc}$",
        "2211.03062_32276a0ea97d3a8814b9ff28b68435f6": "are two balancing parameters",
        "2211.03062_1e34865235f1657575393f974ad85d19": "Besides,",
        "2211.03062_85c6a72574945aec161de87b7134d58b": "$\\mathcal{L}_{seg}$",
        "2211.03062_bfbda504cad6f568b0b41d5e31ac48b2": "is a segmentation loss,",
        "2211.03062_04a8c4c6e70c9bd4b2ef9cd5efa2659f": "\\begin{align}\n\\label{seg}\n    \\mathcal{L}_{seg} = \\mathcal{L}_{seg}^{\\text{MPC}} + \\sum_{s \\in D_\\text{scar}}\\lambda_{s} \\mathcal{L}_{seg}^{s} + \\sum_{e \\in D_\\text{edema}}\\lambda_{e} \\mathcal{L}_{seg}^{e},\n\\end{align}",
        "2211.03062_5ee8d804bdfa16d262bd7abc38019823": "$\\lambda_{s}$",
        "2211.03062_620474e940d8ec8d7b31e6db4912a77d": "$\\lambda_{e}$",
        "2211.03062_a836a3587add4c69c85527d5866468ff": "are the hyper-parameters",
        "2211.03062_d8eb8c32dc8c762b4514ba18348fef1d": "For each term in",
        "2211.03062_ffa502feea4e57470dd4e14673ec2de2": ", we employ a combination of the Dice loss and the weighted cross entropy (WCE) loss",
        "2211.03062_6607449d83dc398d990c5c9f2f8c6133": "\\citep{sudre2017generalised}",
        "2211.03062_9ea84e341c776d7fae7c134f20bc97c2": "Overall loss for unlabeled data",
        "2211.03062_7753489c74a59477057e90fbec074ec5": "Due to a lack of ground truth, the segmentation loss is dismissed for unlabeled data",
        "2211.03062_df6a8a85e058c4d1f988154d692f5c36": "Therefore, the overall loss function for unlabeled data has the following formulation,",
        "2211.03062_2363a642c3c534ba4e791b2dbfc5681c": "\\begin{align}\n\\label{all:U}\n    \\mathcal{L}^{U} = \\lambda_{con} \\mathcal{L}_{con} + \\lambda_{inc} \\mathcal{L}_{inc}^{U},\n\\end{align}",
        "2211.03062_e4158b19c25edc6ec1177136ee417fd3": "are also the balancing parameters",
        "2211.03062_482ecbc9ae31b1b55aeb0b72fe227b12": "Note that this proposed framework mainly focuses on the fully supervised situation which only has labeled data, while a preliminary study for the semi-supervised situation with both labeled and unlabeled data will be shown in Section",
        "2211.03062_403219e4aaa118fcbf395574a483416f": "Application of MyoPS-Net in practical clinics",
        "2211.03062_383987dcafc2e9754a52a935ee8f0c0e": "Ideally, all the five CMR sequences are available for accurate MyoPS, but in practical scenarios some sequences may be missing",
        "2211.03062_87de98955fb58c3a0526559063629917": "Specifically, mapping CMR images are often excluded from a standard protocol, due to the limited scanning time",
        "2211.03062_3102192b79b2d901540c639b4cb50e70": "Also, due to the injection of contrast agents, many subjects do not take LGE CMR, for example for healthy individuals undergoing a physical examination or for patients with a kidney condition not suitable for gadolinium contrast agents",
        "2211.03062_5f803ee28ee3eb301b2fb8779afe19af": "Therefore, there are four scenarios for practical usage of the proposed MyoPS-Net, as follows.",
        "2211.03062_7bade40785d1f5c1dbec8c0414eaac9a": "List (enumerate)",
        "2211.03062_7d74f3b92b19da5e606d737d339a9679": "Item",
        "2211.03062_a6a6d61ba3f0171f13fae61f787f8046": ": A model trained on full five-sequence CMR and tested solely on five sequence CMR images for MyoPS, which is also referred to as MyoPS-Net-F. Under this setting, the decoder set",
        "2211.03062_5ced8e888602b47435e2b234b8739f61": "contains two scar decoders respectively for LGE and mapping CMR, and the decoder set",
        "2211.03062_7d5438fecc8dbe2ed02902ef64d98260": "contains an edema decoder for T2 CMR.",
        "2211.03062_b4e1790b307056fb5862cf976d4b1e66": ": A model trained on three-sequence CMR,",
        "2211.03062_35d8591e63d277a8ed92825dff7adce7": "bSSFP C0, LGE and T2 CMR, and tested solely on data of such three-sequence CMR images",
        "2211.03062_a653b0645e55098e8fd4661b6affffce": "The decoder set",
        "2211.03062_f9a009290c975b9194c0db0ecb6162d9": "contains only one scar decoder for LGE CMR, and the decoder set",
        "2211.03062_96f9ea6116394b8d22a1f7d2392c6d30": "has the same setting as the first scenario.",
        "2211.03062_e21de9b57570cc1319c4211a6724f658": ": A model trained on four-sequence CMR,",
        "2211.03062_a68812eb118121712a80b6a1d5d37eee": "bSSFP C0, T2, T1 mapping and T2* mapping CMR, and tested solely on data of such four-sequence CMR images",
        "2211.03062_fd75f2ed0ebb05251acaeae9f14f1cac": "Similarly, the decoder set",
        "2211.03062_b41120be023352f4028f3c99f906abc1": "contains a scar decoder for mapping CMR, and the decoder set",
        "2211.03062_ccfaf5ab618b1564904eb05764487e20": "remains unchanged.",
        "2211.03062_692ced8e1d1f315b75ba8ee967e3c8f8": ": A unified model trained on a dataset consisting of all the above three combinations of multi-sequence CMR, and tested on data from any of the above three scenarios",
        "2211.03062_a0623ac5b6354c572295fb86f0543932": "The decoder sets",
        "2211.03062_cff2600f1aeefbcdeeab337eaeb6d84f": "should be modified to the correct forms corresponding to the above three situations.",
        "2211.03062_95ed4603b17305bc68c705b9cb7418c8": "The detailed network architectures of MyoPS-Net-L, MyoPS-Net-M and MyoPS-Net-mix are shown in the Supplementary Material",
        "2211.03062_5d4379645d7525500e4c51e9854b825b": "Note that when more CMR sequences are missing, such combinations can be meaningless and misleading for MyoPS in clinical practice",
        "2211.03062_3e290f166f14c880373839dacbe9dba3": "For example, we have the combination of bSSFP C0 and LGE CMR images for segmentation",
        "2211.03062_9369948de2dc57ad47258cb56bc033e7": "From clinical view, this combination does not provide pathological information to edema, which may reduce the clinical meaning or pathological sense of the model",
        "2211.03062_46bdc60778dc9a71ae87a78ab9f41918": "Therefore, we only considered the above four scenarios of missing either LGE CMR or mapping CMR shown in Table",
        "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0": "Experiments and results",
        "2211.03062_4b944ba9f3c5abeabeb2e06e555a3e5f": "We first illustrated the effectiveness of pathological information from each CMR sequence for MyoPS using two widely used segmentation networks (Section",
        "2211.03062_f6c425aabb4c31c817d0669203bc528f": "Then, we performed four studies to evaluate the effective setting of pathology decoders in the proposed cross-modal feature fusion architecture (Section",
        "2211.03062_b10f824d7f3060966a62273b8ba55ec3": "), the ablated performance of each module in MyoPS-Net (Section",
        "2211.03062_b833b10044fc1cf25332b1c43d3ab641": "), the application of MyoPS-Net in the semi-supervised situation (Section",
        "2211.03062_e0fc2ab8f02cc030d3cd382fd5108151": ") and the applicability of MyoPS-Net to practical clinical scenarios with complex combinations of CMR sequences (Section",
        "2211.03062_e2a60e30d00387790b0320dc1005c65a": "Finally, we validated the proposed method and further applied it to a public dataset with state-of-the-art results for comparisons (Section",
        "2211.03062_7db94fb07e97b89ada12d83e61926059": "Data and experiment setup",
        "2211.03062_f2e9fa3cff820f046008ef80b5e662ca": "\\begin{table*}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{\\label{dataset}The acquisition parameters of the private MS-CMR dataset.}\n    \\centering\n    \\resizebox{0.75\\linewidth}{!}{\n    \\begin{tabular}{p{2.5cm}|p{4.5cm}p{4.5cm}p{3.5cm}}\n        \\toprule\n         Sequence & Imaging type & Slice spacing (thickness + gap) & In-plane resolution\\\\\n        \\midrule\n        C0 & Cine sequence (ED phase) & $8$ mm + $2$ mm & $1.77 \\times 1.77$ mm\\\\\n        LGE & T1-weighted & $8$ mm + $2$ mm & $1.33 \\times 1.33$ mm\\\\\n        T2 & T2-weighted, black blood & $8$ mm + $2$ mm & $1.33 \\times 1.33$ mm\\\\\n        T1 mapping & T1-weighted & $8$ mm + $2$ mm & $1.41 \\times 1.41$ mm\\\\\n        T2* mapping & T2-weighted & $8$ mm + $2$ mm & $2.08 \\times 2.08$ mm\\\\\n        \\bottomrule\n    \\end{tabular}}\n\\end{table*}",
        "2211.03062_df066967875927bfd3b515683c8d6435": "\\begin{table}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{Dice scores of myocardial pathology segmentation on each CMR sequence (LGE, T2, T1 mapping and T2* mapping CMR). The three bars in bold denote which sequence is utilized in the experiments.}\\label{monoseqtabel}\n    \\centering\n    \\resizebox{0.85\\linewidth}{!}{\n        \\begin{tabular}{p{2cm}|p{2.7cm}|p{2.7cm}}\n             \\toprule\n             {Method/ Dice} & {Scar} & {Edema}\\\\\n             \\midrule\n             \\multicolumn{3}{l}{\\textbf{Sequence: LGE CMR}}\\\\\n             \\midrule\n             {U-Net} & {0.558 $\\pm$ 0.128} & {0.563 $\\pm$ 0.120}\\\\\n             {UNet++} & {0.541 $\\pm$ 0.151} & {0.582 $\\pm$ 0.144}\\\\\n             \\midrule\n             \\multicolumn{3}{l}{\\textbf{Sequence: T2 CMR}}\\\\\n             \\midrule\n             {U-Net} & {0.401 $\\pm$ 0.228} & {0.618 $\\pm$ 0.207}\\\\\n             {UNet++} & {0.362 $\\pm$ 0.165} & {0.599 $\\pm$ 0.158}\\\\\n             \\midrule\n             \\multicolumn{3}{l}{\\textbf{Sequence: mapping (T1 mapping and T2* mapping) CMR}}\\\\\n             \\midrule\n             {U-Net} & {0.352 $\\pm$ 0.178} & {0.486 $\\pm$ 0.167}\\\\\n             {UNet++} & {0.353 $\\pm$ 0.187} & {0.455 $\\pm$ 0.180}\\\\\n             \\bottomrule\n        \\end{tabular}\n    }\n\\end{table}",
        "2211.03062_a269bd007135433d93f2277949ef691a": "The private dataset employed in the experiments consists of 50 paired MS-CMR images from five sequences (bSSFP, LGE, T2, T1 mapping and T2* mapping CMR)",
        "2211.03062_51c45b795d5d18a3e4e0c37e8b20a141": "Table",
        "2211.03062_7693c4c40e66b3e7e05df3181c5814cb": "shows the detailed acquisition parameters for each sequence",
        "2211.03062_4928ce489604c334207bf74c530d6f7f": "These five sequences were aligned to a common space via the MvMM method",
        "2211.03062_ee8112de501172fc8f020bc95931594d": "\\citep{zhuang2016multivariate,zhuang2019multivariate}",
        "2211.03062_f5da161108d78357b9868b7df7666e55": "The in-plane resolution was resampled to 1",
        "2211.03062_bdbf342b57819773421273d508dba586": "$\\times$",
        "2211.03062_53f67d895f7f448ddb64653e387f3815": "1 mm",
        "2211.03062_c0611f246b09bd1af1ee1ea03bbe6300": "The average number of slices each image is",
        "2211.03062_dc06bccebb5e14fae128e7761fd5d151": "$3.64 \\pm 1.09$",
        "2211.03062_0e1e15bfba691699599e78c8dcb593b2": ", with the in-plane size ranging from",
        "2211.03062_c8ebe877951f339ceb9011f089536c28": "$275 \\times 339$",
        "2211.03062_01b6e20344b68835c5ed1ddedf20d531": "to",
        "2211.03062_b052add0acbc2e691586dc8b76aad0c8": "$408 \\times 408$",
        "2211.03062_d826026575f512d06800639bb4eb14cf": "The ground truth segmentation of scars and edema was constructed from manual annotations by one cardiologist",
        "2211.03062_c768d8a29bd8f1a6a49ff561061f72d0": "To calculate the intra-observer variations, this cardiologist annotated ten randomly selected cases from this dataset once again",
        "2211.03062_6ddf75a1bf8ac319ea411add9cf25334": "The intra-observer variations in terms of Dice were 0.746",
        "2211.03062_f62db12f95e34116f1f1e827b2c64ce5": "$\\pm$",
        "2211.03062_d6348a8c9be0d371cb03967815578b2e": "0.062 and 0.812",
        "2211.03062_3952d7ea4982da687019a3b850bb0431": "0.042 for myocardial scar and edema segmentation, respectively",
        "2211.03062_d221571f43f7f6223b91b602e80dda0f": "Besides, we invited another cardiologist to delineate the same ten cases for the inter-observer variations, which were 0.704",
        "2211.03062_2394c183727fda43461e295dd0206fd5": "0.092 and 0.779",
        "2211.03062_475266e363eb45a914ec69aedca47ab6": "0.045 for myocardial scar and edema, respectively",
        "2211.03062_8d221ce6a2521dc968fd3b57d6608438": "We randomly split the data into training (",
        "2211.03062_7acc185115b9ffabc044e2079b245b8d": "$25$",
        "2211.03062_31cbd8101a9b4028b1d9fd88a93a76bc": "subjects), validation (",
        "2211.03062_9612eecfec9dadf1a81d296bd2473777": "$5$",
        "2211.03062_53f7055916429e35d101f544c0297b31": "subjects) and test (",
        "2211.03062_ee070bffef288cab28aad0517a35741b": "$20$",
        "2211.03062_102090646b8ac3a508e2a687f72c9109": "subjects) sets",
        "2211.03062_57283acefb1435db39c74bbf18010d4f": "All the paired images were divided into 2D slices as the network inputs, which were cropped into a unified size of",
        "2211.03062_db253fa004a094fcebb922026aa11ee0": "$192 \\times 192$",
        "2211.03062_46a6ce21d55f1c152c44adc6326bc96f": "with a Z-score normalization",
        "2211.03062_4255e506ce2c8244901c0609e1010118": "Data augmentation strategies, such as random rotation, random flip and random crop, were utilized to enrich the diversity of training images",
        "2211.03062_1a76959011460eefc7e2b1e0ecd09ec2": "We employ five evaluation metrics in the experiments,",
        "2211.03062_e141a9c85656a2a34da004d285fb4aed": "Dice score, Hausdorff distance (HD), Accuracy (ACC), Sensitivity (SEN) and Specificity (SPE).",
        "2211.03062_4faef8930c0ee803c5cb1af72e73bcf7": "\\begin{align}\n    \\text{Dice}(S_{pre},S_{gd}) = \\frac{2 \\left|S_{pre} \\cap S_{gd}\\right|}{\\left|S_{pre}\\right|+\\left|S_{gd}\\right|},\n\\end{align}",
        "2211.03062_d3197568201bfc72f5c712edbf4a41de": "$S_{pre}$",
        "2211.03062_a20f6e308484c66ef768a15c900ac02b": "is the prediction result and",
        "2211.03062_a6f9229e12f092cc9c077ca414de340d": "$S_{gd}$",
        "2211.03062_81afd135f9b8fac63f232568fb8c0d03": "is the ground truth.",
        "2211.03062_e502a7d606c32c35b1ef843e3e53f063": "\\begin{align}\n    \\text{ACC} &= \\frac{\\text{TP}+\\text{TN}}{\\text{TP}+\\text{FP}+\\text{FN}+\\text{TN}},\\\\\n    \\text{SEN} &= \\frac{\\text{TP}}{\\text{TP}+\\text{FN}},\\\\\n    \\text{SPE} &= \\frac{\\text{TN}}{\\text{TN}+\\text{FP}},\n\\end{align}",
        "2211.03062_fe3cc388b05433a0bd93d4a73c0e74fd": "$\\text{TP}$",
        "2211.03062_10826252e0a971f80e66f8d39c474a95": "$\\text{FP}$",
        "2211.03062_1e07f77471b53817f6f9b2abed92716b": "are the number of pixels of the true and false positives, which represent the myocardial pathologies",
        "2211.03062_3757b1fd3122f7ae4193b07e0e680cef": "$\\text{TN}$",
        "2211.03062_8bacc88f3fd7a60394eef755d3872f3f": "$\\text{FN}$",
        "2211.03062_d6aeb9b6601c64cf87225caa136e95c1": "refer to the true and false negatives, respectively",
        "2211.03062_8610f582dd2651e196b12337e58e2ecc": "ACC evaluates the overall pixel-wise accuracy of the segmentation results",
        "2211.03062_01a12a16d611b7ce23bb4b853018d9d9": "SEN and SPE measure the ability of models to identify positive and negative pixels, respectively",
        "2211.03062_750639e25d9f96313a2bf8cd2420675d": "The proposed MyoPS-Net was implemented in PyTorch",
        "2211.03062_1c9281e22e366148fbf1242e87a8d53e": "We employed the Adam optimizer to update the network parameters (weight decay =",
        "2211.03062_2c6d2c92561d4eb0752000e383451528": "$0.0005$",
        "2211.03062_d1d5896d3c7497c2513ec83425fcc5df": "The initial learning rate was set to",
        "2211.03062_4a948cc9fe367c32bb82ff93a138c69a": "$0.0001$",
        "2211.03062_0ad1b100c273e2d0fc63dd785eacb13c": "and was adjusted via a cosine annealing strategy with a cycle of",
        "2211.03062_36485149435d99ad961d2158345b7674": "epochs",
        "2211.03062_93cf6eaf6c2baeb73f66ba2cacd50adb": "The balancing parameters were set as follows,",
        "2211.03062_d2a198e284c17df0243e37ececfe4ea9": "$\\lambda_{s} = 2 \\ (\\forall s \\in D_\\text{scar})$",
        "2211.03062_1c86a0bb048e9831601525ccc8a91aae": "$\\lambda_{e} = 2 \\ (\\forall e \\in D_\\text{edema})$",
        "2211.03062_dae26fbcf9573344419544acc8641249": "$\\lambda_{con} = 1$",
        "2211.03062_25fab5c66635e87156ef51bedf00a76f": "$\\lambda_{inc} = 1$",
        "2211.03062_096b13c0d0f83c6340652e59727c8be5": "Our experiments were conducted with a computer with 2.40 GHz Intel(R) Xeon(R) Silver 4214R CPU and a 24G NVIDIA TITAN RTX GPU for 200 epochs",
        "2211.03062_3f7f75b62eb2938002ce8647e6733cc2": "Moreover, the inference of our network required approximately",
        "2211.03062_ffd300db44187d5257725bb009d037ad": "$2.8$",
        "2211.03062_b5453604a9e8ccff5c57ec821bb7e906": "seconds to predict the segmentation of one test case.",
        "2211.03062_86df8044ac1a7c707e1792b2fb6cb353": "Results on single CMR sequence",
        "2211.03062_f5762b406e6d975cb8af6ae47474db73": "\\begin{figure}[!t]\n    \\centering\n    \\includegraphics[width=0.99\\linewidth]{pic/one_sequence_result.pdf}\\\\[-2ex]\n    \\caption{Visualization of MyoPS results on each CMR sequence (LGE, T2, T1 mapping and T2* mapping CMR). Specially, the segmentation results of mapping CMR are superimposed on T1 mapping CMR images. Note that scars and edema are annotated in dark red and dark green, respectively.}\n    \\label{monoseqfig}\n\\end{figure}",
        "2211.03062_e563f284e7b1e406b6615ba0bfb9bace": "\\begin{figure*}[t]\n\\centering\n\\includegraphics[width=0.85\\textwidth]{pic/ablation_study.pdf}\\\\[-2ex]\n\\caption{Visualization of MyoPS results superimposed on LGE CMR from the ablation study. We selected three cases for visualization on the ground of $1/4$, $2/4$, $3/4$ of the average Dice scores, namely a good case, a median case and a poor case. Myocardial scars and edema are delineated in dark red and dark green, respectively.}\n\\label{ablationfig}\n\\end{figure*}",
        "2211.03062_fcd7a8b4176f14a72174f1802fb232a7": "\\begin{table*}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{Quantitative evaluation results of the cross-modal feature fusion architecture under different settings of pathology decoders which are detailed in Section~\\ref{4.3}. \\textbf{Bold} indicates the best performance. Asterisk ($^*$) denotes the statistically significant differences given by a Wilcoxon signed-rank test with $p \\leq 0.05$ between our proposed model \\#5 and each comparison model.}\\label{Paramter}\n    \\centering\n    \\resizebox{0.99\\linewidth}{!}{\n        \\begin{tabular}{p{6cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}}\n             \\toprule\n             \\multirow{2}*{Model Architecture} & \\multicolumn{5}{c|}{Scar} & \\multicolumn{5}{c}{Edema}\\\\\n             \\cline{2-11}\n        \t  ~ & Dice & HD (mm) & ACC & SEN & SPE & Dice & HD (mm) & ACC & SEN & SPE \\\\\n             \\midrule\n             {\\#1. Two decoders for all sequences} & {0.607 $\\pm$ 0.139 $^*$} & {12.6 $\\pm$ 7.98} & {0.873 $\\pm$ 0.060} & {0.583 $\\pm$ 0.170 $^*$} & {0.939 $\\pm$ 0.053} & {0.729 $\\pm$ 0.112} & {18.8 $\\pm$ 9.67} & {0.823 $\\pm$ 0.071} & {0.769 $\\pm$ 0.182} & {\\textbf{0.858 $\\pm$ 0.069}}\\\\\n             {\\#2. Six ($2\\times3$) decoders for 3 sequences} & {0.606 $\\pm$ 0.122 $^*$} & {12.3 $\\pm$ 8.11} & {0.872 $\\pm$ 0.060 $^*$} & {0.573 $\\pm$ 0.167 $^*$} & {\\textbf{0.946 $\\pm$ 0.045}} & {0.723 $\\pm$ 0.075} & {22.1 $\\pm$ 12.4} & {0.807 $\\pm$ 0.067 $^*$} & {0.793 $\\pm$ 0.163} & {0.822 $\\pm$ 0.082 $^*$}\\\\\n             {\\#3. Four decoders (two for mappings)} & {0.631 $\\pm$ 0.147} & {13.1 $\\pm$ 7.62} & {0.873 $\\pm$ 0.068} & {\\textbf{0.631 $\\pm$ 0.208}} & {0.934 $\\pm$ 0.057 $^*$} & {0.708 $\\pm$ 0.112 $^*$} & {20.0 $\\pm$ 11.4} & {0.794 $\\pm$ 0.083 $^*$} & {0.802 $\\pm$ 0.153} & {0.801 $\\pm$ 0.108 $^*$}\\\\\n             {\\#4. Three decoders (edema for mappings)} & {0.626 $\\pm$ 0.126} & {12.4 $\\pm$ 8.24} & {0.876 $\\pm$ 0.057 $^*$} & {0.618 $\\pm$ 0.164} & {0.939 $\\pm$ 0.039} & {0.721 $\\pm$ 0.111} & {20.7 $\\pm$ 12.1} & {0.805 $\\pm$ 0.079} & {\\textbf{0.813 $\\pm$ 0.158}} & {0.807 $\\pm$ 0.097 $^*$}\\\\\n             \\midrule\n             {\\#5. Three decoders (scar for mappings)} & {\\textbf{0.656 $\\pm$ 0.113}} & {\\textbf{11.4 $\\pm$ 9.45}} & {\\textbf{0.886 $\\pm$ 0.049}} & {0.626 $\\pm$ 0.135} & {\\textbf{0.946 $\\pm$ 0.045}} & {\\textbf{0.741 $\\pm$ 0.085}} & {\\textbf{18.6 $\\pm$ 10.6}} & {\\textbf{0.829 $\\pm$ 0.073}} & {0.775 $\\pm$ 0.160} & {\\textbf{0.858 $\\pm$ 0.073}}\\\\\n             \\bottomrule\n        \\end{tabular}\n    }\n\\end{table*}",
        "2211.03062_e9d03c49b51d159700f1175f81510b77": "To illustrate the relative importance of each CMR sequence (LGE, T2, T1 mapping and T2* mapping CMR) for MyoPS, we adopted U-Net",
        "2211.03062_37dbb00abf61d0e16cb1c2f64f56907f": "and UNet++",
        "2211.03062_9da734d8c53716812b7ff613dcf7e33d": "\\citep{unet++}",
        "2211.03062_c286d28a40121b971d78a766a3d8905e": "to conduct these experiments",
        "2211.03062_adf8d4d0456fcf2bbab69f13d31a52bc": "shows the quantitative results in terms of Dice, and Fig.",
        "2211.03062_703a44722f0bbc16163339e26af2cd5b": "visualizes the segmentation results of one randomly selected case",
        "2211.03062_b1dfba4fadfebbd5be836cad9c5913d3": "These models employed 25 cases from each CMR sequence for training and were tested on 20 cases from the same CMR sequence",
        "2211.03062_1fbd1918da2fe5663c57bbb3f5c3caef": "As for LGE CMR, both networks achieved evidently better Dice scores on scar segmentation than the other two sequences",
        "2211.03062_69b74b37db6702535767bb3fe4600d83": "Besides, the Dice scores of edema on LGE CMR were also good, thanks to the accurate scar segmentation which accounts for a major proportion of the edema areas",
        "2211.03062_5a21df3ae6ae32d00e4ba39d5d326c73": "For T2 CMR, its edema segmentation was reliable by both two models, but the scar segmentation had a great drop in Dice scores",
        "2211.03062_b26f6a78ccd776ed5dc4b4969a724272": "This is reasonable as T2 CMR usually provides edema information while LGE CMR mainly offers scar-related information",
        "2211.03062_adaed476e0b72cdcc7504e68a7a20c65": "For mapping CMR, the segmentation of either two types of pathologies was not accurate enough, thus more information from other sequences would be needed for reliable MyoPS.",
        "2211.03062_06a5f95c829f32dec6863a9704a58df3": "Ablation study on the model architecture",
        "2211.03062_45beea27aff4a97e71221d30738d9be9": "\\begin{figure*}[t]\n\\centering\n      \\centering\n    \\subfigure[]{\n    \\label{result:a}\n    \\includegraphics[width=0.45\\textwidth]{pic/scar.pdf}}\n     \\subfigure[]{\n       \\label{result:b}\n        \\includegraphics[width=0.45\\textwidth]{pic/edema.pdf}}\n        \\caption{The scatter point plots and correlation between the Dice scores of the myocardium and the Dice scores of the pathologies (scars and edema in (a) and (b), respectively).}\n\\label{corr}\n\\end{figure*}",
        "2211.03062_d46b43c086eb53d5e45aacd8d5afdb13": "\\begin{table*}[!t]\n  \\setlength{\\abovecaptionskip}{0px}\n  \\setlength{\\belowcaptionskip}{2px}\n  \\renewcommand{\\arraystretch}{1.2}\n  \\caption{Quantitative evaluation results of ablation study on the proposed modules. CMFF: cross-modal feature fusion module. MPC: myocardium prior and consistency module. PI: prior for pathology inclusiveness. \\textbf{Bold} indicates the best performance. Asterisk ($^*$) denotes the statistically significant improvement ($p \\leq 0.05$) of each model compared with the baseline.}\\label{ablationtable}\n  \\begin{center}\n  \\resizebox{0.99\\textwidth}{!}{\n    \\begin{tabular}{p{5cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}}\n     \\toprule\n     \\multirow{2}*{Models} & \\multicolumn{5}{c|}{Scar} & \\multicolumn{5}{c}{Edema}\\\\\n     \\cline{2-11}\n\t  ~ & Dice & HD (mm) & ACC & SEN & SPE & Dice & HD (mm) & ACC & SEN & SPE \\\\\n     \\midrule\n     {Baseline} & {0.560 $\\pm$ 0.133} & {18.7 $\\pm$ 14.4} & {0.849 $\\pm$ 0.055} & {0.595 $\\pm$ 0.182} & {0.907 $\\pm$ 0.058} & {0.668 $\\pm$ 0.152} & {21.8 $\\pm$ 14.0} & {0.789 $\\pm$ 0.082} & {0.714 $\\pm$ 0.202} & {0.824 $\\pm$ 0.078}\\\\\n     {Baseline+CMFF} & {0.614 $\\pm$ 0.137 $^*$} & {14.3 $\\pm$ 8.66} & {0.868 $\\pm$ 0.056 $^*$} & {0.621 $\\pm$ 0.169} & {0.925 $\\pm$ 0.063 $^*$} & {0.721 $\\pm$ 0.099 $^*$} & {19.0 $\\pm$ 11.2} & {0.818 $\\pm$ 0.075 $^*$} & {0.744 $\\pm$ 0.177} & {0.861 $\\pm$ 0.079 $^*$}\\\\\n     {Baseline+MPC} & {0.625 $\\pm$ 0.132 $^*$} & {20.8 $\\pm$ 14.9} & {0.843 $\\pm$ 0.059} & {\\textbf{0.768 $\\pm$ 0.112} $^*$} & {0.865 $\\pm$ 0.062} & {0.717 $\\pm$ 0.118} & {25.2 $\\pm$ 12.6} & {0.800 $\\pm$ 0.060} & {\\textbf{0.823 $\\pm$ 0.135} $^*$} & {0.795 $\\pm$ 0.075}\\\\\n     {Baseline+CMFF+MPC} & {0.627 $\\pm$ 0.119 $^*$} & {13.7 $\\pm$ 9.80} & {0.870 $\\pm$ 0.058 $^*$} & {0.634 $\\pm$ 0.152} & {0.927 $\\pm$ 0.047 $^*$} & {0.733 $\\pm$ 0.111 $^*$} & {19.4 $\\pm$ 10.5} & {0.825 $\\pm$ 0.083 $^*$} & {0.742 $\\pm$ 0.175 $^*$} & {\\textbf{0.879 $\\pm$ 0.065} $^*$}\\\\\n     \\midrule\n     {Baseline+CMFF+MPC+PI (Ours)} & {\\textbf{0.656 $\\pm$ 0.113} $^*$} & {\\textbf{11.4 $\\pm$ 9.45}} & {\\textbf{0.886 $\\pm$ 0.049} $^*$} & {0.626 $\\pm$ 0.135} & {\\textbf{0.946 $\\pm$ 0.045} $^*$} & {\\textbf{0.741 $\\pm$ 0.085} $^*$} & {\\textbf{18.6 $\\pm$ 10.6}} & {\\textbf{0.829 $\\pm$ 0.073} $^*$} & {0.775 $\\pm$ 0.160} & {0.858 $\\pm$ 0.073 $^*$}\\\\\n     \\bottomrule\n  \\end{tabular}}\n  \\end{center}\n\\end{table*}",
        "2211.03062_7a3f575777cb6371c053d8c05b44699b": "\\begin{table*}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{Quantitative evaluation results of the application of MyoPS-Net in the semi-supervised situation. The columns \\textit{Number of data} indicate the specific number of labeled data and unlabeled data in each setting. Asterisk ($^*$) denotes the statistically significant differences ($p \\leq 0.05$) between each semi-supervised model and the corresponding fully supervised model.}\\label{semi-supervised}\n    \\centering\n    \\resizebox{0.99\\linewidth}{!}{\n        \\begin{tabular}{p{1.5cm}<{\\centering}|p{1.5cm}<{\\centering}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}}\n             \\toprule\n             \\multicolumn{2}{c|}{Number of data} & \\multicolumn{5}{c|}{Scar} & \\multicolumn{5}{c}{Edema}\\\\\n             \\cline{1-12}\n        \t Labeled & Unlabeled & Dice & HD (mm) & ACC & SEN & SPE & Dice & HD (mm) & ACC & SEN & SPE \\\\\n             \\midrule\n             {25} & {0} & {0.656 $\\pm$ 0.113} & {11.4 $\\pm$ 9.45} & {0.886 $\\pm$ 0.049} & {0.626 $\\pm$ 0.135} & {0.946 $\\pm$ 0.045} & {0.741 $\\pm$ 0.085} & {18.6 $\\pm$ 10.6} & {0.829 $\\pm$ 0.073} & {0.775 $\\pm$ 0.160} & {0.858 $\\pm$ 0.073}\\\\\n             \\midrule\n             {20} & {5} & {0.645 $\\pm$ 0.115} & {16.5 $\\pm$ 10.5} & {0.873 $\\pm$ 0.054 $^*$} & {0.725 $\\pm$ 0.134} & {0.909 $\\pm$ 0.061 $^*$} & {0.729 $\\pm$ 0.101 $^*$} & {20.6 $\\pm$ 11.3} & {0.808 $\\pm$ 0.083 $^*$} & {0.812 $\\pm$ 0.147} & {0.811 $\\pm$ 0.115 $^*$}\\\\\n             {20} & {0} & {0.628 $\\pm$ 0.125} & {17.4 $\\pm$ 12.9} & {0.848 $\\pm$ 0.069} & {0.744 $\\pm$ 0.166} & {0.876 $\\pm$ 0.074} & {0.697 $\\pm$ 0.088} & {24.6 $\\pm$ 10.5} & {0.768 $\\pm$ 0.074} & {0.853 $\\pm$ 0.105} & {0.738 $\\pm$ 0.113}\\\\\n             \\midrule\n             {15} & {10} & {0.631 $\\pm$ 0.115 $^*$} & {15.1 $\\pm$ 10.8} & {0.862 $\\pm$ 0.062} & {0.686 $\\pm$ 0.163 $^*$} & {0.903 $\\pm$ 0.072} & {0.694 $\\pm$ 0.087} & {27.2 $\\pm$ 12.0} & {0.757 $\\pm$ 0.102} & {0.833 $\\pm$ 0.109} & {0.717 $\\pm$ 0.145}\\\\\n             {15} & {0} & {0.584 $\\pm$ 0.122} & {18.1 $\\pm$ 12.4} & {0.857 $\\pm$ 0.064} & {0.593 $\\pm$ 0.181} & {0.921 $\\pm$ 0.067} & {0.676 $\\pm$ 0.106} & {24.9 $\\pm$ 12.8} & {0.758 $\\pm$ 0.098} & {0.788 $\\pm$ 0.172} & {0.756 $\\pm$ 0.132}\\\\\n             \\midrule\n             {10} & {15} & {0.626 $\\pm$ 0.124 $^*$} & {15.1 $\\pm$ 11.4} & {0.856 $\\pm$ 0.074} & {0.683 $\\pm$ 0.163 $^*$} & {0.893 $\\pm$ 0.092} & {0.685 $\\pm$ 0.094} & {26.3 $\\pm$ 12.3} & {0.759 $\\pm$ 0.091} & {0.822 $\\pm$ 0.131 $^*$} & {0.727 $\\pm$ 0.129}\\\\\n             {10} & {0} & {0.566 $\\pm$ 0.126} & {21.6 $\\pm$ 13.2} & {0.849 $\\pm$ 0.060} & {0.586 $\\pm$ 0.192} & {0.910 $\\pm$ 0.075} & {0.669 $\\pm$ 0.123} & {26.7 $\\pm$ 12.3} & {0.742 $\\pm$ 0.123} & {0.788 $\\pm$ 0.156} & {0.722 $\\pm$ 0.152}\\\\\n             \\bottomrule\n        \\end{tabular}\n    }\n\\end{table*}",
        "2211.03062_f8b28df115ea2042db2e03f15a434387": "To evaluate the effectiveness of the model architecture, we conducted experiments on four different settings of pathology decoders in the proposed cross-modal feature fusion architecture",
        "2211.03062_e4a972193d43df604e0f8cd2c946283e": "illustrates the quantitative evaluation results of these four frameworks along with the proposed MyoPS-Net",
        "2211.03062_a559b87068921eec05086ce5485e9784": "Model",
        "2211.03062_3324ba833d1293c55e31e683dcf49574": "1 employs two decoders (a scar decoder and an edema decoder) for all CMRs to perform MyoPS",
        "2211.03062_0caf66caf66ecdf387c181efd4d66ddb": "Specifically, the fused features from the four CMR sequences except C0 were fed into the scar decoder and the edema decoder for pathology segmentation via a pixel-wise max operation",
        "2211.03062_a15286ab17b25497fd23ec08b7e4d45b": "The detailed structure of Model",
        "2211.03062_d08b3dcb437d35a056cc722fe6c6d711": "1 is presented in the Supplementary Material",
        "2211.03062_73ebaee824bcd3cf1c11652edf7583db": "2 indicates the basic situation of six decoders for three CMRs with a scar decoder and an edema decoder for each",
        "2211.03062_24cccdfe8b9dddaed87bb893d7abcfc2": "3,",
        "2211.03062_3d5c8156548171293b32d2335dbd54ce": "4 and",
        "2211.03062_86bd61f1f968f7ab2ffaacdfb5bbbc7f": "5 have the same setting on LGE and T2 CMR as the proposed MyoPS-Net, namely a scar decoder for LGE CMR and an edema decoder for T2 CMR",
        "2211.03062_fee0ed551db477976ef242529b679284": "Differently, model",
        "2211.03062_fe24e2c2678ebc11a60e28cc2bc3f7ad": "3 holds two decoders (a scar decoder and an edema decoder) for mapping CMR, model",
        "2211.03062_84eea3477255a4d657d85e6a492229e6": "4 has only an edema decoder, while",
        "2211.03062_11a43e57b20131c6ef040eb42cc60608": "5 (the proposed MyoPS-Net) is designed with a scar decoder for mapping CMR",
        "2211.03062_24fc673195a7239d2a99758596e2a599": "As shown in Table",
        "2211.03062_0b46e546b358f17af2f8ea6e4318d43f": ", with one specific pathology decoder, model",
        "2211.03062_34d95b92cb120d6e028342996b94a6d3": "5 achieved the best performance",
        "2211.03062_79063a2797d4db719f87782854d99469": "Therefore, in the following studies, we adopted this setting of model",
        "2211.03062_c260e7b443869a1735f6fe9e6f71408f": "5 for the proposed MyoPS-Net.",
        "2211.03062_74227f43fff51933bc133f62be15ad2a": "Ablation study on the proposed modules",
        "2211.03062_234437f52dab59fc174dcfbd5f8de85f": "\\begin{table*}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{Quantitative evaluation results of variants of the proposed MyoPS-Net in different scenarios of practical clinics. The upper half represents the results of one model, which was trained on full data with the setting of complex combinations of different CMR sequences and was tested on three datasets representing three different scenarios. The lower half indicates the results of the three models tested on three same test datasets. Asterisk ($^*$) denotes the statistically significant improvement ($p \\leq 0.05$) of models from the same test setting.}\\label{missing}\n    \\centering\n    \\resizebox{0.99\\linewidth}{!}{\n        \\begin{tabular}{p{5.5cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}|p{2.2cm}p{2cm}p{2.2cm}p{2.2cm}p{2.2cm}}\n             \\toprule\n             \\multirow{2}*{Experimental setting} & \\multicolumn{5}{c|}{Scar} & \\multicolumn{5}{c}{Edema}\\\\\n             \\cline{2-11}\n        \t  ~ & Dice & HD (mm) & ACC & SEN & SPE & Dice & HD (mm) & ACC & SEN & SPE \\\\\n        \t \\midrule\n        \t \\multicolumn{11}{l}{\\textbf{Setting: one model, \\textit{i.e.,} MyoPS-Net-mix, trained on full data with complex combinations}}\\\\\n             \\midrule\n             {Tested on all CMRs} & {0.628 $\\pm$ 0.138 $^*$} & {15.9 $\\pm$ 9.94} & {0.872 $\\pm$ 0.050 $^*$} & {0.655 $\\pm$ 0.186 $^*$} & {0.920 $\\pm$ 0.065} & {0.711 $\\pm$ 0.102} & {21.0 $\\pm$ 12.5} & {0.798 $\\pm$ 0.064} & {0.804 $\\pm$ 0.139 $^*$} & {0.797 $\\pm$ 0.084}\\\\\n             {Tested on \\{C0,T2,LGE\\}} & {0.586 $\\pm$ 0.180 $^*$} & {14.9 $\\pm$ 11.0} & {0.878 $\\pm$ 0.049 $^*$} & {0.545 $\\pm$ 0.195} & {0.948 $\\pm$ 0.051 $^*$} & {0.674 $\\pm$ 0.173} & {23.0 $\\pm$ 15.0} & {0.798 $\\pm$ 0.072} & {0.704 $\\pm$ 0.218} & {0.833 $\\pm$ 0.084}\\\\\n             {Tested on \\{C0,T2,mappings\\}} & {0.427 $\\pm$ 0.175 $^*$} & {25.6 $\\pm$ 15.9} & {0.809 $\\pm$ 0.066} & {0.471 $\\pm$ 0.258 $^*$} & {0.886 $\\pm$ 0.075} & {0.654 $\\pm$ 0.148 $^*$} & {22.2 $\\pm$ 14.4} & {0.760 $\\pm$ 0.095} & {0.731 $\\pm$ 0.190 $^*$} & {0.778 $\\pm$ 0.111}\\\\\n             \\midrule\n             \\multicolumn{11}{l}{\\textbf{Setting: three separated models trained on three datasets, each with one-third of training data}}\\\\\n             \\midrule\n             {MyoPS-Net-F on all CMRs} & {0.585 $\\pm$ 0.166} & {14.6 $\\pm$ 9.53} & {0.844 $\\pm$ 0.072} & {0.561 $\\pm$ 0.226} & {0.921 $\\pm$ 0.061} & {0.702 $\\pm$ 0.110} & {18.0 $\\pm$ 10.8} & {0.813 $\\pm$ 0.091} & {0.676 $\\pm$ 0.198} & {0.900 $\\pm$ 0.065}\\\\\n             {MyoPS-Net-L on \\{C0,T2,LGE\\}} & {0.561 $\\pm$ 0.132} & {15.4 $\\pm$ 11.1} & {0.854 $\\pm$ 0.068} & {0.538 $\\pm$ 0.177} & {0.932 $\\pm$ 0.051} & {0.682 $\\pm$ 0.112} & {18.7 $\\pm$ 9.71} & {0.792 $\\pm$ 0.091} & {0.711 $\\pm$ 0.184} & {0.838 $\\pm$ 0.092}\\\\\n             {MyoPS-Net-M on \\{C0,T2,mappings\\}} & {0.392 $\\pm$ 0.153} & {29.4 $\\pm$ 14.0} & {0.792 $\\pm$ 0.064} & {0.405 $\\pm$ 0.208} & {0.881 $\\pm$ 0.064} & {0.587 $\\pm$ 0.211} & {28.3 $\\pm$ 12.4} & {0.722 $\\pm$ 0.124} & {0.644 $\\pm$ 0.268} & {0.755 $\\pm$ 0.145}\\\\\n             \\bottomrule\n        \\end{tabular}\n    }\n \\end{table*}",
        "2211.03062_8efcc0590b05b7f7dde5f80ee9c51857": "This study investigates the effectiveness of each separate module in the proposed MyoPS-Net",
        "2211.03062_5b1bf8f13be19d0d3061689b6a36fcbd": "presents the quantitative evaluation results of models with different modules and Fig.",
        "2211.03062_273b9d396d408b141c39df8db524958b": "visualizes the segmentation results of three cases based on",
        "2211.03062_9dd576353f1bb7d59dbbcbd8442f8561": "$1/4$",
        "2211.03062_a2ff570dad8a20521b87efa14a497ef2": "$2/4$",
        "2211.03062_db4fc861d120c3a66c88f8cd269caf27": "$3/4$",
        "2211.03062_35b08c7bff6b3e9eb49de7af128c5fb8": "of the average Dice scores,",
        "2211.03062_81c886cd7252f4105bc9bf45a855b00d": "a good case, a median case and a poor case",
        "2211.03062_ebb68b3d9ae032829b66d83bcae0bb20": "The baseline was only with basic U-Nets, and obtained a poor performance for pathology segmentation",
        "2211.03062_10f13624901d580e067b1b33c51f1f61": "For the CMFF module, we tried two different strategies,",
        "2211.03062_95e5e68b326c273ad6cc972da40db964": "max operation and mean operation, to fuse multi-sequence features",
        "2211.03062_d034892bc10ad8119eb693c26c446872": "However, the average Dice scores of employing the mean operation were 0.603",
        "2211.03062_59273e8139730e908854d78277c7ef5d": "0.133 and 0.713",
        "2211.03062_38d31d5a55dc6c5949344cafa3d9af8e": "0.114 for myocardial scars and edema, respectively",
        "2211.03062_cb4cd71a51682855c8edab5a4c7feed0": "Based on the above results, we utilized the max operation in our model",
        "2211.03062_8f26fceaa16dcd23e15fd0374b00c180": "Then, with the CMFF module, the segmentation performance of the model was boosted, compared to the baseline with evidently and significantly better pathology segmentation",
        "2211.03062_9f51c2e775168c9210ecaa0f099863eb": "This verifies the importance of cross-modal feature fusion architecture, which utilizes the complementary information from the multi-sequence CMR for MyoPS",
        "2211.03062_278180f1e42f34b5c49e1fe06897024a": "The model only with the MPC module also achieved significantly better Dice scores than the baseline for both scar and edema segmentation",
        "2211.03062_dd8d5fe6e4edf2f0ae2725232dc26568": "To further demonstrate the effectiveness of the MPC module, we performed a correlation analysis between the Dice scores of the myocardium segmentation and the Dice scores of the MyoPS",
        "2211.03062_1c6f532c5586ba68ae2a4aad3f69a6de": ", there existed approximate positive linear correlations between the myocardium and the pathologies, verifying that the MPC module assisted the framework in localizing and then segmenting the pathologies",
        "2211.03062_781c7a354b8b2b1067fd0e716c592eef": ", the segmentation results of both the model with CMFF and the model with MPC had smoother and more accurate boundaries, compared to the baseline",
        "2211.03062_0796de6192fb0504a3f5c752cf44076b": "When combining the CMFF and MPC modules, the model obtained further improved accuracies",
        "2211.03062_fc497a7bdeef9e289206ad8522deff0c": "Besides, the shape of segmentation results was further optimized to be close to the ground truth",
        "2211.03062_b94af162f2fd87653abe5188841c9668": "Finally, integrating the proposed three modules, we had the proposed MyoPS-Net, which achieved the best Dice scores and HDs for MyoPS",
        "2211.03062_7c07a8bec8e35141e82355f33acc390a": "These segmentation results illustrate that MyoPS-Net can employ the pathology inclusiveness to further improve the MyoPS performance.",
        "2211.03062_5caf913166fc9ea695d4d4109766b9e5": "Application in the semi-supervised situation",
        "2211.03062_36b33c3175694929f4e98ab957c48b80": "\\begin{table*}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n    \\renewcommand{\\arraystretch}{1.2}\n    \\caption{Quantitative evaluation results of the proposed MyoPS-Net, MyoPS-Net-L and MyoPS-Net-M. For reference, the result of MyoPS-Net-L on the public MICCAI2020 MyoPS Challenge dataset \\citep{zhuang2016multivariate,zhuang2019multivariate} is presented at the bottom line.}\\label{proposed}\n    \\centering\n    \\resizebox{0.99\\linewidth}{!}{\n        \\begin{tabular}{p{2.5cm}|p{2cm}p{1.8cm}p{2cm}p{2cm}p{2cm}|p{2cm}p{1.8cm}p{2cm}p{2cm}p{2cm}}\n             \\toprule\n             \\multirow{2}*{Model} & \\multicolumn{5}{c|}{Scar} & \\multicolumn{5}{c}{Edema}\\\\\n             \\cline{2-11}\n        \t  ~ & Dice & HD (mm) & ACC & SEN & SPE & Dice & HD (mm) & ACC & SEN & SPE \\\\\n             \\midrule\n             \\multicolumn{11}{l}{\\textbf{Results on private dataset}}\\\\\n             \\midrule\n             {MyoPS-Net} & {0.656 $\\pm$ 0.113} & {11.4 $\\pm$ 9.45} & {0.886 $\\pm$ 0.049} & {0.626 $\\pm$ 0.135} & {0.946 $\\pm$ 0.045} & {0.741 $\\pm$ 0.085} & {18.6 $\\pm$ 10.6} & {0.829 $\\pm$ 0.073} & {0.775 $\\pm$ 0.160} & {0.858 $\\pm$ 0.073}\\\\\n             {MyoPS-Net-L} & {0.622 $\\pm$ 0.116} & {11.4 $\\pm$ 8.17} & {0.881 $\\pm$ 0.050} & {0.569 $\\pm$ 0.153} & {0.952 $\\pm$ 0.040} & {0.727 $\\pm$ 0.102} & {21.2 $\\pm$ 13.2} & {0.818 $\\pm$ 0.082} & {0.763 $\\pm$ 0.171} & {0.858 $\\pm$ 0.084}\\\\\n             {MyoPS-Net-M} & {0.501 $\\pm$ 0.181} & {27.5 $\\pm$ 14.5} & {0.810 $\\pm$ 0.060} & {0.609 $\\pm$ 0.224} & {0.856 $\\pm$ 0.065} & {0.676 $\\pm$ 0.124} & {25.1 $\\pm$ 11.9} & {0.772 $\\pm$ 0.075} & {0.787 $\\pm$ 0.173} & {0.763 $\\pm$ 0.095}\\\\\n             \\midrule\n             \\multicolumn{11}{l}{\\textbf{Results on public dataset}}\\\\\n             \\midrule\n             {MyoPS-Net-L} & {0.647 $\\pm$ 0.258} & {15.5 $\\pm$ 14.9} & {0.865 $\\pm$ 0.089} & {0.713 $\\pm$ 0.234} & {0.919 $\\pm$ 0.054} & {0.722 $\\pm$ 0.135} & {22.9 $\\pm$ 16.2} & {0.791 $\\pm$ 0.109} & {0.727 $\\pm$ 0.172} & {0.827 $\\pm$ 0.110}\\\\\n             \\bottomrule\n        \\end{tabular}\n    }\n\\end{table*}",
        "2211.03062_9f32f849be381da3d67b5266f44bd593": "This study evaluates the application of MyoPS-Net in a semi-supervised situation",
        "2211.03062_7b5f8ec870d43fb6ae1108078f1886d7": "illustrates the quantitative evaluation results of different models employing different numbers of labeled and unlabeled data",
        "2211.03062_d186b111df4e5d3b62490fee8191a40e": "Among these models, we experimented with three semi-supervised situations, which employ a total of 25 cases for training, with the number of labeled data decreasing from 20 to 10 in a step of 5",
        "2211.03062_33a762f9d05b8672928064ef04061fc6": "For comparison, we additionally conducted four experiments in a fully supervised situation, with the number of labeled data ranging from 25 to 10 in the same step",
        "2211.03062_917d44b8fbcee282b1a7430582455028": "The model with 25 labeled data achieved the best segmentation performance",
        "2211.03062_014b522099f590eea8fcb7d1cc656532": "With the proportion of unlabeled data increasing, the segmentation performance of the semi-supervised models gradually dropped",
        "2211.03062_1bf5e904fff0c32f307910730c45fee2": "Nevertheless, the three semi-supervised models achieved comparable scar segmentation results towards the model with 25 labeled data",
        "2211.03062_f23d6af941320551caf9f286be6645fa": "The segmentation performance of edema evidently decreased when more than 10 unlabeled cases were utilized, which illustrated that edema segmentation was much more sensitive to the reduction of supervision than scar segmentation",
        "2211.03062_2b69d9ac7d39be1146c42707387dc1c8": "Besides, these semi-supervised models outperformed the corresponding fully supervised models with the additional unlabeled data",
        "2211.03062_0bf07cdb49c0f262b49fdb243c796d95": "For example, the semi-supervised model with 20 labeled data and 5 unlabeled data achieved better scar and edema segmentation than the fully supervised model only with 20 labeled data, as well as the other two situations",
        "2211.03062_88fb3e307a334e3e95cf56be70436953": "These results demonstrated that the proposed MyoPS-Net can employ complementary pathological information from multi-sequence CMR images for effective semi-supervised MyoPS.",
        "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49": "Application to complex combinations of CMR sequences in practical clinics",
        "2211.03062_f65575bb3343a3f359dec5e140bbf8f4": "To demonstrate the effectiveness of the proposed framework on complex combinations of different CMR sequences, we conducted experiments for MyoPS-Net-mix which is presented in Section",
        "2211.03062_1550be6685b27af76b26ff987a46b88f": "The training data of MyoPS-Net-mix consisted of three parts,",
        "2211.03062_4383b081cba8f285e7854426f9ea1e6d": "$9$",
        "2211.03062_f003fbbef51ea5a84652ed7a796af1d6": "cases with full five-sequence CMR,",
        "2211.03062_005c128d6e551735fa5d938e44e7a613": "$8$",
        "2211.03062_4f2e1174a7606509d9ead0f4b50ed242": "cases with C0, T2, LGE CMR and",
        "2211.03062_632890b0b61b91d9b609b9aadc277b23": "cases with C0, T2, mapping CMR",
        "2211.03062_c53fd6916d24e097c8756ec1fe899a13": "Therefore, a total of",
        "2211.03062_04770c077dcba12a35cc9b27921c2165": "cases were employed to train MyoPS-Net-mix",
        "2211.03062_4a0d01b0f5d4d481ac6bf947f8292536": "Besides, MyoPS-Net-mix was tested on three different sets,",
        "2211.03062_408f056f06845c2c321242441b65919e": "one of",
        "2211.03062_0e2da0529a5bfb755897c5d2fbfd8bcf": "cases with five-sequence CMR, one of",
        "2211.03062_d1e094738151e132f0381c2f163fa8d2": "cases with C0, T2, LGE CMR and one of",
        "2211.03062_202f2edd87487ba03c0e2573c1ee518f": "For comparisons, we further implemented three separate models,",
        "2211.03062_8fb5e05ba9342dde790c499bb4c77ac5": "MyoPS-Net-F, MyoPS-Net-L and MyoPS-Net-M. The training data of MyoPS-Net-mix was employed to train the above three models respectively",
        "2211.03062_768ba6343b40290580dbb22eee634741": "MyoPS-Net-F was trained on the set of",
        "2211.03062_f758aa5b89fd9278a66b970f7ff9e3d3": "cases with five-sequence CMR and tested on the same test set of",
        "2211.03062_79aad8745b1b518daeef3fe860da4922": "cases as MyoPS-Net-mix",
        "2211.03062_9d53cfb3de3a3e13dbd8b51f0f762363": "MyoPS-Net-L was trained on the set of",
        "2211.03062_d58763da26a061ddb5d26c337f8176c2": "cases with C0, T2, LGE CMR and tested on the same",
        "2211.03062_c78bd47f6af6291187ad968471d5c943": "cases",
        "2211.03062_376553aedc26de5c15e98f1265b2e73f": "Besides, MyoPS-Net-M was trained on the set of",
        "2211.03062_d00361790ce001baf8babda136dac8e8": "cases with C0, T2, mapping CMR and tested on the same",
        "2211.03062_9c0fc9fdbf2de0cea36e1769dd4732f1": "illustrated the quantitative evaluation results of the proposed MyoPS-Net-mix",
        "2211.03062_f4f1423f2d7bf92194e297dcee70998e": "The segmentation results of the proposed MyoPS-Net-mix on the scenarios of five-sequence CMR and three-sequence CMR without LGE were evidently better than the corresponding separate models",
        "2211.03062_cb93d06bd95a3e0a23e5df3829e7dc5f": "Besides, MyoPS-Net-mix achieved a similar segmentation performance on the scenario of four-sequence CMR without mappings compared to the separate model",
        "2211.03062_dbb568bb9e36c47ae454455fc8ae7b01": "These results demonstrated that the proposed MyoPS-Net-mix can acquire complementary pathological features from different settings to prompt better segmentation performance, which is much more effective in MyoPS than separate models.",
        "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0": "Results of the proposed methods",
        "2211.03062_f0b83d1333f4779ce373229373bb0398": "\\begin{figure*}[!t]\n    \\centering\n      \\centering\n    \\subfigure[]{\n    \\label{result:a}\n    \\includegraphics[width=0.45\\textwidth]{pic/proposed_result.pdf}}\n     \\subfigure[]{\n       \\label{result:b}\n        \\includegraphics[width=0.47\\textwidth]{pic/boxplot.pdf}}\n    \\caption{(a) Visualization of MyoPS results superimposed on LGE CMR. We select three cases for visualization ranked by the average Dice scores, \\textit{i.e.,} a good case ($1/4$), a median case ($2/4$) and a poor case ($3/4$). The structures in dark red denote the myocardial scar and the edema regions are represented in dark green. (b) The box plot of the Dice scores. The triangles in orange denote the average Dice scores.}\n    \\label{result}\n\\end{figure*}",
        "2211.03062_111b384324cc9b6500a601beff71b121": "To evaluate the segmentation performance of the proposed methods, we conducted three experiments respectively for the proposed MyoPS-Net, MyoPS-Net-L and MyoPS-Net-M mentioned in Section",
        "2211.03062_01ab8371a23940bcb976ca609279b528": "using full",
        "2211.03062_be46fb7abdd575dfde1daab80816dafb": "training images",
        "2211.03062_4d6a299b1e7e3201ced70de3a5fff015": "presented the quantitative evaluation results of these three models",
        "2211.03062_6edb57b2f5e8060f54fa8968d6167c9a": "(a) visualized the segmentation results of three typical cases in terms of",
        "2211.03062_b285e5eb7bc2e481b3bf19806f26a687": "of the average Dice scores, namely a good case, a median case and a poor case, and Fig.",
        "2211.03062_b0ff2e101b640ffe50961644eefc2228": "(b) illustrated the Dice scores of three models using box plots",
        "2211.03062_2ee9648e8596ee805ae7edac324cf364": "All of these three models achieved promising MyoPS results on the private dataset",
        "2211.03062_d8f9775b3c74eff93048b857ca76c5c1": "For MyoPS-Net, which obtained the best Dice scores and HDs, the segmentation performance had smoother and more accurate results than the other two models, which demonstrated that MyoPS-Net could excavate instructive features from five-sequence CMR images for a better MyoPS performance. (R2-Comment2.2) Besides, one can see that the proposed MyoPS-Net can obtain comparable results toward the intra- and inter-observer variations described in Section",
        "2211.03062_2f103660812ffe23c395099098360432": "MyoPS-Net-L achieved competitive performance without employing mapping CMR",
        "2211.03062_2ef85cd8502c319aa4ef3b1ff53dcea5": "However, the segmentation results of MyoPS-Net-L showed a decrease compared to MyoPS-Net, which illustrated that mapping CMR provides complementary pathological features for MyoPS",
        "2211.03062_a96186115508ccc63054b185d4504354": "Without the assistance of LGE CMR, MyoPS-Net-M achieved a relatively low but competitive performance, which revealed that this framework can effectively extract pathological information from T2 and mapping CMR to perform MyoPS",
        "2211.03062_9dd3b29e096c07309f35fb6e57672779": "To further demonstrate the effectiveness of the proposed framework, an extensive experiment was conducted on the public dataset from the MICCAI2020 MyoPS challenge",
        "2211.03062_edcc77f8a0d54c9b8931bdc22ba89940": "presented the average Dice scores of the proposed framework compared to outstanding algorithms from the MyoPS Challenge",
        "2211.03062_b2e35dd8d073893891acba1ef2974f06": "Specifically, AWSnet",
        "2211.03062_f0e6d810d75a58d7791d53edd15fe13d": "\\citep{AWSnet}",
        "2211.03062_4188675f1668affac1069d636f84df92": "and Modified nnUNet",
        "2211.03062_a772cbdbf69499c36aa8e1442ca7153c": "\\citep{myopschallenge-twostage-3}",
        "2211.03062_66b5fbf85aa60890e9438a34b82f6e71": "performed MyoPS via a two-stage strategy, while EfficientSeg",
        "2211.03062_9f17be715088007294895d36702e29d2": "\\citep{EfficientSeg}",
        "2211.03062_0b2a9c4ac9f2afc355b1d4130dc5c628": ", CMS-UNet",
        "2211.03062_c5e09bdca8b872c8260c7dfc6813b877": "\\citep{CMS-UNet}",
        "2211.03062_7777331e556606845b5340ae16e0575c": "and MF",
        "2211.03062_8f0795593f7eaefea0504d097fc2db56": "DFA-Net",
        "2211.03062_e684ae30da6ad0303a93ebfbac652a49": "\\citep{Dual-Path}",
        "2211.03062_e76f045c88086cc973db556f3d9c2939": "were end-to-end learning frameworks",
        "2211.03062_45f01e896e68d55d2851eff2c2aafbeb": "Considering the scenario of this challenge, namely three-sequence CMR without mapping CMR, we employed MyoPS-Net-L to conduct an experiment with the same training and test sets as the public dataset",
        "2211.03062_f3c79d5a643f9d7368f646b90af96756": "Besides, ensemble learning methods have been considered to achieve superior prediction performance",
        "2211.03062_c2beeb8413f08c429243eb9647dfc8ac": "\\citep{ensemble1}",
        "2211.03062_a3a6b0b175fd4618d91e32bfd16fe70e": ", such as bagging or boosting",
        "2211.03062_76c61ddc54cffdee1d996379194a3c71": "We then employed the bagging strategy, one of the most popular ensemble learning methods, to reduce uncertainty and increase the generalization abilities of our model",
        "2211.03062_863aa42517fbfc8832924407fa8cb5a4": "\\citep{ensemble2}",
        "2211.03062_01d3d1fa2fe3616bf15d388c44737a47": "We trained multiple base models by modifying the initial weights",
        "2211.03062_bca5d72073cfc38ffe2669fcfc6a5bf6": "The final prediction was then achieved by pixel-wise majority voting on each corresponding prediction of these base models",
        "2211.03062_b64f51253c344c4c69a259f263a4bede": "The experimental results proved that the proposed MyoPS-Net-L achieved comparable MyoPS performance toward the state-of-the-art results.",
        "2211.03062_be19170ab7a228b4d60931161f6f4c87": "\\begin{table}[!t]\n    \\setlength{\\abovecaptionskip}{0px}\n    \\setlength{\\belowcaptionskip}{2px}\n  \\renewcommand{\\arraystretch}{1.2}\n  \\caption{Experimental results on the public MICCAI2020 MyoPS Challenge dataset \\citep{zhuang2016multivariate,zhuang2019multivariate}. Note that the results of the compared methods were cited directly from the original publications. \\textbf{Bold} indicates the best performance. The superscript ($^{**}$) indicates that the original method adopted ensemble learning in the experiments.}\n  \\label{MyoPS}\n  \\begin{center}\n  \\resizebox{0.99\\linewidth}{!}{\n    \\begin{tabular}{p{6.5cm}|p{2cm}|p{2cm}|p{1cm}}\n     \\toprule\n     Method/ Dice & \\multicolumn{1}{l|}{Scar} & Edema & Avg\\\\ \n     \\midrule\n    {AWSnet $^{**}$ \\citep{AWSnet}} & {\\textbf{0.678 $\\pm$ 0.242}} & {0.735 $\\pm$ 0.111} & {\\textbf{0.707}}\\\\\n    {Modified nnUNet $^{**}$ \\citep{myopschallenge-twostage-3}} & {0.672 $\\pm$ 0.244} & {0.731 $\\pm$ 0.109} & {0.702}\\\\\n    {Modified nnUNet \\citep{myopschallenge-twostage-3}} & {0.645 $\\pm$ 0.236} & {0.690 $\\pm$ 0.128} & {0.668}\\\\\n    {EfficientSeg $^{**}$ \\citep{EfficientSeg}} & {0.647 $\\pm$ 0.279} & {0.709 $\\pm$ 0.122} & {0.678}\\\\\n    {CMS-UNet \\citep{CMS-UNet}} & {0.581 $\\pm$ 0.268} & {0.725 $\\pm$ 0.110} & {0.653}\\\\\n    {MF\\&DFA-Net \\citep{Dual-Path}} & {0.605 $\\pm$ 0.263} & {0.656 $\\pm$ 0.138} & {0.631}\\\\\n     \\midrule\n    {MyoPS-Net-L (Ours)} & {0.647 $\\pm$ 0.258} & {0.722 $\\pm$ 0.135} & {0.685}\\\\\n    {MyoPS-Net-L $^{**}$ (Ours)} & {0.661 $\\pm$ 0.255} & {\\textbf{0.742 $\\pm$ 0.124}} & {0.702}\\\\\n     \\toprule\n  \\end{tabular}}\n  \\end{center}\n \\end{table}",
        "2211.03062_361caabcaf9bddde7fe9cea1966de629": "Discussion and conclusion",
        "2211.03062_6e1100b133ef32abdad04b33aeb95b3f": "In this work, we have proposed an end-to-end unified framework for MyoPS combining multi-sequence CMR images",
        "2211.03062_77a4c1e70ffae92df401e770c04fe658": "Three major methodological contributions have been introduced",
        "2211.03062_d5bc0f37f34140e73b4611e2d885eef5": "Firstly, an effective cross-modal feature fusion architecture is proposed to extract instructive features from multi-sequence CMR images",
        "2211.03062_aee5242595928a194c9cc7cee6fcfdb1": "Secondly, we propose a myocardium prior and consistency module to efficiently localize the desired pathologies",
        "2211.03062_f49a5121bbf37ba07fc9a9bf6bc84fd8": "Besides, an inclusiveness loss is introduced to impose constraints on pathology inclusiveness, which illustrates that scars are the subset of edema",
        "2211.03062_0a2beb9f5c8ccf865643c9ec9bfe26eb": "Experimental results proved the effectiveness of the proposed framework and demonstrated that this framework can be applied to four different scenarios in practical clinics",
        "2211.03062_984669b52700034772af3c3505154dc6": "Specially, the proposed framework chiefly concentrates on studying flexible combinations of multi-sequence CMR images for MyoPS",
        "2211.03062_15db3e3657924f041acf3ead7ea0a7d1": "Ideally, employed full five-sequence CMR images will achieve the best scar and edema segmentation performance",
        "2211.03062_c88d67101d76b10c7fecf606a5e18627": "For patients who are suitable for gadolinium contrast agents, taking LGE CMR is a guarantee for preciser diagnosis and further treatment of myocardial infarction",
        "2211.03062_6ed04270e309987b2fba85341fc56dd4": "For those reluctant to inject contrast agents,",
        "2211.03062_541d1a3f4555a978e3accba21a671dc8": ", healthy individuals undergoing a physical examination, mapping CMR can be an acceptable substitute for effective diagnosis of myocardial infarction",
        "2211.03062_6b5171b4c10b81e6f263611348b1ca7b": "In the above three conditions, we considered that either LGE CMR or mapping CMR is missing",
        "2211.03062_60667466086da6cb3fd6ff5405ac5123": "Certainly, the proposed framework can also be applied to more complex conditions where more CMR sequences are missing",
        "2211.03062_bb9091f2a28d87892a7c03fd9e64ac3e": "For example, we conducted an experiment only with bSSFP C0 and LGE CMR images, and the average Dice scores were 0.583",
        "2211.03062_1f5c730c249d8658679321f592afba5f": "0.153 and 0.628",
        "2211.03062_729f50eead0a4bc367d16c959688f858": "0.125 for myocardial scars and edema, respectively",
        "2211.03062_22067f82998d3bea4e837a5d8ba8c79f": "Compared with MyoPS-Net-L in Table",
        "2211.03062_1aa39455c7b9bd2952233014d7ee0d62": ", this model achieved comparative performance on scar segmentation, but an evidently lower Dice score on edema segmentation because of lacking T2 CMR images",
        "2211.03062_4ebaf67acfa30d9f253325265b5e8685": "However, segmenting edema with the combination of bSSFP C0 and LGE CMR images could be meaningless and misleading in clinical practice",
        "2211.03062_e44d0fea781deb6f73cec50b5c3f2c02": "This is because from clinical view, such combination does not provide pathological information to edema and the major proportion of edema region, which are scars, can be segmented from LGE CMR",
        "2211.03062_b894ef38d115423215a701973b67f6df": "Hence, the AI model may simply segment a marginally dilated region of the scars, to achieve high Dice scores, even though it cannot segment small isolated edema regions that do not contain scars",
        "2211.03062_7badaebbcbb1e04d384512bf4ee69933": "Therefore, we did not consider such combinations that lack clinical meaning or pathological sense",
        "2211.03062_60fec6a460c0defa92d516aafcdb4c80": "Besides, the proposed framework can be applied to more than five CMR sequences",
        "2211.03062_1e3dbdf1b03151eedeb94572915bea06": "When there are more CMR sequences available, we can first analyze the clinical characteristics of these sequences",
        "2211.03062_bafef485fe26229782d990e27bfed78a": "If these sequence shares similarities with LGE CMR or T2 CMR, we can then employ these sequences to perform scar or edema segmentation correspondingly",
        "2211.03062_92e9ec138766c5cd257f3144745afb28": "If these sequences resemble mapping CMR, we should perform ablation study like Section",
        "2211.03062_05fbb6792748c449bd8177660c851bd3": "and Table",
        "2211.03062_02d2945e466f852dc993ce8edf52b3aa": "to determine the most suitable architecture",
        "2211.03062_3c48587595f5742d1aeb9f18a408b6fb": "There also exists two main limitations in this work",
        "2211.03062_011c083193f93a809dce97f1c8106f71": "Firstly, we mainly focus on achieving MyoPS based on pre-aligned multi-sequence images using the MvMM method",
        "2211.03062_4d17fca64bc97d10a1f67d46cf3a94ff": "However, these images are commonly not registered in clinical practice",
        "2211.03062_28594d29d70988e55304c59024420763": "Therefore, a unified registration and segmentation framework of MS-CMR for MyoPS is valuable for clinical applications but still challenging due to cross-modality variances, and thus will be our future work",
        "2211.03062_acd2bc62d04f2e28e4dea271d1df273b": "Besides, one can see that C0, LGE and T2 CMR images can provide information for the myocardium, myocardial scars and edema, respectively",
        "2211.03062_2c5cfc516c81d139edeffcce11b6733a": "Mapping CMR is expected to replace LGE CMR under certain conditions",
        "2211.03062_9952c41b78393acd715d0bf29a09917a": "\\citep{cine1-circulation2021}",
        "2211.03062_adb88da674b6b376c6b825b4efe733e1": ", but the proposed framework can only extract limited information from these sequences due to its poor quality and blurred pathology areas which is the second limitation",
        "2211.03062_d25bb6719b5b4ec0e148ca3ed242286c": "In the future, we could employ cine CMR to facilitate the feature mining of mapping CMR",
        "2211.03062_821c4ea2b52d99b2ac21e0478bd36f0b": "\\citet{cine2-media2020,cine4-media2018,cine3-media2020}",
        "2211.03062_d41401c759d5f7127bf0d90821a93856": "developed the usage of cine CMR images on MyoPS with generative adversarial networks.",
        "2211.03062_0d99931193a9586f6ee574a417d79110": "\\citet{cine1-circulation2021}",
        "2211.03062_8f1028c4ca793624ab86909865721b22": "proposed to synthesize an artificial CMR sequence which resembles LGE CMR via cine CMR images and T1 mapping CMR images",
        "2211.03062_a907713e011731f1bf343cf15f9daba8": "Therefore, there still exists significant space to make explorations on mapping CMR images with the auxiliary of cine CMR images.",
        "2211.03062_ec0bc5c569709d21640eea1a1b94540b": "*Acknowledgments",
        "2211.03062_61617de78e4a6609213fab6d23e74fd0": "This work was funded by the National Natural Science Foundation of China (grant No. 61971142, 62111530195 and 62011540404) and the development fund for Shanghai talents (No. 2020015)."
    },
    "hierarchy": {
        "1": {
            "2211.03062_4b09adc2daa8cae31186ee33d973da92": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_e604f4348031a3aa7d7d89c9653bf105": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_fb61a5b58a369c994f0317fe1744362c": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_1fa141ff09e1411ef0cde29db7127ebe": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_35dba5d75538a9bbe0b4da4422759a0e": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_beb4dbf9af069aa2df7b147229965085": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_f2577a6fc29b900fe7d4c6321346be48": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_e962e23c139e7252904b9221d9967442": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_e353dbe42c8654f33588d4da0b517469": "2211.03062_f53842e0a6273f09a7a537508e0f5e6b",
            "2211.03062_6d85c36a484779e5acd9bcc4e735320c": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_e191ca1c01d4a3cc6248948fea3e488b": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_7a77e445cc814ed395570cead4f81ac4": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_2570b1b1952be91de7eaac7ceee4e0ca": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_63be768c57b50febd2b4925eef598c35": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_229114c871312ad62d34ed20c1580424": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_884db4ce31a2ab008b5e5386e6daea71": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_1681212a91720bcf8916f6c24966cbac": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_537b5bde5296058fcb93c9f149bce4f5": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_e183c8c0ec3ff3e30b5d18caf4f3ac59": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_c9e75df993431a0ed6809b6114dcb505": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_ab7d66125e9fdb9902659be385dd8e43": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_8c906464552018426817e73509edfdbc": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_0b79795d3efc95b9976c7c5b933afce2": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_685c8557a8939092b145c45fb0ebe78e": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_574606699763002813607cf21f8a465b": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_750b66ba7b1259574f6095004c10ba22": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_8f429fd02c31a70a1973527792d68912": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_47fe20e174eb8a72f568f3b0ebf75ebd": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_a4ae2b761d1c76cce130ef6d7ba0e81b": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_c709b2d64ad8bea31c5d355dcac77085": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_83496df4b1e73c3ec95a6adf22e2db10": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_eae13b2591c74f12904095370697fd41": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_6bcd3fd8a68fdf081d0f72dae6ba3346": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_f2cf43652246d8b70224e17da413bc66": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_0f729bfd55514a9be78bbc37192ad455": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_2570d9f94a8359d40a198c3e4341edde": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_60f96fa8c5163946a13430d4f98e63f9": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_cfd917398e9d1ce30d6eb9b0adb0786e": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_b3adae4156d780a03594d9e5c06b270e": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_3c3667b915dc5886ebc233e9118fc7ee": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_be5d5d37542d75f93a87094459f76678": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_a406bfcd1310f170bea1c0ebb6f45d7b": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_a3c78c7ad5783c8a1511503c20269319": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_c7b0b299d76db5981709592fdbd95d7f": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_c269d4913fb1c67f2a038ca51b853f6f": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_f58a135fee0e2a92ab83c9bc602adefc": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_85d9b1872e21d9578aad0fc78b72408d": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_0210b101ac5348d2740d4c7a6c8e7eaa": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_cabbc139b7f74771c47e3eb24d94c92b": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_0d80de3827bb542fbae6c9452f5a8f8f": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_0c06e4aa1fd760b476a1f7177d47b810": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_2a297b54cdfa5b3403e2f23251c9ed45": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_e1c4758e05c2086fb193b9b2aafbe0ec": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_e3a78be8c6d101be7bce4a55b1467e09": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_a24d519f5a52f50f4dedcdfa8fc699a2": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_3f2bbf72532174fa6cdbc651d7bc3970": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_fa18f2ce410b87ca639039f9985fa106": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_3f7d8f9814e6e5123a84828167e286f6": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_99723484ff16d8126ef1e117147943f0": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_1a23e41c4f01d83fd7a8bb8bcb9a0cb6": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_b702454930df369caf563c8fdb4d3519": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_97796e53d5ecaf4ef5375a6a6e996803": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_cd7bb9de95547152bb43c745d039abf4": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_33fa9c1dbdc5b2cd2253949c386c0c10": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_386d92d86eeb85e75890843890009150": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_9cb2f8fdcf38db65e1a82888168769cc": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_d203ca9666704752dc63fc3b28375a28": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_d2c24d59e0baff4d0155fbdf62590867": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_4a8d7448ef7202c82a85f6a0ad1d8e55": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_b367226749a0cc9c23d7da27d9ce96e1": "2211.03062_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03062_92e1f3949b053f63865cd5024bf136be": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_78caf05d246a613f68a89bcca2feec33": "2211.03062_92e1f3949b053f63865cd5024bf136be",
            "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8": "2211.03062_92e1f3949b053f63865cd5024bf136be",
            "2211.03062_024de845b61e77213c75531ed466b6a3": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_330a1ed86c878ba3dceb06027459f7cf": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_dc19dc2df4ffd97d8482237c9e15c85d": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_fd0040964b176e1a0074a97292f6e496": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_c8b38645106bdcf8cfab94b845d10e3b": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_267809db8f707901ac58a00469f361dc": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_5b5ec79ead23daf80afad1a6b7e7c2e7": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_7f87f1009814a5423fa10f26906376f3": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_7b03c033fe6e6df993d85348f92fab49": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_d8095b5466ca746231b4c47e363fa25b": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_555cd12384bfc07623549e15de02923f": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_5a5bb627a87a8467ffe230d0723d2bc1": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_1a94acbb1f769aca032b0993a1a1f95f": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_a487ff942b8ecbe877cadedcff88d321": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_0d59f9005baeabf707319e2f670f0493": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_8f64f0018ee018045504e117d07f9241": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_63b4671937fec3f0d7076c819a3b2857": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_ace07cd9962cfe7dae4a78ad2bd4c7f5": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_49c20dd31e5546aac8da9cde423d3bb2": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_15d7a063b0b63dfbd497eee0267a652e": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_ef2e9ad96a07d09e87311470bcad283c": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_d1c60133086bb93910f7992b4c11d622": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_0ba8c587dbcc0e6461ce12f85b99dc04": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_8e026f3398f1ae72f3327ea5bf769392": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_189e67550ed1c5ec6ac1f625f248d4f0": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_f7cf5c3b29a96c793981fd3e00594974": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_a7f5937801e45f2b821c95c709aba28f": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_a20b71d61c482ad25c30489f4c08761f": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_29216d2ab318dafb96bc57820ab0f087": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_2ac264861e905b05a09665c85bca0fbf": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_b5b7118c9d0b0a7b7528ad91e528a59c": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_f87f22a162bec3653efc4e1149f94f37": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_11228d63a88a838a295704622b19f3ae": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_6deef392afc20a82c730b5c5f760561b": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_116c29ddcab78e05516b95a2b5b1acea": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_4137e03436514c9db384d444c86ffdea": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_de5d123feaa9e889d9357d3b11474f8f": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_1dfb7ac7762504ef9abdb485d557664f": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_e905df6d9e5e591f26da4eb4ce28bffd": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_0cfb633205a664cdcd70de039512e043": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_b2a55a02f9aaf2ab94f0ca3bc9a3a50e": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_f8d715d6e6e63767334008e554a123fd": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_544d25b26de15bbdff824a977d8e06e3": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_dcb87f2d1791d89cfb4a6e48903fb355": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_41742ada7ab8d10c40aadcf91903c72b": "2211.03062_3b3103d566ed2ae145adf89ca4f5aaf8",
            "2211.03062_5058f1af8388633f609cadb75a75dc9d": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_92268b880ae01443108d3e3f99b66222": "2211.03062_92e1f3949b053f63865cd5024bf136be",
            "2211.03062_ce6574a4858c67183217dc992a02efad": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_ab21f902445527864db83d839df33903": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_e974155c077b762bb19490d2068e69a1": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_27764ed5dfae9275c7ad301f58e1e740": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_e18f222365511da65bdace49deb08cec": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_2d702c6cd167f4c2a413a3d34ad3ad60": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_504c008c7d04f46aec1b662d0e2078f0": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_cf59205576503e6f8e1476a339a42610": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_7850062ce9582eb376817a8a6a6880b8": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_00b133511f6a363534ceb99b00153798": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_d0a81d66ceb2d2ba2bc87f6e2b3ce648": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_b64d84b771c46227fb9a831f73c38f4c": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_4c1566e303a454fbf7dc3b2e5bd114f5": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_038a2599b47494be6cd60e8f647236da": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_25c1ca3f0650fcddb44592a2f64cc4b2": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_23761c713e8a689e714aad067051fe1d": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_f4e41c08ca6f6d53069f0251bab107b2": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_f896fdba89f53407d63171d02f996a0c": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_3f1f63fb3007b2b28d566a28239e2d67": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_0af4a202d50fc5fb4bb3c8d67bc335ce": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_e6b6392495f1ee7549f33716ec06b31d": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_588a4a3792a780958a709618b61fe838": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_614aaed9584d92dd8a545f5e3162ac0d": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_1efe7cf6719d7200b430155c12dc3e19": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_312e430b1ab81faceac383b47a27b432": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_d5f2ed6d7f1d408d7cf07cead76a4d14": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_93e98d82849acb9a489f656e097ca2a1": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_dd042bcd43ad78aee0d19ace0e6834a8": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_3f1ce56760d72f2dfcb749b3591effa0": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_30eeb536c7f0468912971ab4179c6e7b": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_921a8eea27f40856d2f8ed22966e216d": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_1c040f93eba02c0728b7243af7a13d36": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_286362fa6ab295744e2f36cb5a1af40c": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_a412fa40e8e57c4fd0d341cccd1754a9": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_1b03c4df6a77b721bf6ba0f7d752098f": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_ec8496ba9bf6616ae95f1b48b51061e6": "2211.03062_92268b880ae01443108d3e3f99b66222",
            "2211.03062_4c3880bb027f159e801041b1021e88e8": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_09574c63724673b99ce2941ede757bc2": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_c88d0726d10389525344e3776516ff05": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_53fe925bbd3d38885bfddd0125520e37": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_e0124ae12f01f6ccb4180b58802f1217": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_bb0219b78405f5acdd6941f9ac5cd38f": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_9371d7a2e3ae86a00aab4771e39d255d": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_30d6a6c03fdda920b0475e8e665e2c6f": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_ce96ce64475d88003b81a20710c10f5e": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_ee5da2a90cdaef173f131eb51284df2e": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_bd3043243380402482d55ea31217975d": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_7a065296b38812bbd176365cc4a9c5f8": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_7ad0f5cb7670b5a2fec2b2f63a4df830": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_04eee1a4413912f5b33a438434482c5b": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_f39cdd6f932c4e50c2cd2d72f95ea927": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_19a6f8c4116f0a27fcf122422af6785b": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_35f94b37cc9079b591a56264d02e073e": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_4b78aaca46338de8abba835dd0a26a9f": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_cae6404c4aecf46684930fe2a86676a6": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_98fae63be17ea3bea5c3d646520a918e": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_7851067219972c69b562351387321194": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_0af07ec463ca3b53e12d99864e721fcd": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_5e1acaa186b7bdf41cde7caa4d90e729": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_f0978eb3e52dce313e6e9f74ce9c378c": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_7979896a44edf3ec77821c17a493286f": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_69c3ec0e7db052185c869f6ac083987f": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_d2d97accc13f671c72189be388fb2995": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_567904efe9e64d9faf3e41ef402cb568": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_8226196109aadeaaac59d7de9a9d1645": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_f148a579b50ca37aa363eb41495724e5": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_e35caf405a5e9b4afd75a0d338c4dc12": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_b12839c73cf6018651f4b4c3d4a6aaa7": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_55a049b8f161ae7cfeb0197d75aff967": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_847c10c4d4b1b0f01e5f2ea7bbc6aca3": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_cb262f3521d52153877b8697e0659e2e": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_8288e85a4f6f484399f0dd374474621b": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_1ed70afcf72430a8a9fa37d91bc7d636": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_407eb80678563a78ce227e8ef725fe2d": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_2195a984fd9a202c45bcb7bf5751db4e": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_8e8acf1944b5cf89578b43fb0bee6f4a": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_df8a69d7c8c99faf6fd1317d383de069": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_e81c4e4f2b7b93b481e13a8553c2ae1b": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_231acad5a014d4abb8f37277a8888567": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_272dfca67902622664228cdcc7d68211": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_7e53b1e945ee23f69fa84252894db208": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_80dd67ce287f238e6429e81f7bcab53c": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_e2940bea2a80cee8d542fad04800ed38": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_8305b1b69b4ae416992d2a31bb965cb0": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_6efba753c07c851106bfaae790eea012": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_ab4fbedc92fc024e8f15e5849134cf24": "2211.03062_ee5da2a90cdaef173f131eb51284df2e",
            "2211.03062_0aff06c7bccefdf718b3a5381462c47f": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_3e4d2242a93534f3032d7b919f986964": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_5a12429f67bdb4be4d06574b0bbe0278": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_c34ebc039c7df2328daf4acd0512cd69": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_23fca316be4a96dfb53d13e22447e1b0": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_02d9436fc5a7d4ab006c2a4ae2bf03ef": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_789c9e1d65a8b3f2bf1341368609154c": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_c0cb5f0fcf239ab3d9c1fcd31fff1efc": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_0f73ebb36ef896bd18d208a1d80c72d2": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_a28a01f55d872c60303139b4dc9f908f": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_25dfcebab04922793a9238895428e8e2": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_91d53c2bade5617037b7a4fc261042d3": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_576628cb9e2d81362dfb92e73256c54e": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_2449c915f16da484b302a12a784f6655": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_bfcb33ffbf55e6e521eac88efd6b944e": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_2f9cad8bc680bd74035cfe69cc279b85": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_9ba5f1fdb17fb175fb0145f53b9bdacc": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_df79eb87af8c54a204513a6b5a4451ea": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_6f86cf596d3559e5d8357c4a0edccb44": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_448fab9fa2e5bafab36ddd60054fcebb": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_c46683834c3cab6a8fb005997d9e2862": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_4475f6636739e9f4a47f9dc956175077": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_717c2c5c214f38439160261887860d49": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_7a9d8237846e73034b6172723921c281": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_6a659c135db4dcca9c3bde19fd2fb5ab": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_8e712c6376fdada573a2512853a7ba91": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_da853580ee25afaf3f870ac3067d6346": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_426440680bde60f5c0e4c0e597b094a8": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_fe13a5c9f632393ad11e108d62ca1498": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_41d693af9f0557fce9c121def08ab892": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_10d45d2a9ee410c6cde408f174479905": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_182f7a093187408727176e7a1c69aa14": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_eb33163f1bcf2cef867d768b6ef0d9ce": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_04428787ec9dab0b4905016b3bf89dab": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_f59ea332bbde9c6ed9bf1a90a3d5b6ff": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_2600d241b3f714f21203f760b89abc8d": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_3cb1735e7fc14ee61771dbc63a75bc49": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_2a07cf48a9efc34c147b97e5ca5afd58": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_9d5b017135195b67c0933dd59e17b3d5": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_473f12b4a2b1577e4932017179bcb1ac": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_2a14b84f0741839a149116347831d620": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_4bbe9a2137a5377a318b7f2b58175a17": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_a81d1f3e6423d4be12514073ad01fe47": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_cae4b68e74b5bff6536b16cfc67ae29f": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_bba94edd3580ea1ab3fe2d2f154d9d1e": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_3b1658c4f4f5f8ff3dd23a0b1519c6b0": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_a2a551a6458a8de22446cc76d639a9e9": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_4327ea69d9c5edcc8ddaf24f1d5b47e4": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_695a464bd05db859f8720e5bb34ecf52": "2211.03062_0aff06c7bccefdf718b3a5381462c47f",
            "2211.03062_902df40a1344cebf5412dec73776bc07": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_3fc1fd1b081ca50c86bc56f9c93e61cd": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_1889d9abfb4c376e8f1bbf5fe9f8544c": "2211.03062_902df40a1344cebf5412dec73776bc07",
            "2211.03062_04f0cf8472bf8cac6e60e65ce2ad5be4": "2211.03062_902df40a1344cebf5412dec73776bc07",
            "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1": "2211.03062_902df40a1344cebf5412dec73776bc07",
            "2211.03062_f931fbafe40dbe2de2a57dccb7d79fde": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_73c7f00002864b85e14bca87c6554d71": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_676842ca8d00749cc725228f25900f80": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_5c1ca4e2f301c88b4719cf737cb548ad": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_ddcb483302ed36a59286424aa5e0be17": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_60e3c6bee8b840810926c1ff5c81c486": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_959df9970b29ed08ffde4e49a5f6ec38": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_58224af49e0b9c55ba84740bed7e456e": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_f66f0982703539d259f00ddea45b5418": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_2951180cc453b1995ae7d39b680ca99c": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_2017a42786202e4de1e70fe372a5ddf2": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_86c7e8538301d93c2c2f3e9a9d16f360": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_4ca9893001742dd2c46ff6e08b2b842a": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_4549920b85c667f6afc13ffeac4e398b": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_2df508a5e9e5ea2fc7d9dc5947420fc1": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_88537b2ad34251c73257bc33c88bbd45": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_df28b8e0988673de57828c5c79d36d85": "2211.03062_93b70153e9ca55bfdb83ff125d9e6ec1",
            "2211.03062_9cca6cedf5aed3dd04af8db1ff4fee87": "2211.03062_902df40a1344cebf5412dec73776bc07",
            "2211.03062_7fac4135749bb14bf51374830d207fcf": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_2d7675b2de74ca494f1e2a8f483a3a92": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_520f8149e12c17ad03ffa2edbf931cb1": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_4f2169d3ab4dde1e612baf83526005c3": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_6bac6ec50c01592407695ef84f457232": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_37967e2e82ae946fd9c12295c29bfcf0": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_eb648c412cc926ffbd101094d4cb5d40": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_5f181ddbf59d50a7869bfdd0205725b5": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_3c5054f50fc39db68f2a8f806aeebb6d": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_66c65df569b7014eff59e89252cf7e91": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_72916bb1f4b20eb4862b3a281834eb94": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_9d426501f072f15bd8c17a0eb2077b35": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_5bc88f0a0433a0ef5ce9f391c7e1d84d": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_1f123bb73ab054f84f25c71ffc419912": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_027a3f74bf98d4f1d3ac433b943a45b8": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_ef20f773caa019d41a9c4e08441b8e29": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_98db0943ee7adafbc5ebd36e5ad353bd": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_dc90a72c6f762d76ee85881a720e6a0f": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_32276a0ea97d3a8814b9ff28b68435f6": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_1e34865235f1657575393f974ad85d19": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_85c6a72574945aec161de87b7134d58b": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_bfbda504cad6f568b0b41d5e31ac48b2": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_04a8c4c6e70c9bd4b2ef9cd5efa2659f": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_5ee8d804bdfa16d262bd7abc38019823": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_620474e940d8ec8d7b31e6db4912a77d": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_a836a3587add4c69c85527d5866468ff": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_d8eb8c32dc8c762b4514ba18348fef1d": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_ffa502feea4e57470dd4e14673ec2de2": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_6607449d83dc398d990c5c9f2f8c6133": "2211.03062_1f123bb73ab054f84f25c71ffc419912",
            "2211.03062_9ea84e341c776d7fae7c134f20bc97c2": "2211.03062_7fac4135749bb14bf51374830d207fcf",
            "2211.03062_7753489c74a59477057e90fbec074ec5": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_df6a8a85e058c4d1f988154d692f5c36": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_2363a642c3c534ba4e791b2dbfc5681c": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_e4158b19c25edc6ec1177136ee417fd3": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_482ecbc9ae31b1b55aeb0b72fe227b12": "2211.03062_9ea84e341c776d7fae7c134f20bc97c2",
            "2211.03062_403219e4aaa118fcbf395574a483416f": "2211.03062_4c3880bb027f159e801041b1021e88e8",
            "2211.03062_383987dcafc2e9754a52a935ee8f0c0e": "2211.03062_403219e4aaa118fcbf395574a483416f",
            "2211.03062_87de98955fb58c3a0526559063629917": "2211.03062_403219e4aaa118fcbf395574a483416f",
            "2211.03062_3102192b79b2d901540c639b4cb50e70": "2211.03062_403219e4aaa118fcbf395574a483416f",
            "2211.03062_5f803ee28ee3eb301b2fb8779afe19af": "2211.03062_403219e4aaa118fcbf395574a483416f",
            "2211.03062_7bade40785d1f5c1dbec8c0414eaac9a": "2211.03062_403219e4aaa118fcbf395574a483416f",
            "2211.03062_7d74f3b92b19da5e606d737d339a9679": "2211.03062_7bade40785d1f5c1dbec8c0414eaac9a",
            "2211.03062_a6a6d61ba3f0171f13fae61f787f8046": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_5ced8e888602b47435e2b234b8739f61": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_7d5438fecc8dbe2ed02902ef64d98260": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_b4e1790b307056fb5862cf976d4b1e66": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_35d8591e63d277a8ed92825dff7adce7": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_a653b0645e55098e8fd4661b6affffce": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_f9a009290c975b9194c0db0ecb6162d9": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_96f9ea6116394b8d22a1f7d2392c6d30": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_e21de9b57570cc1319c4211a6724f658": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_a68812eb118121712a80b6a1d5d37eee": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_fd75f2ed0ebb05251acaeae9f14f1cac": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_b41120be023352f4028f3c99f906abc1": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_ccfaf5ab618b1564904eb05764487e20": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_692ced8e1d1f315b75ba8ee967e3c8f8": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_a0623ac5b6354c572295fb86f0543932": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_cff2600f1aeefbcdeeab337eaeb6d84f": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_95ed4603b17305bc68c705b9cb7418c8": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_5d4379645d7525500e4c51e9854b825b": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_3e290f166f14c880373839dacbe9dba3": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_9369948de2dc57ad47258cb56bc033e7": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_46bdc60778dc9a71ae87a78ab9f41918": "2211.03062_7d74f3b92b19da5e606d737d339a9679",
            "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_4b944ba9f3c5abeabeb2e06e555a3e5f": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_f6c425aabb4c31c817d0669203bc528f": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_b10f824d7f3060966a62273b8ba55ec3": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_b833b10044fc1cf25332b1c43d3ab641": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_e0fc2ab8f02cc030d3cd382fd5108151": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_e2a60e30d00387790b0320dc1005c65a": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_7db94fb07e97b89ada12d83e61926059": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_f2e9fa3cff820f046008ef80b5e662ca": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_df066967875927bfd3b515683c8d6435": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_a269bd007135433d93f2277949ef691a": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_51c45b795d5d18a3e4e0c37e8b20a141": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_7693c4c40e66b3e7e05df3181c5814cb": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_4928ce489604c334207bf74c530d6f7f": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_ee8112de501172fc8f020bc95931594d": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_f5da161108d78357b9868b7df7666e55": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_bdbf342b57819773421273d508dba586": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_53f67d895f7f448ddb64653e387f3815": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_c0611f246b09bd1af1ee1ea03bbe6300": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_dc06bccebb5e14fae128e7761fd5d151": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_0e1e15bfba691699599e78c8dcb593b2": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_c8ebe877951f339ceb9011f089536c28": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_01b6e20344b68835c5ed1ddedf20d531": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_b052add0acbc2e691586dc8b76aad0c8": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_d826026575f512d06800639bb4eb14cf": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_c768d8a29bd8f1a6a49ff561061f72d0": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_6ddf75a1bf8ac319ea411add9cf25334": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_f62db12f95e34116f1f1e827b2c64ce5": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_d6348a8c9be0d371cb03967815578b2e": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_3952d7ea4982da687019a3b850bb0431": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_d221571f43f7f6223b91b602e80dda0f": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_2394c183727fda43461e295dd0206fd5": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_475266e363eb45a914ec69aedca47ab6": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_8d221ce6a2521dc968fd3b57d6608438": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_7acc185115b9ffabc044e2079b245b8d": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_31cbd8101a9b4028b1d9fd88a93a76bc": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_9612eecfec9dadf1a81d296bd2473777": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_53f7055916429e35d101f544c0297b31": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_ee070bffef288cab28aad0517a35741b": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_102090646b8ac3a508e2a687f72c9109": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_57283acefb1435db39c74bbf18010d4f": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_db253fa004a094fcebb922026aa11ee0": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_46a6ce21d55f1c152c44adc6326bc96f": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_4255e506ce2c8244901c0609e1010118": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_1a76959011460eefc7e2b1e0ecd09ec2": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_e141a9c85656a2a34da004d285fb4aed": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_4faef8930c0ee803c5cb1af72e73bcf7": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_d3197568201bfc72f5c712edbf4a41de": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_a20f6e308484c66ef768a15c900ac02b": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_a6f9229e12f092cc9c077ca414de340d": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_81afd135f9b8fac63f232568fb8c0d03": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_e502a7d606c32c35b1ef843e3e53f063": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_fe3cc388b05433a0bd93d4a73c0e74fd": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_10826252e0a971f80e66f8d39c474a95": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_1e07f77471b53817f6f9b2abed92716b": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_3757b1fd3122f7ae4193b07e0e680cef": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_8bacc88f3fd7a60394eef755d3872f3f": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_d6aeb9b6601c64cf87225caa136e95c1": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_8610f582dd2651e196b12337e58e2ecc": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_01a12a16d611b7ce23bb4b853018d9d9": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_750639e25d9f96313a2bf8cd2420675d": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_1c9281e22e366148fbf1242e87a8d53e": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_2c6d2c92561d4eb0752000e383451528": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_d1d5896d3c7497c2513ec83425fcc5df": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_4a948cc9fe367c32bb82ff93a138c69a": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_0ad1b100c273e2d0fc63dd785eacb13c": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_36485149435d99ad961d2158345b7674": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_93cf6eaf6c2baeb73f66ba2cacd50adb": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_d2a198e284c17df0243e37ececfe4ea9": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_1c86a0bb048e9831601525ccc8a91aae": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_dae26fbcf9573344419544acc8641249": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_25fab5c66635e87156ef51bedf00a76f": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_096b13c0d0f83c6340652e59727c8be5": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_3f7f75b62eb2938002ce8647e6733cc2": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_ffd300db44187d5257725bb009d037ad": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_b5453604a9e8ccff5c57ec821bb7e906": "2211.03062_7db94fb07e97b89ada12d83e61926059",
            "2211.03062_86df8044ac1a7c707e1792b2fb6cb353": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_f5762b406e6d975cb8af6ae47474db73": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_e563f284e7b1e406b6615ba0bfb9bace": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_fcd7a8b4176f14a72174f1802fb232a7": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_e9d03c49b51d159700f1175f81510b77": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_37dbb00abf61d0e16cb1c2f64f56907f": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_9da734d8c53716812b7ff613dcf7e33d": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_c286d28a40121b971d78a766a3d8905e": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_adf8d4d0456fcf2bbab69f13d31a52bc": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_703a44722f0bbc16163339e26af2cd5b": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_b1dfba4fadfebbd5be836cad9c5913d3": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_1fbd1918da2fe5663c57bbb3f5c3caef": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_69b74b37db6702535767bb3fe4600d83": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_5a21df3ae6ae32d00e4ba39d5d326c73": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_b26f6a78ccd776ed5dc4b4969a724272": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_adaed476e0b72cdcc7504e68a7a20c65": "2211.03062_86df8044ac1a7c707e1792b2fb6cb353",
            "2211.03062_06a5f95c829f32dec6863a9704a58df3": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_45beea27aff4a97e71221d30738d9be9": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_d46b43c086eb53d5e45aacd8d5afdb13": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_7a3f575777cb6371c053d8c05b44699b": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_f8b28df115ea2042db2e03f15a434387": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_e4a972193d43df604e0f8cd2c946283e": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_a559b87068921eec05086ce5485e9784": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_3324ba833d1293c55e31e683dcf49574": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_0caf66caf66ecdf387c181efd4d66ddb": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_a15286ab17b25497fd23ec08b7e4d45b": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_d08b3dcb437d35a056cc722fe6c6d711": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_73ebaee824bcd3cf1c11652edf7583db": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_24cccdfe8b9dddaed87bb893d7abcfc2": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_3d5c8156548171293b32d2335dbd54ce": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_86bd61f1f968f7ab2ffaacdfb5bbbc7f": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_fee0ed551db477976ef242529b679284": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_fe24e2c2678ebc11a60e28cc2bc3f7ad": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_84eea3477255a4d657d85e6a492229e6": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_11a43e57b20131c6ef040eb42cc60608": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_24fc673195a7239d2a99758596e2a599": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_0b46e546b358f17af2f8ea6e4318d43f": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_34d95b92cb120d6e028342996b94a6d3": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_79063a2797d4db719f87782854d99469": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_c260e7b443869a1735f6fe9e6f71408f": "2211.03062_06a5f95c829f32dec6863a9704a58df3",
            "2211.03062_74227f43fff51933bc133f62be15ad2a": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_234437f52dab59fc174dcfbd5f8de85f": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_8efcc0590b05b7f7dde5f80ee9c51857": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_5b1bf8f13be19d0d3061689b6a36fcbd": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_273b9d396d408b141c39df8db524958b": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_9dd576353f1bb7d59dbbcbd8442f8561": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_a2ff570dad8a20521b87efa14a497ef2": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_db4fc861d120c3a66c88f8cd269caf27": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_35b08c7bff6b3e9eb49de7af128c5fb8": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_81c886cd7252f4105bc9bf45a855b00d": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_ebb68b3d9ae032829b66d83bcae0bb20": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_10f13624901d580e067b1b33c51f1f61": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_95e5e68b326c273ad6cc972da40db964": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_d034892bc10ad8119eb693c26c446872": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_59273e8139730e908854d78277c7ef5d": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_38d31d5a55dc6c5949344cafa3d9af8e": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_cb4cd71a51682855c8edab5a4c7feed0": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_8f26fceaa16dcd23e15fd0374b00c180": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_9f51c2e775168c9210ecaa0f099863eb": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_278180f1e42f34b5c49e1fe06897024a": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_dd8d5fe6e4edf2f0ae2725232dc26568": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_1c6f532c5586ba68ae2a4aad3f69a6de": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_781c7a354b8b2b1067fd0e716c592eef": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_0796de6192fb0504a3f5c752cf44076b": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_fc497a7bdeef9e289206ad8522deff0c": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_b94af162f2fd87653abe5188841c9668": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_7c07a8bec8e35141e82355f33acc390a": "2211.03062_74227f43fff51933bc133f62be15ad2a",
            "2211.03062_5caf913166fc9ea695d4d4109766b9e5": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_36b33c3175694929f4e98ab957c48b80": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_9f32f849be381da3d67b5266f44bd593": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_7b5f8ec870d43fb6ae1108078f1886d7": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_d186b111df4e5d3b62490fee8191a40e": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_33a762f9d05b8672928064ef04061fc6": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_917d44b8fbcee282b1a7430582455028": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_014b522099f590eea8fcb7d1cc656532": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_1bf5e904fff0c32f307910730c45fee2": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_f23d6af941320551caf9f286be6645fa": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_2b69d9ac7d39be1146c42707387dc1c8": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_0bf07cdb49c0f262b49fdb243c796d95": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_88fb3e307a334e3e95cf56be70436953": "2211.03062_5caf913166fc9ea695d4d4109766b9e5",
            "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_f65575bb3343a3f359dec5e140bbf8f4": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_1550be6685b27af76b26ff987a46b88f": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_4383b081cba8f285e7854426f9ea1e6d": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_f003fbbef51ea5a84652ed7a796af1d6": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_005c128d6e551735fa5d938e44e7a613": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_4f2e1174a7606509d9ead0f4b50ed242": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_632890b0b61b91d9b609b9aadc277b23": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_c53fd6916d24e097c8756ec1fe899a13": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_04770c077dcba12a35cc9b27921c2165": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_4a0d01b0f5d4d481ac6bf947f8292536": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_408f056f06845c2c321242441b65919e": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_0e2da0529a5bfb755897c5d2fbfd8bcf": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_d1e094738151e132f0381c2f163fa8d2": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_202f2edd87487ba03c0e2573c1ee518f": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_8fb5e05ba9342dde790c499bb4c77ac5": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_768ba6343b40290580dbb22eee634741": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_f758aa5b89fd9278a66b970f7ff9e3d3": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_79aad8745b1b518daeef3fe860da4922": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_9d53cfb3de3a3e13dbd8b51f0f762363": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_d58763da26a061ddb5d26c337f8176c2": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_c78bd47f6af6291187ad968471d5c943": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_376553aedc26de5c15e98f1265b2e73f": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_d00361790ce001baf8babda136dac8e8": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_9c0fc9fdbf2de0cea36e1769dd4732f1": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_f4f1423f2d7bf92194e297dcee70998e": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_cb93d06bd95a3e0a23e5df3829e7dc5f": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_dbb568bb9e36c47ae454455fc8ae7b01": "2211.03062_74a7da3a29f9ec3b5c531c43aa053b49",
            "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0": "2211.03062_2bdd0c43aeffe8a4dbc33de3a3cdd4d0",
            "2211.03062_f0b83d1333f4779ce373229373bb0398": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_111b384324cc9b6500a601beff71b121": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_01ab8371a23940bcb976ca609279b528": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_be46fb7abdd575dfde1daab80816dafb": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_4d6a299b1e7e3201ced70de3a5fff015": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_6edb57b2f5e8060f54fa8968d6167c9a": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_b285e5eb7bc2e481b3bf19806f26a687": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_b0ff2e101b640ffe50961644eefc2228": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_2ee9648e8596ee805ae7edac324cf364": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_d8f9775b3c74eff93048b857ca76c5c1": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_2f103660812ffe23c395099098360432": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_2ef85cd8502c319aa4ef3b1ff53dcea5": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_a96186115508ccc63054b185d4504354": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_9dd3b29e096c07309f35fb6e57672779": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_edcc77f8a0d54c9b8931bdc22ba89940": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_b2e35dd8d073893891acba1ef2974f06": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_f0e6d810d75a58d7791d53edd15fe13d": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_4188675f1668affac1069d636f84df92": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_a772cbdbf69499c36aa8e1442ca7153c": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_66b5fbf85aa60890e9438a34b82f6e71": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_9f17be715088007294895d36702e29d2": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_0b2a9c4ac9f2afc355b1d4130dc5c628": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_c5e09bdca8b872c8260c7dfc6813b877": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_7777331e556606845b5340ae16e0575c": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_8f0795593f7eaefea0504d097fc2db56": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_e684ae30da6ad0303a93ebfbac652a49": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_e76f045c88086cc973db556f3d9c2939": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_45f01e896e68d55d2851eff2c2aafbeb": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_f3c79d5a643f9d7368f646b90af96756": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_c2beeb8413f08c429243eb9647dfc8ac": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_a3a6b0b175fd4618d91e32bfd16fe70e": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_76c61ddc54cffdee1d996379194a3c71": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_863aa42517fbfc8832924407fa8cb5a4": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_01d3d1fa2fe3616bf15d388c44737a47": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_bca5d72073cfc38ffe2669fcfc6a5bf6": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_b64f51253c344c4c69a259f263a4bede": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_be19170ab7a228b4d60931161f6f4c87": "2211.03062_a5e433bbcae774bf6b6de74facbf8bd0",
            "2211.03062_361caabcaf9bddde7fe9cea1966de629": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_6e1100b133ef32abdad04b33aeb95b3f": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_77a4c1e70ffae92df401e770c04fe658": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_d5bc0f37f34140e73b4611e2d885eef5": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_aee5242595928a194c9cc7cee6fcfdb1": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_f49a5121bbf37ba07fc9a9bf6bc84fd8": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_0a2beb9f5c8ccf865643c9ec9bfe26eb": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_984669b52700034772af3c3505154dc6": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_15db3e3657924f041acf3ead7ea0a7d1": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_c88d67101d76b10c7fecf606a5e18627": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_6ed04270e309987b2fba85341fc56dd4": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_541d1a3f4555a978e3accba21a671dc8": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_6b5171b4c10b81e6f263611348b1ca7b": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_60667466086da6cb3fd6ff5405ac5123": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_bb9091f2a28d87892a7c03fd9e64ac3e": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_1f5c730c249d8658679321f592afba5f": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_729f50eead0a4bc367d16c959688f858": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_22067f82998d3bea4e837a5d8ba8c79f": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_1aa39455c7b9bd2952233014d7ee0d62": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_4ebaf67acfa30d9f253325265b5e8685": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_e44d0fea781deb6f73cec50b5c3f2c02": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_b894ef38d115423215a701973b67f6df": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_7badaebbcbb1e04d384512bf4ee69933": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_60fec6a460c0defa92d516aafcdb4c80": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_1e3dbdf1b03151eedeb94572915bea06": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_bafef485fe26229782d990e27bfed78a": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_92e9ec138766c5cd257f3144745afb28": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_05fbb6792748c449bd8177660c851bd3": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_02d2945e466f852dc993ce8edf52b3aa": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_3c48587595f5742d1aeb9f18a408b6fb": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_011c083193f93a809dce97f1c8106f71": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_4d17fca64bc97d10a1f67d46cf3a94ff": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_28594d29d70988e55304c59024420763": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_acd2bc62d04f2e28e4dea271d1df273b": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_2c5cfc516c81d139edeffcce11b6733a": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_9952c41b78393acd715d0bf29a09917a": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_adb88da674b6b376c6b825b4efe733e1": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_d25bb6719b5b4ec0e148ca3ed242286c": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_821c4ea2b52d99b2ac21e0478bd36f0b": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_d41401c759d5f7127bf0d90821a93856": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_0d99931193a9586f6ee574a417d79110": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_8f1028c4ca793624ab86909865721b22": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_a907713e011731f1bf343cf15f9daba8": "2211.03062_361caabcaf9bddde7fe9cea1966de629",
            "2211.03062_ec0bc5c569709d21640eea1a1b94540b": "2211.03062_e353dbe42c8654f33588d4da0b517469",
            "2211.03062_61617de78e4a6609213fab6d23e74fd0": "2211.03062_ec0bc5c569709d21640eea1a1b94540b"
        }
    }
}