{
    "elements": {
        "2211.03208_484d63715016b3faeb431c83724680c9": "Document Root 2211.03208",
        "2211.03208_e353dbe42c8654f33588d4da0b517469": "Abstract",
        "2211.03208_00edd66487f833a95eda2eee6138b4db": "Drug development is a wide scientific field that faces many challenges these days",
        "2211.03208_c88598c86e305019721baddb30a11bf3": "Among them are extremely high development costs, long development times, as well as a low number of new drugs that are approved each year",
        "2211.03208_88bd1313b3383d8bbeaa43be8c262c97": "To solve these problems, new and innovate technologies are needed that make the drug discovery process of small-molecules more time and cost-efficient, and which allow to target previously undruggable target classes such as protein-protein interactions",
        "2211.03208_d0f93be314d972f0d80d1a19a24bfb5d": "Structure-based virtual screenings have become a leading contender in this context",
        "2211.03208_dd39daf8d1cc7846d94f7dd5f09e6833": "In this review, we give an introduction to the foundations of structure-based virtual screenings, and survey their progress in the past few years",
        "2211.03208_5dcc89c995e4ea4b005de3033e930ad7": "We outline key principles, recent success stories, new methods, available software, and promising future research directions",
        "2211.03208_23f6995342463f05ce134cf17c997719": "Virtual screenings have an enormous potential for the development of new small-molecule drugs, and are already starting to transform early-stage drug discovery.",
        "2211.03208_8b2d03e454e7bc67522d591de6622e04": "drug discovery, structure-based virtual screenings, molecular docking, ultra-large libraries, machine learning, deep learning, GPU acceleration, free energy simulations",
        "2211.03208_5933ba40c36942af6d85eae2b87d1ac5": "INTRODUCTION",
        "2211.03208_aca2dccf69f0f41ed5f00f9d42cf606a": "The development of novel small-molecule drugs is a highly challenging process, which is time-consuming and expensive",
        "2211.03208_bdd1a6aa8eb88d576a329e265fe9d504": "\\cite{DiMasi2016a}",
        "2211.03208_63eff0f37e5014dc9ba3dbe70151bb91": "One critical step in this process is the discovery and optimization of hit and lead compounds",
        "2211.03208_b938d4811425ec1851cf2a10ba8a3ff6": "In the past few decades, experimental high-throughput screening (HTS) has been the primary method of discovering new hit compounds, and this approach is still the dominant method today",
        "2211.03208_f86d8659c8c7c2fb5553ea3003aabbfb": "However, HTSs often suffer from several major disadvantages and challenges:",
        "2211.03208_a8f65dd93445b90d34246cc201862695": "List (itemize)",
        "2211.03208_7d74f3b92b19da5e606d737d339a9679": "Item",
        "2211.03208_bb65db63651cd4e3a41b44fdae432363": "HTSs can be time-consuming, e.g. because the binding assays that will be used in the screen have to be prepared and optimized",
        "2211.03208_b689c777394b5f7f6f3f843aaea0d2be": "The ligand library that will be screened has to be prepared as well",
        "2211.03208_6394fd1a158b2d2db355851cb54fee54": "The HTS itself can also be time-consuming, depending on the binding assays used and the equipment that is available to carry out the screen.",
        "2211.03208_7028be5298e9cad74470b4074a1cda9d": "HTSs tend to be quite expensive, not least because of the robots that are needed to carry out the screens, as well as the physical ligand library",
        "2211.03208_74c0fe0caf1082b04d2f2bd573753b41": "\\cite{Martis2011}",
        "2211.03208_5058f1af8388633f609cadb75a75dc9d": ".",
        "2211.03208_f7bce49f240e23a6ed180a0cc4bddedf": "Initial hit compounds obtained by HTSs are often only moderately biologically active, which can in most cases be attributed to the fact that the screened libraries are of relatively small size (typically tens to hundreds of thousands of ligands).",
        "2211.03208_f51892cdc37fddc152a1dd2ff0b19367": "As hits obtained by HTSs usually do not lead to very high-affinity binders, challenging target sites, such as flat protein-protein interactions or allosteric sites, can often not be successfully targeted.",
        "2211.03208_ccc6558be912a04cde6a47bdfca5a51a": "In HTSs that lead to sufficiently good hit compounds, the number of obtained hits and thus scaffolds are often quite limited",
        "2211.03208_018225ca8486e9e14b3085877e21550e": "Furthermore, the same screening libraries (and thus scaffolds) are often used again and again in HTSs for different drug development campaigns, strongly limiting the chemical space of molecules that is explored for discovering new hit compounds.",
        "2211.03208_ef28d2b1a3be00766a94fd3f28aebbd4": "HTSs typically do not take into account whether the discovered hits are specific to the targeted receptor or are possibly binding to other biological macromolecules as well.",
        "2211.03208_4dbde906faac0f6a705a01b88b3ca152": "HTSs do not provide mechanistic insight into how the ligands are binding to their target receptors",
        "2211.03208_69d81486bdfb597516836a527b48279c": "In phenotypic kind of screens, it is typically not even known to which receptor the ligand is binding.",
        "2211.03208_d751713988987e9331980363e24189ce": "[]",
        "2211.03208_9abe45bda0ca40fab5224b9c04318c89": "Virtual screening approaches can mitigate all of the above problems, each to a different extent",
        "2211.03208_ec0ed49bbcf8a34ee9c4aba4fe22cf5b": "Virtual screenings can be very fast and cost-effective",
        "2211.03208_e2fc2c4e8ff9d58b4e62fd8dee52a88c": "They can lead to highly potent initial hit compounds, and address even challenging target sites such as protein-protein interactions",
        "2211.03208_20f7006392353f5367430876caa29123": "In structure-based virtual screenings (SBVSs), the binding mode of the ligand to the target receptor is predicted, and thus (predicted) mechanistic insights are available",
        "2211.03208_7706d0228ba260b56bae7a9081ab6c95": "Virtual screens can also lead to larger number of hit compounds with different scaffolds, thus providing a range of backup compounds.",
        "2211.03208_e8a3f0c46f4cfa7552654153fcce5485": "In this review, we first give an introduction to some of the fundamentals of virtual screenings (Section",
        "2211.03208_9371d7a2e3ae86a00aab4771e39d255d": ")",
        "2211.03208_ddc76e09e2939872f9185094dad4964e": "Afterwards, we give an overview of recent developments regarding virtual screening approaches for drug discovery, starting with ultra-large virtual screens (ULVS, Section",
        "2211.03208_682b28f800674f10c7c9fd794bbcc879": "Ultra-large virtual screens in which more than 100 million ligands are screened",
        "2211.03208_049369462a288edeb4936c74aa59eef7": "The subsequent sections cover approaches that can speed up ultra-large virtual screenings, and make them more cost-efficient",
        "2211.03208_eea4861c14bd502b42dba24ebd279919": "Among these approaches are synthon-based virtual screens (Section",
        "2211.03208_84764da809cae3df77750e9b8d480e06": "), deep learning (DL) approaches to molecular docking (Section",
        "2211.03208_09faac44d5d9e429e0b60f8581355ac9": "), machine learning (ML) approaches to virtual screens (Section",
        "2211.03208_1b47b73b2235c63a53167ac1f6ed429a": ") that combine structure-based virtual screens (SBVSs) with ligand-based ultra-large virtual screens (ML-LB-ULVSs), and hardware acceleration via GPUs (Section",
        "2211.03208_2da15d511f9ab741fd489c0ebfad8248": "Thereafter, we look into an approach that can increase the accuracy of virtual screenings (as well as their computational costs), namely their coupling with high-throughput free energy simulations (HTFES, Section",
        "2211.03208_6068718aff46d5d98007adff3935413a": "Finally, we briefly discuss the potential that virtual screening approaches have in the future (Section",
        "2211.03208_3ae449e8e0dd7f92d1320260ae8dd6b2": "A broad overview of the topics discussed in this review, and how they relate to each other, is shown in Figure",
        "2211.03208_0cb6e9ef39c0d450616a167527803943": "\\begin{figure}[t!]\n    \\includegraphics[width=0.75\\paperwidth]{Figure_1.pdf}\n    \\caption{Overview of the major topics covered in this review, and how different techniques can be used in concert within the context of structure-based virtual screening approaches. Ultra-large ligand libraries (Section \\ref{Sec:ULLL} are the starting point of several modern screening paradigms, such as docking-based ultra-large virtual screenings (Section \\ref{Sec:ULVS}), synthon-based approaches (Section \\ref{Sec:Synthon}), and ML-based ULVS (Section \\ref{Sec:MLVS}). Deep learning-based (Section \\ref{Sec:DL}) and GPU-based docking programs (Section \\ref{Sec:GPU}) can be used to speed up structure-based virtual screens in any of the three primary virtual screening approaches mentioned above. Docking-based ULVSs require an ultra-large ligand library in a ready-to-dock format, while ML- and ligand-based ULVS (ML-LB-ULVS) require typically a SMILES version of the entire library and only a small fraction in ready-to-dock format (for training the ML model). Synthon-based approaches use the initial synthons that define the on-demand libraries for docking, and only require a small additional fraction of the assembled molecules in ready-to-dock format. High-throughput free energy simulations can be used as an additional screening stage to refine the results of all three primary virtual screening approaches discussed in this review.}\n    \\label{fig1}\n\\end{figure}",
        "2211.03208_42e7359ab8a75634000aa9017385088f": "FUNDAMENTALS",
        "2211.03208_10761922a6de3a783a7f5cdafb0a69d4": "Several concepts and underlying methods are used in connection with SBVSs",
        "2211.03208_4e4106e65f51b68b5d9c3bd2433957ad": "In this section, we introduce several of them.",
        "2211.03208_510045ccf46342d64661aa3aec9b2453": "Virtual Screenings",
        "2211.03208_1d499cb3559f4f8e3b4547bf07e2bcf5": "Virtual screenings are procedures, in which a collection of ligands is computationally screened for their ability to bind to a given receptor structure",
        "2211.03208_f12ff111a3706d64bbbf1887d70c671f": "Receptors are most often proteins in the biomedical sciences but can be any type of biological macromolecule, including RNA or DNA",
        "2211.03208_c882234274eb3ae7b7cdfff10aaca30b": "Virtual screens can be classified as ligand-based or structure-based",
        "2211.03208_2b91e61fba601575292f5388ab76bb9f": "In ligand-based virtual screens, only the structure of known active compounds is used for the screening procedure to identify new active compounds",
        "2211.03208_c6d57b100a63250fbcdd764ef1fa3a5f": "If the 3D structure of the receptor is available, structure-based methods can be used to carry out binding free energy calculations to estimate how strong the ligand binds to the targeted receptor, and the binding mode can be predicted as well",
        "2211.03208_4666daf2ac7c493ef801279d1121c717": "There are a large number of free energy methods, and because of their high speed, the predominant type used in virtual screens are molecular docking procedures",
        "2211.03208_fcca54e9c79a79e085a7bea9416caed8": "Structure-based virtual screenings are normally preferred over ligand-based screens when the goal is to identify novel scaffolds, since ligand-based approaches are often biased towards compounds similar to known binders and do not provide a docking pose",
        "2211.03208_edcf376aefa94122c3ee8daf56731834": "Virtual screens can be carried out in multiple stages, where in each subsequent step the best X compounds are used from the previous step, and methods of higher accuracy and/or computational are used to improve the quality of the dockings",
        "2211.03208_30c045c509181b366d0d86a031fb3b5d": "\\cite{Gorgulla2020a,Olivet2022}",
        "2211.03208_021c0e0548be7f524cb410946721ad1f": "This principle is illustrated in Figure",
        "2211.03208_299c045524c45bb12e6cc848815c4108": ", where each stage acts as a funnel.",
        "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0": "Molecular Dockings",
        "2211.03208_4c97352f89f8849698c629b61eece9c1": "A large variety of docking programs have been developed in the past several decades",
        "2211.03208_b96b9debf6e3d9087712feee2d0c8711": "\\cite{Biesiada2011,Fan2019,Pagadala2017,Rezacova2008b}",
        "2211.03208_c3616f8d049a5d17db244544451faa6d": "Docking programs typically consist of two components",
        "2211.03208_1f9d1dcd989d1a8126765d9bd2d63626": "First, a conformational search algorithm that explores the possible binding modes (conformation) of the ligand and the protein",
        "2211.03208_8723e8e9ad42b0f14a075a247338c60b": "The second part is the scoring function, which assigns to each conformation a docking score that correlates with the predicted binding affinity",
        "2211.03208_2e3649d639926d026a58e4bab32e19f7": "The binding mode with the best score is typically the winning and final docking pose",
        "2211.03208_52c287fec5a764ce36ee28c9e267a895": "Docking algorithms can be classified into four primary categories: Physics-based (also called force field-based), knowledge-based (also called potential of mean force-based), empirical (also called regression-based), and machine learning-based (also called descriptor-based) docking routines that vary in the methods they utilize",
        "2211.03208_5e8a48e1e0fa0f46c611df47f44077ca": "\\cite{liu2015classification,yang2022protein,ain2015machine,li2019overview}",
        "2211.03208_2e2d69a7178955d1c78950920f27785d": "In Section",
        "2211.03208_e3a633752d977ef352f491bb43ea6dd3": ", we explore deep learning-based docking methods, which are a subclass of machine learning-based methods that have been developed only recently and can greatly speed up the docking procedures.",
        "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1": "Receptor Structures and Preparation",
        "2211.03208_6f75b012cabf3aa9778a473bedc85b1f": "Structure-based docking requires the receptor structure as input",
        "2211.03208_28814fb2f74548681fe397d38bf6e767": "One primary source for receptor structures is the Protein Data Bank (PDB,",
        "2211.03208_78d26f5aead5a03e3b0a2dd0860de0d6": "), which is the largest database regarding experimentally determined protein structures",
        "2211.03208_28283cc35093c143c3f1295a4e5c3755": "\\cite{Berman2003}",
        "2211.03208_4ea6c08be733e3b23984b05dc7f6aeac": "Here, X-Ray crystallography, nuclear magnetic resonance (NMR), as well as cryo-electron microscopy (cryo-EM) are the primary experimental methods to determine the structures of biological macromolecules",
        "2211.03208_341ad7716eefc3d0d64d4bc268f657c5": "Cryo-EM is the youngest of these techniques and has experienced tremendous progress regarding its capabilities and resolution",
        "2211.03208_b69f65843278cc5aa76103bcd4e9da2c": "Recently, even atomic resolution has been achieved",
        "2211.03208_a3f17b1379791bda70b0d13066d77c9a": "\\cite{nakane2020single}",
        "2211.03208_9f2ccebb04ee4d21924c64e954994d65": "Cryo-EM is particularly powerful regarding the determination of larger protein complexes, and thus also for the identification of protein-protein interactions.",
        "2211.03208_9d4e33ffb5b0f45b8ee26ab6ab3e8cdf": "An alternative to experimentally determined structures is predicted structures",
        "2211.03208_b0bdd9debec3e3eb8bd0dbca2b3a5fb3": "Here, homology modeling and",
        "2211.03208_00a3d913041ec28cdd8c9ee758163907": "structure prediction are the two primary types of prediction methods",
        "2211.03208_b4d523a4b7a364e228eaf16ebe43975d": "Homology modeling uses a structure of a homologous protein that is known as a template.",
        "2211.03208_be922fbd7d285e458648be106dba72f3": "structure prediction does not require such a template and can predict new structures from scratch",
        "2211.03208_b99e1a6a42209f18b666374a41cc0b66": "Structure prediction, similar to cryo-EM, has experienced a breakthrough in the past few years",
        "2211.03208_53bec7bc688e904523d0d21b291500f7": "With the advent of AlphaFold",
        "2211.03208_d2ff5363c1dd0f4727257e336d0da5fe": "\\cite{Jumper2021,Jumper2022}",
        "2211.03208_b5ccb8017156ad20f68bfbd51511f63a": ", the structure of almost every protein known has been predicted and made freely available in the AlphaFold Structure Database",
        "2211.03208_910475193ac4573e3f84fa86992067e7": "\\cite{Tunyasuvunakool2021,Varadi2022}",
        "2211.03208_42fccbd12ae6fc95d09f82bfa00dadbe": "The AlphaFold Structure Database contains over 200 million protein structures",
        "2211.03208_fd9712b0e92dbbecd48bf130ae0286e9": "These recent developments in structure determination enable structure-based virtual screenings for almost any target protein.",
        "2211.03208_f519b794f7279913664b1643599996aa": "Ligand Preparation and Ligand Libraries",
        "2211.03208_f03d6d3094bc614d6a564059b04d1436": "Virtual screenings require ligand libraries that are used for the screening procedure",
        "2211.03208_af67852c5a1cb1b7242fb03480396b4c": "In the case of structure-based virtual screenings, the ligands have to be in a ready-to-dock format",
        "2211.03208_c3a41a742c26d523af873abd9ca942d1": "\\cite{Gorgulla2020a}",
        "2211.03208_0455b3ac71067b1786c4466049cfa118": "Preparing ligands into a ready-to-dock format typically starts from the SMILES format and involves generating stereoisomers, tautomerization states, predicting protonation states, computing the 3D coordinates of the ligands, and converting them into the target formats",
        "2211.03208_f148449fd60722165d4036f53fa5900d": "The precise formats that are needed depend on the docking programs that are used",
        "2211.03208_097b6fb93c7564a55642d3f8a442aa2b": "Most docking programs require ligands in the PDBQT, PDB, MOL2, or SDF formats",
        "2211.03208_2c897e5a79ca15cd0569bff0349c8f2d": "In ligand-based approaches, the ligands can be given in line notation, such as the SMILES format that is mostly used",
        "2211.03208_6fc949f1c58c1777773050dea0ee0799": "However, sometimes 3D pharmacophore models are used in ligand-based screenings, in which case the ligands might need to be in a 3D format as well.",
        "2211.03208_c7b169652feac844cda7c5587312c759": "DOCKING-BASED ULTRA-LARGE VIRTUAL SCREENINGS",
        "2211.03208_6d20f13823a952f249b76535869d93f8": "Ultra-large virtual screens have emerged as one of the most powerful virtual screening approaches to date",
        "2211.03208_3b4956f7c1591b0192fe66563b4afd72": "Virtual screenings have historically been called ultra-large when over",
        "2211.03208_9b4bb9c1c6df97a256435a0be323384a": "100 million compounds are screened (though what ultra-large means might change in the future as computational power and library sizes increase",
        "2211.03208_3735ec776c4236dfb173bedf7ad4214b": "Several high-profile papers have been published in the last few years, including experimental validation, that have demonstrated the potential of this approach (see Section",
        "2211.03208_2a787130d9f2ad007b2fcd2a631d9cbf": "for more details)",
        "2211.03208_ab8bc691e3955e8b4f53c2a1420f7283": "Ultra-large virtual screenings have become possible in the past few years due to the recent advancements of multiple technologies and resources:",
        "2211.03208_7bade40785d1f5c1dbec8c0414eaac9a": "List (enumerate)",
        "2211.03208_9268e29cae0dbce44701e4f552b8a88e": "In the last decade, the first ultra-large ligand libraries with over 100 million commercially available molecules have become available.",
        "2211.03208_180689304ed32b3d0d1a5d173c584c75": "The capabilities of university computers clusters, national supercomputers, and commercial cloud computing infrastructures have improved substantially",
        "2211.03208_ff1c8e0a1437a795ad28b79194009771": "Through these computational resources, sufficient computational power has become available to the scientific communities to carry out ultra-large virtual screenings.",
        "2211.03208_8c5212fb2a54ea2458087f9ab9145696": "Software platforms, such as VirtualFlow",
        "2211.03208_ec9c3a652825bc7ee67e2760cd5a5b2b": "\\cite{Gorgulla2020a,Gorgulla2020b,Gorgulla2021b}",
        "2211.03208_52f938ca332cf61611120416c7b6e75e": ", that can screen ultra-large ligand libraries using the above-mentioned computational resources, including cloud computing infrastructure, became freely available.",
        "2211.03208_7db08ad9fc83efa696e6a411368ba014": "We will review available compound libraries and software in the sections below.",
        "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b": "Ultra-Large Ligand Libraries",
        "2211.03208_75d45cfbf72c6c2a9c5fc5c76d5373dd": "Ultra-large ligand libraries can be of different types",
        "2211.03208_7cb5ad2030e191b5782a704ecd84e665": "They can be",
        "2211.03208_c0cb5f0fcf239ab3d9c1fcd31fff1efc": ",",
        "2211.03208_16ea45fed9303a819148a75e6d65a820": ", or of",
        "2211.03208_405aaff66082ffe7231d7c1f79926c17": "nature",
        "2211.03208_df96112e3966e5a6f963d1cfc5fecf43": "\\cite{Hoffmann2019}",
        "2211.03208_8e712c6376fdada573a2512853a7ba91": "Here,",
        "2211.03208_40e1622410b0d5dd0a83821e57685bd4": "refers to the free availability of the ligand database without general commercial availability, while commercial libraries contain compounds that are commercially available for purchasing",
        "2211.03208_7de5916534611a9040effb3f21fde466": "Proprietary libraries on the other hand are generally not available for purchasing, and usually only available for internal use by the company that possesses the library",
        "2211.03208_cb0c0a15dc5986fb55471300c7d8c4dc": "Commercial libraries of ultra-large size contain mostly compounds that do not yet exist physically but can be synthesized efficiently on-demand, meaning upon ordering, by compound vendors with a certain success probability",
        "2211.03208_5d828b905ed58f9e6824e7052f0a9752": "These libraries are therefore also called on-demand libraries",
        "2211.03208_4465dbe57e79a2ee4e39316413e0cc2a": "Below we review ultra-large ligand libraries of public and commercial nature",
        "2211.03208_56a7c977f057a113fd4420fa237da151": "Details on some proprietary libraries can be found in",
        "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c": "Public Virtual Libraries",
        "2211.03208_3de5e5d26540971c29d3924965e278b7": "Public virtual libraries can be useful and interesting because they allow to explore and test compounds via virtual screenings that are beyond current commercial availability, and with that vastly increase the chemical space that can be explored",
        "2211.03208_5922cc1e9670522b09e1d9830eeb4220": "Below we look at two types of these ultra-large public virtual libraries.",
        "2211.03208_3389dae361af79b04c9c8e7057f60cc6": "*",
        "2211.03208_35c903c95f82fe057554a22172b16f6c": "The Generated Databases (GDBs) by the Reymond Research Group likely were the first ligand libraries of ultra-large scale",
        "2211.03208_868226b1a1295e2384e87a0a2af3a64b": "\\cite{Meier2020,Reymond2012}",
        "2211.03208_74f370f3d05f637aa45898a91755b012": "The GDB-11, containing all molecules with up to 11 atoms of type carbon, nitrogen, oxygen, and fluorine that satisfy certain valency, chemical stability, and synthetic accessibility criteria contained 110.9 million stereoisomers",
        "2211.03208_a9959ece70d841b452903f1422d22536": "Subsequently, additional GDB libraries were published",
        "2211.03208_3df4044b87a5a851fb24d7db64430906": "Among them are the GDB-13 containing molecules with up to 13 atoms resulting in 977 million molecules, as well as the GDB-17 with up to 17 atoms of the aforementioned atom types giving rise to 166 billion molecules",
        "2211.03208_fd3ff5a05f4a7679c450c803f2879848": "\\cite{Blum2009,Ruddigkeit2012}",
        "2211.03208_ad1cf81c6aafe9ebe09c084b327d4943": "While these libraries are among the first of ultra-large size, one disadvantage is that these libraries are only available in the SMILES format",
        "2211.03208_0a1a2e3fad3f86b51bce6184a054eb70": "Another disadvantage is that the compounds are not commercially available for direct purchasing",
        "2211.03208_0ddc681816c94f7d5b2ead0be6f74889": "Rather, custom synthesis of these molecules is mostly required, which is possible via commercial companies but can be expensive and time-consuming",
        "2211.03208_a5accd5e01f1b09b14ada643d9dea188": "To address this problem, GDBChEMBL has been created, a library that contains only compounds from the GDB-17 that are similar to molecules in ChEMBL",
        "2211.03208_dd082050d4dfad2dd6b632dd320c31f0": "\\cite{Buhlmann2020}",
        "2211.03208_d5283f917f382c754d9098e06b707b9a": "However, it is of relatively small size and only contains 10 million compounds",
        "2211.03208_e30e5f5ab3838dce521c615e4d510585": "A similar library, GDBMedChem, was created that contains 10 million compounds from the GDB-17",
        "2211.03208_88e57bc950f5bd184437d6b42754df4d": "It only contains compounds favorable from a medicinal chemistry point of view.",
        "2211.03208_2d6499b6cb48936a6e0e1e790ed10679": "The KnowledgeSpace is another chemical space, which is similar to eXplore (see below), but more difficult to access in general",
        "2211.03208_94b2cd496a6be4f9838e6aef9bf0e08e": "\\cite{Detering2010,BioSolveIT}",
        "2211.03208_594a5104481bc6aa91e67a2d5800d236": "Like eXplore, it is based on commercially available building blocks and reactions known from the literature",
        "2211.03208_ca4800d665f57392465a11eba466448f": "However, there is no commercial service available that readily provides these compounds",
        "2211.03208_370964eec07cba8c52acb1ce1b35ab6a": "With",
        "2211.03208_662a6fada78452edbb46fab925b017eb": "$2.9*10^{14}$",
        "2211.03208_7ef433f0bacb7db28689f6f23a865c22": "molecules, this space might be the largest public library for drug discovery available",
        "2211.03208_9d31283197d429475290a9a0da6c09a0": "It can be accessed via infiniSee from BioSolveIT",
        "2211.03208_4723e9083273eace05e3b18e949dc6cd": "\\cite{BioSolveIT}",
        "2211.03208_9cf914d6d74072c0801e6ffed4129f1a": "but is not available in a ready-to-dock format.",
        "2211.03208_d0de37c499ceb96d25b8fdec72905863": "Commercial Libraries",
        "2211.03208_b72afbec2389735b78da2e53553d89ca": "Ultra-large commercial libraries are based on a smaller number of fragments and combinatorial chemistry, which allows combining of the fragments via combinatorial chemistry to complete molecules",
        "2211.03208_8588b8399637ce1384b3648f2cfcc95b": "One important aspect regarding these on-demand libraries is their chemical diversity",
        "2211.03208_2b50821594a324858eff64144d9b39de": "Combinatorial libraries like these might lead to large numbers of compounds, but do the resulting compounds also represent a diverse chemical space, rather than a small region in the chemical space with highly similar compounds? Two recent studies have looked into this question",
        "2211.03208_af9b3b6d3e24f1580b5645c701c548c2": "They concluded that the resulting chemical spaces are surprisingly diverse and more diverse than typical physical HTS libraries",
        "2211.03208_659539c501a349c7db4e410172799c8c": "\\cite{Tomberg2020,Irwin2020}",
        "2211.03208_3602d31b2837efcf23694ab96eed8239": "Below we review the major ultra-large on-demand libraries that are available.",
        "2211.03208_7c29e87fbde86cbe29df064f65eb652f": "The two major disadvantages of the GDBs, non-commercial availability and non-ready-to-dock format were first addressed by the ZINC libraries",
        "2211.03208_f39a140653b561d36503897a146bfe1b": "\\cite{Irwin2005,Irwin2012,Sterling2015,Irwin2020}",
        "2211.03208_6ba7595bbc191a3707b857e0d3e91552": "ZINC15 (published in the year 2015) was the first ultra-large ligand library of commercially available compounds in a ready-to-dock format, with initially approximately 120 million compounds",
        "2211.03208_59f8be32f381c709110a894bcca93a8e": "\\cite{Sterling2015}",
        "2211.03208_53a5d3e7e6f3e0d4ee7b5e4f716fa498": "The library has steadily grown since then and has reached approximately 1.5 billion molecules to date, out of which approximately 750 million are in a ready-to-dock format",
        "2211.03208_6f22f05a0a4c69fcc6c085e1f4c9c4dc": "A more recent version of the ZINC library is called ZINC20 (published in 2020)",
        "2211.03208_54be83fc131cfe211c66bed8dc1dd399": "\\cite{Irwin2020}",
        "2211.03208_ce84a14efece0b89d7ef6da313cb28ee": "ZINC contains and aggregates the catalogs of hundreds of different compound vendors and other chemical libraries such as ChEMBL.",
        "2211.03208_e3ce1cf0c07fcfa508ab166d612ed3e2": "The REAL Database from Enamine was the first library available from a single chemical compound vendor reaching over 100 million compounds",
        "2211.03208_942ea7fbbb1d15212471005e42dd06e3": "The first version was published in 2007, containing approximately 29 million molecules",
        "2211.03208_ac4aca32fcc6a453435252e61f0d365e": "\\cite{Shivanyuk2007}",
        "2211.03208_4140ba74fe55e12696111d41ca35c514": "The REAL Database has grown over time, and the latest version of the REAL Database contains approximately 5.5 billion compounds",
        "2211.03208_930128db7f87b62b6cec62a91360c312": "\\cite{EnamineREALDatabase}",
        "2211.03208_e731d6fc1394199b207feee2b1902d42": "that comply with Lipinski's rule of five as well as Veber's rule",
        "2211.03208_696c5fe24e90f0c032709b88e32b23ec": "The majority of the compounds in the latest ZINC databases are from the REAL Database from Enamine",
        "2211.03208_122a5112c6433df14429df2b7a12a27c": "The typical time until shipping is 3-4 weeks, and the success rate of synthesis is approximately 80",
        "2211.03208_3a1e650e24d6557bc83ce885309ac023": "The REAL Space, another on-demand library from Enamine, can be considered to be the larger sibling to the REAL Database",
        "2211.03208_ff8b6b42dbde55af39ed61950ad578df": "The REAL Space is mostly compliant with Lipinski's rule of five, but not completely",
        "2211.03208_9dbdb3862e7fd115b28c323240b69a33": "\\cite{Grygorenko2020}",
        "2211.03208_e3c590f5b7d0f05867d4a5b76011cc57": "This can be an advantage since there exist many drugs that are not rule of five compliant",
        "2211.03208_7b8277a034da7c872425ba25e83f6bd6": "\\cite{DeGoey2018}",
        "2211.03208_f98d675961ec14d1cecc8cc58e7dee45": "The latest version of the REAL Space (year 2022) contains approximately 31 billion molecules",
        "2211.03208_e2e5ebba8d61e162c398d3c5954e2938": "\\cite{EnamineREALSpace}",
        "2211.03208_45b2e07ecc015dfcac28269744e5c5d0": "The REAL Space and the REAL Database overlap regarding the molecules they contain, with approximately 50-70",
        "2211.03208_5c3c70c8870acb1918b78df2b199657c": "of the compounds of the REAL Database being part of the REAL Space as well",
        "2211.03208_4a25d93176c92e4471a4ae9f916a9380": "In other words, approximately 10",
        "2211.03208_f66c4d5c725c6af565785a89269943b6": "of the REAL Space is contained in the REAL Database",
        "2211.03208_687c37a5bda95d3b76d8a0a77125f0ca": "The delivery time and synthesis success rate are roughly the same for the REAL Space and the REAL Database (approximately 80",
        "2211.03208_ce96ce64475d88003b81a20710c10f5e": ").",
        "2211.03208_65f7587e75dd404b64db7a06ba610520": "Another on-demand library, CHEMriya, is provided by Otava Chemicals",
        "2211.03208_95b5afccf084489b5be725531a49ad81": "\\cite{CHEMriya}",
        "2211.03208_9789a1fe4568b2e46dec704357fa5ef0": "The first version was released in the year 2021, and the latest version contains approximately 12 billion molecules",
        "2211.03208_4517b11aefbb9ba2a30b91bbb6cc3a4f": "It is based on approximately 33,000 building blocks, and around 45 chemical reactions to combine these building blocks into complete drug-like molecules",
        "2211.03208_898a5dbb97ed195ddfbd9162e5ee3ec7": "CHEMriya can be accessed via infiniSee from BioSolveIT",
        "2211.03208_cda4d07cec34b460b0fd74d56b9c7819": ", but is not yet available in a ready-to-dock format.",
        "2211.03208_df9c3c542c93c3dfced7f3c8be67966c": "WuXi AppTec also provides an on-demand chemical library, called GalaXi",
        "2211.03208_861516cb7b502ab98e58e4daa756c08c": "\\cite{GalaXi}",
        "2211.03208_4fff3e5e24eb34092c1a5b7ffa09fa90": "The latest version of GalaXi contains approximately 8 billion molecules",
        "2211.03208_8a858c9187e55bae12fe72bb1ea9aea2": "The molecules can be synthesized within 4-8 weeks, and the success rate is approximately 60-80",
        "2211.03208_2fb61f54976696fcdff226c8efda8891": "Galaxi can be accessed via infiniSee from BioSolveIT",
        "2211.03208_aa257265c8aee8befa77be289572e288": ", but is not available in a ready-to-dock format",
        "2211.03208_4e33b121a75b146c1fe19c5858ef9b23": "Regarding the major commercial on-demand libraries that are available, the REAL Database and REAL Space from Enamine, CHEMriya from Otava Chemicals, and the GalaXi Space from WuXi AppTec, one might wonder if and how much these libraries overlap in the chemical space",
        "2211.03208_8c94418edff4099a27ee31bbc49b44c6": "A recent study has looked at this aspect and found that the overlap is marginal between the REAL Space, CHEMriya, and the GalaXi Space",
        "2211.03208_8d741630a94350e1edfcc516f7f63c3c": "\\cite{Bellmann2022}",
        "2211.03208_95dbff23855538c971f50ab2aca18475": "These three libraries contained at the point of study approximately 33 billion molecules jointly together",
        "2211.03208_ee00982bb278d3dc183df2302c15633d": "The number of molecules that were present in at least two of these libraries was less than 50 million, which is less than 1",
        "2211.03208_71e07a3ff2ac796159ce07d2a53315c1": "of the total number of molecules under consideration.",
        "2211.03208_b742b75ae991a45ac9cc031b5bd0686d": "Another space that recently appeared is eXplore from eMolecules, containing 2.8 trillion molecules, being the largest on-demand chemical space for drug discovery to date",
        "2211.03208_485e6a90c4ae2e6721a98e8cfdb7e9d6": "\\cite{eXplore,BioSolveIT}",
        "2211.03208_4075dbe8907fcde79289a2c613f25b04": "Like the KnowledgeSpace, eXplore is based on building blocks that are commercially and readily available from various chemical compound vendors",
        "2211.03208_3bdc3d338b3d212cd6a644cf42f82ab2": "In contrast to KnowledgeSpace, the synthesis steps that are used to combine the fragments into molecules are based on 40 robust reactions, mostly consisting of only one or two synthesis steps, facilitating the synthesis of the compounds",
        "2211.03208_1c5a0e44f8e2113d439db268c96d6746": "The final molecules can either be synthesized by the customers, or eMolecules can synthesize the molecules or for a fee. eXplore can be accessed via infiniSee from BioSolveIT",
        "2211.03208_6ad49d1514f2e57a3c94be0295aa2d71": "Another recent on-demand space is the Freedom Space from Chem-Space, located in Ukraine",
        "2211.03208_b9bdac61f61e60eecd0b7924c7f263dc": "\\cite{FreedomSpace,BioSolveIT}",
        "2211.03208_3326bcabe042decfdd15e7dcce5bc010": "This library is based on fragments from various compound vendors as well as known reactions",
        "2211.03208_09a76ab96086c57906c69ca3ed654880": "The library consists of 201 million compounds, 74",
        "2211.03208_7e3c4998f84f9be8466624d89f3cdf8f": "of which comply with Lipinsiki's rule of five, and is based on fragments from various compound vendors",
        "2211.03208_baac8a79c409a4e86978fea06ae835e7": "The synthesis is carried out by contract research organizations, and the delivery time is approximately 4 weeks",
        "2211.03208_544713707677505e226ed6d52cc1a0d2": "The Freedom Space can be explored via infiniSee from BioSolveIT",
        "2211.03208_37378b775d7c2cbcf2bdaa923df87297": ", and can be downloaded in the SMILES format from the webpage of Chem-Space (",
        "2211.03208_80444fc1bf7c454b6436e44fed1b4f5a": "The VirtualFlow open-source project currently provides two libraries in ready-to-dock format on the project homepage (",
        "2211.03208_dc75c46d42646f69f54942d37e34c609": "The first library is the REAL Database from Enamine (version of the year 2018), containing 1.4 billion molecules",
        "2211.03208_14dd4530e2d81331b5f7ca3361d700e4": "The second library is ZINC library (year 2018), containing 1.4 billion molecules as well",
        "2211.03208_134e49d3bf505b634033bfab714a135b": "In comparison to the original libraries, the VirtualFlow versions are completely in a ready-to-dock format and can be screened with VirtualFlow as well",
        "2211.03208_51dce2a0bcc864df0a4c57616e6e363e": "In contrast, the original ZINC15/ZINC20 library so far only provides approximately 50",
        "2211.03208_eab5747db8d998f6006da44bf47b5480": "of its molecules in a ready-to-dock format",
        "2211.03208_8b547135929d55d22e004313f64a9b65": "And Enamine provides the REAL Database only in the SMILES format.",
        "2211.03208_15edaad3b2cc900ad5425ee1b5804167": "History and Success Stories",
        "2211.03208_90efbd6976cd0faa966a66726c4cfdeb": "Ultra-large virtual screenings are relatively new",
        "2211.03208_b2669127e1a750745fa225d21bc29a8c": "Below we summarize some of the historical milestones, as well as major success stories.",
        "2211.03208_617aaa1762ba2348b9b8b2f5d627e843": "To our knowledge, the first ultra-large virtual screenings were reported in the dissertation of the author in the year 2018",
        "2211.03208_7e01fda94d58c6c5298f4636bde23844": "\\cite{Gorgulla2018}",
        "2211.03208_d1ca937864a2c72a099cdb4eacc7ae25": "In this thesis, VirtualFlow, an open-source virtual screening platform freely available to anyone was published (for more details see Section",
        "2211.03208_40da9c3526b91a507de74bcbaac94f40": "VirtualFlow was applied in this work to prepare two snapshots of the ZINC library in a ready-to-dock format, one from the year 2014 containing 133 million ligands, and one from the year 2016 containing approximately 300 million ligands",
        "2211.03208_2ce2397d70b1ceed1ccc5660dfff96f4": "The ultra-large virtual screens reported included a 130 million compounds screen against the target EBP1, a 180 million compound screen against the KIX-domain of MED15 to disrupt the MED15-SREBP interaction, and a 300 million compound screen targeting KEAP1 to disrupt the KEAP1-NRF2 interaction",
        "2211.03208_cffff10e9750ead9d9ddfa1174a86b0b": "In addition, this work provided a theoretical foundation on why the true hit rate is expected to increase with the size of the screened library.",
        "2211.03208_2334c24ea38a896131cbbc0c62292a6a": "In 2019, the first peer-reviewed ultra-large virtual screens were published by Brian Shoichet and John Irwin (the curator of the ZINC library)",
        "2211.03208_3708e3ff5ecb0a52200f61fa594e39dc": "\\cite{Lyu2019}",
        "2211.03208_0cdb77ff353de75bc240285f152a77ed": ", and contained extensive experimental validation",
        "2211.03208_645eada6f7778a72f18875a275906590": "The first target in this study was the D4 dopamine receptor, a G-protein-coupled receptor (GPCR), that was screened with 138 million compounds",
        "2211.03208_27f13911175e270233d73a6f6fd3b38c": "Picomolar compounds were discovered in this work directly from the virtual screen",
        "2211.03208_7475def9272bd5162c14b89940498fe4": "The second target was AmpC",
        "2211.03208_8217ed3c32a785f0b5aad4055f432ad8": "$\\beta$",
        "2211.03208_b0fed81db02b36747f6b970025cf36d5": "-lactamase, against which 99 million compounds were screened",
        "2211.03208_336840151875852facd44e802395498c": "Low-nanomolar binders were identified after optimization based on similarity searches of analog compounds in the same library, as well as their docking scores",
        "2211.03208_c07e0d80cc0b99701c0cdcba13ac402f": "This study, therefore, demonstrated that virtual screens and molecular docking cannot not only identify initial hits but also find improved analogs of existing hits",
        "2211.03208_758823e541a9dc353cea2233efd15119": "Another important result of this study is that it was experimentally observed that the true hit rate improves with the docking score, and thus the scale of the library that is screened",
        "2211.03208_ca7bc8e9df9996cb4c4fe130d27934e7": "This result matches the theoretical prediction of this phenomenon in the author's dissertation",
        "2211.03208_30867f9b672d8e8048cbcfca136afde8": "In this study, the first results of ligands originating from ultra-large virtual screenings involving animal studies are reported",
        "2211.03208_723b6c31d783e5eaf57e4bb50c834bba": "\\cite{Stein2020}",
        "2211.03208_a1e3b3029830f9efe861c0ec4abeb987": "Here, the Melatonin MT",
        "2211.03208_b093eab53909eb186c36db5146b36f93": "receptor, which is a GPCR, was targeted with 150 million compounds from the ZINC library",
        "2211.03208_8e13c3edb75a066d9fe4378b5284bceb": "The most potent identified ligand had a binding affinity in the picomolar range",
        "2211.03208_6306ed5a5b48c2e314f84f760d523d20": "Subsequent optimization lead to two inverse agonists, and mouse studies with these compounds showed that these compounds modulate the melatonin receptor biology in a target-specific way.",
        "2211.03208_47041c50aba917030bd8c02874440f9e": "In the year 2020, the VirtualFlow platform was published in Nature (see Section",
        "2211.03208_13eabac0e0930ee4665cd7611734baf3": "for more details), along with an experimental demonstration study targeting the KEAP1-NRF2 interaction",
        "2211.03208_6cfabdfcde2b69a953065488221df44d": "This study was the first to demonstrate that ultra-large virtual screenings can be used to target protein-protein interactions and the first study in which over 1 billion molecules were screened",
        "2211.03208_e2dd2c93d61cdbbb05768a8288d9545e": "The most potent compounds obtained were in the low nanomolar range and were able to disrupt the KEAP1-NRF2 interaction",
        "2211.03208_0e8412f03c23674c018540136d09fc3e": "In this study, a ready-to-dock version of the REAL Database from Enamine (version of the year 2018) was published, containing 1.4 billion molecules (see",
        "2211.03208_b7a775bcbc26d9bf001c429e35774a40": "for more details).",
        "2211.03208_e8de5cd70bf293f1fa26942ed23be720": "In this study, the",
        "2211.03208_1cfac99084da113e3d8143b6125dc6e0": "$\\sigma 2$",
        "2211.03208_bdd0537e613c321a153f6e238afd5ba8": "GPCR was targeted with ultra-large virtual screens",
        "2211.03208_cb7ce2019e460a631b376fa6987fa8c3": "\\cite{Alon2021}",
        "2211.03208_ec16e92c49bfb68fc76845a4f4c60aa5": "In total 31 compounds were obtained with submicromolar binding affinity",
        "2211.03208_48787fd0fcf6f082f8a59e95717bc2c4": "Three hits were optimized regarding their selectivity and their binding affinity and reached 250-fold selectivity relative to the",
        "2211.03208_e5882a5bd4cc94ef1702da1425f1fcf2": "$\\sigma 1$",
        "2211.03208_3387e2e42b368c871c954eda32ec19eb": "receptor",
        "2211.03208_2770f8b75f06c1099acca762051bf7fb": "Also in this study, it was observed experimentally that the true hit rate improves with the docking score, similar to the study of Lyu",
        "2211.03208_2575f3b0597f76cd9948f4224293440b": "Another GPCR, the 5-HT2A receptor, was targeted in an ultra-large virtual screen involving 75 million tetrahydropyridines",
        "2211.03208_fb0e94178bc37eb6e867fdd6500c800f": "\\cite{Kaplan2022}",
        "2211.03208_efd1106b4b7f17c71f853f1fdf478cb7": "Several compounds with low micromolar activity were discovered",
        "2211.03208_bc7fe9b8c8aaae197602b5cdc87c9fee": "Structure-based optimization led to compounds with half-maximal effective concentration values of up to 41 nanomolar",
        "2211.03208_a235e7c16ddd61f0e191b52bdb5e0d5a": "Cryo-electron microscopy structures of the ligand-protein complexes were obtained, confirming the predicted binding modes by the docking program (DOCK) that was used in this study.",
        "2211.03208_a4704fd35f0308287f2937ba3eccf5fe": "The",
        "2211.03208_b114d7bb7a7c41c31cdaad58b45fbdf6": "$\\alpha_{2A}$",
        "2211.03208_bec4fc16e4f2fa14a6e15a33188ca33e": "adrenergic receptor was used as the target in another ultra-large virtual screen in which 301 million compounds from the ZINC20 library were docked",
        "2211.03208_eba3521c043921de84939418622ed1e7": "\\cite{Fink2022}",
        "2211.03208_1e71e2473a3da64135c6326218ce34cd": "Compounds with up to 12 nanomolar binding affinities were obtained",
        "2211.03208_d7cddd52118cfb32147e2c2eddeb890f": "Also in this study, cryo-electron microscopy structures of the ligand bound to the protein confirmed the predicted binding modes of two compounds, and these structures served as the starting point for optimizing the compounds.",
        "2211.03208_5abddcf8536e1af209061302c85f7d8e": "Software and Automated Routines for ULVSs",
        "2211.03208_0afbf14bb71360ba7c9717385ba3b5a5": "To carry out ultra-large virtual screenings, a large number of docking procedures have to be carried out",
        "2211.03208_acfb8a5d05300acfa9012de36a04762f": "Most docking programs only support docking a single ligand at a time, therefore virtual screening platforms or automated procedures that deploy the docking programs in parallel are required",
        "2211.03208_c09b9d631ae76379e943b10989a412e3": "Here, we outline two of these approaches.",
        "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78": "VirtualFlow",
        "2211.03208_9933ddbfd9097d258de8437cb3dd0fa0": "VirtualFlow was the first drug discovery platform dedicated to ultra-large structure-based virtual screens",
        "2211.03208_85fcdbb23b6478bcc0b70d7911690d3e": "\\cite{Gorgulla2018,Gorgulla2020a}",
        "2211.03208_16b3af1d2f02ab353cdccff431fe0036": "It is freely available, open-source, and everyone is welcome to contribute to the project (",
        "2211.03208_c670da3212346056f3a67dc33af266e2": "The VirtualFlow platform consists of two modules, as well as ultra-large ligand libraries in a ready-to-dock format",
        "2211.03208_b6fca8f14049dd11d3ebe92a39bf6844": "The two modules of VirtualFlow are VFLP (VirtualFlow for Ligand Preparation), and VFVS (VirtualFlow for Virtual Screening)",
        "2211.03208_4805974743e1fba6b7725ff1224fda66": "An overview of the workflow of VirtualFlow is shown in Figure",
        "2211.03208_82cb7b71dac872e3bd3cb80ef50ab29b": "VFLP and VFVS can be run using large numbers of CPUs in parallel to achieve a high ligand throughput",
        "2211.03208_a260b6f5acd9ef030849a26aced6115c": "Both modules exhibit a perfectly linear scaling behavior with respect to the number of CPUs that are used, which was demonstrated with up to 160,000 CPUs",
        "2211.03208_7a503c60c2fe0ca3c53ae65db51837bf": "\\begin{figure}[h]\n    \\includegraphics[width=0.75\\paperwidth]{Figure_2.pdf}\n    \\caption{Overview of the VirtualFlow drug discovery platform. The first module of VirtualFlow, VFLP, can prepare large numbers of molecules from the SMILES format into a ready-to-dock format. The second module, VFVS, is able to carry out ultra-large structure-based virtual screens. Here, a variety of different docking programs can be used to dock the ligands to the target protein. The screen can be set up in a multistaged manner to improve accuracy while increasing the computation time only moderately. VFVS can also be used to optimize hit and lead compounds by searching the ultra-large ligand libraries for analogs, creating a custom analog library, and then screening this custom analog library again with VFVS.}\n    \\label{fig2}\n\\end{figure}",
        "2211.03208_6152eb3be89cba37917809b5e9c3fec3": "VFLP can generate ultra-large ligand libraries from the SMILES format into the ready-to-dock PDBQT format",
        "2211.03208_c2135345fd98ccba8db016b9e1d383ea": "The preparation procedure includes the calculation of the stereoisomers, tautomerization states, protonation states, and 3D coordinates of the molecules",
        "2211.03208_bac427453a99117084521e1b6f98b107": "One of the features of VFVS is that it supports a variety of external docking programs, such as AutoDock Vina",
        "2211.03208_f6fc15a1e89fea1808ba6bae4a959e20": "\\cite{Trott_2009}",
        "2211.03208_fdef354283c4be749fb36383c5b66a2e": ", Smina",
        "2211.03208_4e26576bb5ead1f3313d043a437c54bb": "\\cite{Koes2013}",
        "2211.03208_ca9847d0ac9de2c3e5fcfa38433f2d38": ", QuickVina 2",
        "2211.03208_d2ee827598166e763de1684b10e065bf": "\\cite{Alhossary2015a}",
        "2211.03208_cb91b34420e29ac65071d0b91abc6f18": ", QuickVina-W",
        "2211.03208_ad8749e4a7de5204849bf0d1ede87777": "\\cite{Hassan2017a}",
        "2211.03208_7b81f451258ddae6694de54ea279561c": ", Vina-Carb",
        "2211.03208_dee7a62b54a156cbab0fa2a181a071a3": "\\cite{Nivedha}",
        "2211.03208_6ef4caf0863b35864a7f9d736a89271f": ", or VinaXB",
        "2211.03208_55d4eea75ce0a09ee9192ac3d58aa1e5": "\\cite{Koebel2016}",
        "2211.03208_c0b61ee3b781eb6901e44e6161bdf0e9": "Later GWO Vina and PLANTS were added",
        "2211.03208_875f0bd36dc53010da1dc44c907cbed6": "\\cite{Gorgulla2020b,Gorgulla2021b}",
        "2211.03208_3d0e23e8fcdebece006a1c9861df5a32": "Most of these docking programs have special features, such as blind-docking capabilities (QuickVina-W), or enhanced accuracy for docking carbohydrates (Vina-Carb)",
        "2211.03208_5466e5e4bfc2c380a44a6d211e2d688f": "VirtualFlow was used for COVID-19 drug discovery, where approximately 40 different sites on COVID-19 related proteins were targeted, resulting in over 40 billion docking instances",
        "2211.03208_2aadcff329973d70c4ff59bf71d35975": "\\cite{Gorgulla2021a}",
        "2211.03208_91e7f2a1a1d6b09bfdcd6e30338d04fc": "VFVS can be used in a single or multi-staged manner, where more accurate docking scenarios are used in subsequent screening steps",
        "2211.03208_861220e4893dce6d4e20434afef7e021": "VFVS supports multiple ways in which the accuracy can be increased, including the increase of the conformation search by the docking programs, carrying out ensemble-dockings (to account for protein backbone flexibility), consensus dockings, or by including side-chain flexibility via the docking programs themselves.",
        "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7": "UCSF DOCK",
        "2211.03208_c20b3df516480ccaee28d88c55608ccc": "Several of the success stories listed above were carried out by using the program UCSF DOCK 3.7",
        "2211.03208_249be74d9f92c01d79b8a6c1f4a872e1": "\\cite{Coleman2013}",
        "2211.03208_1667b93ee87fecfdbd28cfd2a47516bf": "DOCK is a rich docking program that supports many advanced features, but was not initially designed for ultra-large virtual screenings, and therefore applying it to ultra-large ligand libraries can be more complicated than using a platform that is dedicated to ultra-large virtual screens",
        "2211.03208_e120c010c181db0befb657ee0618b63a": "A detailed protocol was published by the creators of DOCK on how one can use the program to carry out ultra-large virtual screens",
        "2211.03208_00255fd5105203eaf61b2a8486d9dc54": "\\cite{Bender2021}",
        "2211.03208_4897b5a600342a1bad767968a8893d37": "The protocol consists of over 100 steps, that not only include the virtual screening procedure, but also many other steps such as the preparation of the molecules as well as postprocessing steps.",
        "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa": "SYNTHON-BASED VIRTUAL SCREENINGS",
        "2211.03208_7f11746fa794c4d1c16a49729fd23d7a": "Some of the ligand libraries mentioned in this manuscript are available in enumerated form, meaning that each ligand is represented explicitly in a molecular file format such as PDBQT or SMILES",
        "2211.03208_dc2b8ad10150a9530298cd8a7f226f60": "An alternative representation for combinatorial libraries such, as the REAL Database, REAL Space, GalaXi Space, and CHEMriya, is to present the library implicitly via the initial fragments and the reactions that are used to combine these fragments into molecules",
        "2211.03208_2e340a8f6b907c443fc3a4f70301024e": "The fragments come along with information on how they can react with other fragments",
        "2211.03208_e02a402585e71afd566ac56e6a60aa95": "Those fragments together with their reactivity information are called",
        "2211.03208_3a212828233a6d067b1e01efed425cad": "The advantage of the synthon-based representation is that it requires dramatically less storage space than the enumerated representation mode, typically megabytes vs terabytes",
        "2211.03208_8f036d0d01a2580029fd34bbc45a39e7": "One disadvantage is that the molecules in the synthon representation are not in a ready-to-dock format.",
        "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f": "V-SYNTHES",
        "2211.03208_3511d94edf62913789738a089dc5570b": "V-SYNTHES is a virtual screening method that uses the synthon representation of the REAL Space from Enamine",
        "2211.03208_8b09a5178e20d56d2bf2633d6f520d45": "\\cite{Sadybekov2021}",
        "2211.03208_0f0e51caab917973d3b7a2a3fe28b3ab": "In their approach, they dock first all the fragments and then assemble complete molecules out of a subset of the fragments",
        "2211.03208_302b2d26895badc9db016790464ee6a5": "The selection is based on the docking scores of the fragments, and to ensure sufficient diversity several criteria are applied, such as that one reaction type cannot be part of more than 20",
        "2211.03208_27a71d00d0a68d10e7769b477a2c087c": "of the chosen synthons",
        "2211.03208_60f5c86aee2716c684d38a3c7cc346cc": "Finally, the assembled molecules are docked against the target receptor (see also Figure",
        "2211.03208_dc5f776090ff64d06eb8f17e66d023c9": "The primary advantage compared to ultra-large virtual screens is that only a few million compounds are typically docked in this approach, while still exploring an ultra-large ligand library",
        "2211.03208_e6e6ef5448ce217ed342ba420ed90cdb": "To demonstrate the V-SYNTHES approach, in their paper the authors applied the method to the cannabinoid receptors, which led to fourteen submicromolar ligands directly out of the screen",
        "2211.03208_820021d99672ab407d5ebd5c1e6fca11": "Virtual screening-based optimization of the initial hits led to compounds with improved binding affinity, the best compounds having a binding constant of 0.9 nanomolar, which is an excellent result.",
        "2211.03208_281fd4300a5600795252de91b7d67870": "DEEP LEARNING APPROACHES TO MOLECULAR DOCKING",
        "2211.03208_74409aeb07b2cdf8313dd377bbcebd0a": "Machine learning-based docking programs are one of the four types of docking programs, and they use a relatively large number of descriptors",
        "2211.03208_6a80144c07d55923578d66c6ce37c210": "Like empirical docking programs, machine learning-based docking programs need training on data",
        "2211.03208_58a3758f7c833f12be776765b4c60268": "\\cite{liu2015classification}",
        "2211.03208_c08b98ef29a248700973d4ee14771317": "Even though empirical scoring functions can be considered to be machine learning-based as well (e.g. because they often use multivariate linear regression), they use parameterized functions, whereas the term machine learning-based docking programs refer to nonparametric methods that can select the final functional form",
        "2211.03208_906daa44b0a305a36af184d1ef605517": "\\cite{ain2015machine}",
        "2211.03208_95600693372c284d62d04ff28cf09af4": "Machine learning-based docking programs have a much larger number of descriptors (variables) than empirical docking methods",
        "2211.03208_4ca1dafeb60eddc851c2c2307da8ccca": "The first machine learning methods for molecular docking appeared around 2004",
        "2211.03208_975b028ccec1e768ec2dec2e8e29a9af": "Deep learning is a subdivision of machine learning, and in the past few years, the first deep learning approaches have been developed for molecular docking",
        "2211.03208_b68b17b2c0fa4ec10243566a81788884": "One advantage of deep learning approaches is that they can be orders of magnitude faster compared to classical docking programs",
        "2211.03208_385795c05684f56f0502df74278e3540": "\\cite{Lu2022}",
        "2211.03208_dd1953d90c0bfeacb5ebe4f93bb62060": "High computational speeds become crucial when processing large ligand datasets, implying that deep learning methods can be particularly beneficial for screening ultra-large libraries",
        "2211.03208_db2d535fb400b3f5206dfd4d91f75abf": "Apart from considerations of speed, deep learning methods have the potential to become more accurate in the future in terms of their accuracy regarding the predicted binding affinity and the predicted docking pose than traditional docking programs",
        "2211.03208_dc4d878536121939bc30c7afe97f39ff": "In this section, we give an overview of deep learning approaches related to molecular docking",
        "2211.03208_a91a11b1bef5a2b8acda484c6708b783": "Docking programs predict the binding pose of a ligand to a protein, along with a score that characterizes the strength of the interaction",
        "2211.03208_64ea1878cb55de41ac559604dc481052": "Historically, deep learning-based scoring functions were developed first, while the first pose-prediction methods utilizing deep learning appeared only recently",
        "2211.03208_9f8ccac3a0a8d4ffd4436d5f1d7c5158": "Deep learning-based scoring functions are regression models that utilize known datasets of ligand-protein interaction pairs to predict the strength of an interaction by assigning a score",
        "2211.03208_305a5c8d500f4505108f345fea983724": "New deep learning-based docking programs that include both scoring and pose prediction are still very rare",
        "2211.03208_a8fc8c6ac8f008230cb6bd438e207f85": "However, deep learning-based scoring functions and pose prediction methods can be combined into a full docking program, due to their modularity",
        "2211.03208_faed7aad4a1656c7571d5e01bc478bf3": "Here, a deep learning-based scoring function can for instance be used to score the binding poses obtained by a deep learning-based pose-prediction method",
        "2211.03208_1bb45eadd372b6cc94b26128f67f9ac4": "Alternatively, a deep learning-based scoring function can be used in combination with existing docking programs to (re)rank the docking poses generated by the existing docking program by reevaluating the generated conformations by the new scoring function",
        "2211.03208_4a534097ae61ea5a0bb68d9111c3c7b5": "A third possibility is to combine the deep learning-based scoring functions with existing sampling methods, where the scoring function is used as the cost function that is minimized during the optimization procedure",
        "2211.03208_1fbf02e279e8d683cf5489b03009aabf": "The new docking methods can be used in ultra-large virtual screenings, e.g. with VirtualFlow, which already supports some of the new deep learning-based methods out of the box",
        "2211.03208_0ce3f788a8bd7353b43d8466a97371b0": "This can, in principle, lead to substantial speed-ups compared to the deployment of traditional docking programs in virtual screening campaigns.",
        "2211.03208_50a3f88bc727aa54bd7fd17951bb994e": "Scoring Functions",
        "2211.03208_d1330ad1905fc7bb9644df2179cdeea8": "A wide variety of deep learning-based scoring functions have been developed in the past several years",
        "2211.03208_ab0e79cd0d628b06ffc546d34566e4cd": "Here in this section, we look at pure scoring functions that were published without a sampling algorithm",
        "2211.03208_1cffa750b4383837ab4afbac0b61c3fe": "To our knowledge, historically one of the first such methods was NNScore 2.0",
        "2211.03208_b0b32dfb65e7664c73c7814fe8a73a0f": "\\cite{NNScore2}",
        "2211.03208_eb1b25bb945e8c56950db3ff9393b236": "Later, a large number of other deep learning-based scoring functions have been developed",
        "2211.03208_370ff2dc6d1ec16afbd9f4a987bbe90f": "Among them are Pafnucy",
        "2211.03208_bbb25a9a93197af71f6bc07ec7501c4e": "\\cite{Pafnucy}",
        "2211.03208_92a91e565c3a07ca7078e09a55cc6254": ", DeepAffinity",
        "2211.03208_a8273800b9eae144de2e33bfa7ead764": "\\cite{DeepAffinity}",
        "2211.03208_b21f5f68d3ca56339e6d5c570fcea775": ", DeepBindRG",
        "2211.03208_b346cd5dbc9817749b98dfed122f4d71": "\\cite{DeepBindRG}",
        "2211.03208_0bf9abf29e9314c734b8c1fa62f56c11": ", OnionNet",
        "2211.03208_f1291a96254b4cb0e11704ca1e42ea70": "\\cite{OnionNet}",
        "2211.03208_dbc8e2a285d5d7e7c79998a86c289030": ", PotentialNet",
        "2211.03208_597ad78c9db087d31154f5749ec8b507": "\\cite{PotentialNet}",
        "2211.03208_f329c7970e5e9d3b61a60c0984ae903e": ", K",
        "2211.03208_41e2217516ed51872c9119e9f9c94965": "\\cite{KDEEP}",
        "2211.03208_beb03d7aec704b818c725d7af5c73af0": ", DeepAtom",
        "2211.03208_c59f1a0082b0327d123ba07f2fac96da": "\\cite{DeepAtom}",
        "2211.03208_4b8e4be5060674cae1d20ee57e318ce0": ", TopologyNet",
        "2211.03208_ada2580220e508894e25eaa462599838": "\\cite{TopologyNet}",
        "2211.03208_cc8e1531f448a387f033a26df9ca2dcd": ", and Math-DL",
        "2211.03208_346907cbd8696452406cb88780d15ab9": "\\cite{MathDL}",
        "2211.03208_3417762efa9a0dfba807c0d5b4f54288": ", Erdas-Cicek2019",
        "2211.03208_844331cf089b71748bf8ca7d854e1fba": "\\cite{erdas2019three}",
        "2211.03208_1e22e8820bea02d0c0078058dc47a652": ", Cang2018",
        "2211.03208_a52420191c75a7361504ec3455ae802d": "\\cite{cang2018representability}",
        "2211.03208_ec897ddeb24d82993e6c3c9d84269408": ", Atomic CNN",
        "2211.03208_39f43f1cd20d0be58fbb00d5166c85d2": "\\cite{AtomicCNN}",
        "2211.03208_b815283492307d0cfb7843f10e9ff8d0": ", Francoeur2020",
        "2211.03208_ed88b971de5407c3b1f049ddf98df007": "\\cite{francoeur2020three}",
        "2211.03208_7fd86b6257497f056ccf711c24bcb921": ", and Zhu2020",
        "2211.03208_f3fd0b0c8c65e95c6d08179b73d29f27": "\\cite{zhu2020binding}",
        "2211.03208_b941251dc228af224a9e67de3e6463b7": "Here, as well as in the next paragraph, the name of the first author followed by the publication year was used as the name for the method in case no proper name was provided by the authors",
        "2211.03208_56449cd2af03e8e2426f9aaff98f869b": "For reviews on scoring functions, as well as for binding classification functions for protein-ligand binding see also",
        "2211.03208_aa1a042f2b9596a64b6de6fa43fd6c54": "\\cite{Kimber2021,Li2021,Du2022,Crampon2022}",
        "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5": "Binding Classification Functions",
        "2211.03208_b9f902030148ce4162d5c883d1b17dd0": "Closely related to scoring functions are functions that try to distinguish ligands between binders and non-binders for a specific target, which is a classification rather than a regression task",
        "2211.03208_a89425ad1d7705061151ed9aa55f045f": "We refer to this task in this review as binding classification",
        "2211.03208_a5b4ea11d945ae9b0ae75dfe03dcf5f6": "Binding classification is also referred to as",
        "2211.03208_d37923487b214600faf947a66073879c": "by some authors because classification functions are particularly useful in virtual screenings",
        "2211.03208_1996183f86ab7604d7b40091f6cb7053": "\\cite{Crampon2022}",
        "2211.03208_f703e5120093aba2746d78c12ec90820": "Several different classification methods based on deep learning have been developed, such as NNscore",
        "2211.03208_d93b84cd06f4def97ffbf1229e71610d": "\\cite{NNScore}",
        "2211.03208_971bde4d5545d5d2ec6a256b98a9c1e5": ", AtomNet",
        "2211.03208_e266f3b7ec44d915f63e44f3fdce05dd": "\\cite{AtomNet}",
        "2211.03208_fffae448c6a650e5e19fc4c851597edc": ", DeepVS",
        "2211.03208_a406424ec12f7eab4c0ea453702345a3": "\\cite{DeepVS}",
        "2211.03208_528e07e94caa8c9f67ecc24bf51cf487": ", Ragoza2017",
        "2211.03208_ae58cbf2d44f8d6c501ae083259a7f94": "\\cite{Ragoza2017}",
        "2211.03208_b7c594e9333a10d1445aad868966740a": ", DenseFS",
        "2211.03208_20add7ff038bda97f7e85bcbe25f49ec": "\\cite{DenseFS}",
        "2211.03208_56cba769fe7c58e61c78b4b1b9cbf845": ", Lim2019",
        "2211.03208_ab0e8f2dc2e002d593949ed5559ce7df": "\\cite{Lim2019}",
        "2211.03208_0009c8d624d6af685c51cd890ae68167": ", Torgn2019",
        "2211.03208_d7db27c678ec75ad62f46077565aeb86": "\\cite{Torng2019}",
        "2211.03208_0acd22c86297ad8396cfaa1e943bd815": ", Tanebe2019",
        "2211.03208_cab92036a75c118f32feb84d80159774": "\\cite{tanebe2019end}",
        "2211.03208_2d9355a87d6fb599cbaec3d5e8a22dca": ", Tsubaki2019",
        "2211.03208_51f8a19153c29c48e072d25371710d9f": "\\cite{tsubaki2019compound}",
        "2211.03208_4a46151b183605ce395c49efe0e7c0ac": ", Morrone2020",
        "2211.03208_2b8a6df580922bd98109cbe779a67a50": "\\cite{Morrone2020}",
        "2211.03208_ef6f3c90fd49f5481a7fa1ef7d80c402": ", Sato2010",
        "2211.03208_06470e62582a0a158162818bf06c1d46": "\\cite{sato2010combining}",
        "2211.03208_4a23620617fd478794bc16f05ef15ee3": ", Li2019",
        "2211.03208_649eaf8f617c494314d35231ec15dc44": "\\cite{li2019deep}",
        "2211.03208_dc9b9849e5c1ebc920da7c7539070ca6": ", Sato2019",
        "2211.03208_719169532eed5df2834f41400b5d31b4": "\\cite{sato2019significance}",
        "2211.03208_308b48fef9f366f90c53daafec315563": ", BindScope",
        "2211.03208_7313d87fe50b2fe9b38570d3d8fd55f1": "\\cite{BindScope}",
        "2211.03208_7a9f678d931fa7c1e4446e99ce0edfb3": ", and Lim2019",
        "2211.03208_53cb0c2628d0a1c61ad17f6831d190ac": "\\cite{lim2019predicting}",
        "2211.03208_6dcca016d942682fb8db296218e8da7c": "Binding Pose Prediction",
        "2211.03208_bd750c7786f1bffa961d08ed950e5a9d": "The major reason why classical molecular docking methods are relatively slow is that they typically sample large numbers of ligand-protein conformations, and assign each of them a score",
        "2211.03208_4d567c4413465d19f3abee992988b44f": "Deep learning methods for pose-prediction can eliminate the sampling step by directly predicting the conformation of the ligand-receptor complex",
        "2211.03208_e75ccd9f66c414c5cacfca78fd78ca52": "The first pose prediction method based on deep learning might have been PoseNetDiMa",
        "2211.03208_be1e5a5224359949235adedf591a588b": "\\cite{PoseNetDiMa}",
        "2211.03208_f842c9b3cb39f361987430c1048909ee": ", which uses a graph-convolution neural network and allows for flexible protein-ligand docking, where the residues at the binding site are allowed to be flexible",
        "2211.03208_45012ff8b1a29f62caf25142aaebcfe4": "Another method from the same group that uses intermolecular Euclidean distance matrices (EDMs) was reported in",
        "2211.03208_adf2403e02555152f56f361da0e0a0be": "\\cite{masters2022deep}",
        "2211.03208_b8f1e270b10ee38b4df4ac95a6cf32af": "Both methods are for local dockings (rather than blind dockings)",
        "2211.03208_cc235e808cdbff7f106a358b74a90cca": "The software of both methods is not available for download at the time of writing, but the software of the second paper will become available after publication in a peer-reviewed journal (M. A. Lill, personal communication, October 31st 2022)",
        "2211.03208_a06d8b602582c193def980228db5f67a": "DeepDock is another pioneering pose prediction model, which is based on geometric deep learning",
        "2211.03208_b11bf6e7ca767d0751ea30f90f6842a9": "\\cite{DeepDock}",
        "2211.03208_5cc533e4c1c91ea62c7ff4eb7ef5b819": "However, it is rather slow according to",
        "2211.03208_892de7dd6352670f10360811ae9dbed2": "\\cite{Equibind}",
        "2211.03208_97dc7eef1837b15c97efa1fd5d37cddb": "EquiBind is another geometric and graph-based deep learning model, which is extremely fast with a fraction of a second per ligand using a 16-core CPU or a GPU",
        "2211.03208_8308b5a376391e502fbd1fcb8f8e6ddd": "Both DeepDock and EquiBind are freely available",
        "2211.03208_1f2c3b99d5df7cd8b713c6017db2f790": "TANKBind has tried to improve upon the results of EquiBind",
        "2211.03208_2665d5c05f7691338f8c0929cb2791f0": "\\cite{TANKBind}",
        "2211.03208_8eef9215071793a019f50826b672451f": "TANKBind improves on the accuracy of EquiBind by using trigonometric constraints in the model, and by dividing the protein into multiple regions",
        "2211.03208_a9b6bcc386dcc2607d7a299b05e371c9": "Both EquiBind and TANKBind are substantially faster than traditional docking programs",
        "2211.03208_c7b5e2dbdea4b4f90a695e2c0b99c07d": "DiffDock, which is a diffusion generative model, was developed by the same research group as EquiBind, and their results indicate that it can be more accurate than any of the two previously mentioned blind docking methods",
        "2211.03208_c751b4ca66cb2ec9cd71761478f39150": "\\cite{DiffDock}",
        "2211.03208_baf3e47dd5d53c13f541d6a06b14b498": "On the other hand it is considerably slower than EquiBind or TANKBind, however, it is still faster than most traditional docking programs",
        "2211.03208_76d3475362eb9e950c8d516e2624b695": "Most of the above pose prediction methods carry out blind pose prediction, meaning that the entire protein surface is considered as potential binding area, rather than a restricted binding site.",
        "2211.03208_853fdeb1039f76abcdc82def0c68ffbd": "Full Dockings",
        "2211.03208_be7c3bb77c8fc071c2f598571885ec9a": "Complete docking programs using deep learning, meaning for both pose prediction as well as scoring, are still very rare as most approaches so far use deep learning either on pose prediction or on scoring",
        "2211.03208_d545fb9a5855f8a4e8264aeb5244c31a": "GNINA",
        "2211.03208_14de283550cd07da1158befeb21cc867": "\\cite{Gnina_17,ragoza2017ligand,hochuli2018visualizing,sunseri2021virtual,sunseri2019convolutional,mcnutt2021gnina}",
        "2211.03208_60cddaae594ce744bd6a0b4d839e8685": ", is a fork SMINA",
        "2211.03208_10560136aa9a6e383a69e7fe9aa0b5ab": ", and SMINA itself is a fork of AutoDock Vina",
        "2211.03208_94e3f09636fc091643916aab66ad6c74": "GNINA was one of the first full docking programs using deep learning",
        "2211.03208_51e712e04b64eacf5c14e741fe804665": "It uses convolutional neural networks (CNNs) for the scoring function and uses a traditional sampling algorithm to explore the conformational space",
        "2211.03208_5e1433445191b8433325390ecd47fa6d": "Another docking program that is conceptually similar to GNINA in that it uses CNNs in combination with traditional search algorithms is MedusaDock",
        "2211.03208_20cc1773e87063190392bdea3d9866dd": "\\cite{MedusaDock}",
        "2211.03208_0f909cc5aef9013569d0051fae06981c": "in combination with MedusaNet",
        "2211.03208_72e5fa8d09c1d3babe67a15d7c4f2bef": "\\cite{MedusaNet}",
        "2211.03208_a13272e87713d5285edb797ed4545959": "MedusaNet is a CNN-based scoring function, and MedusaDock provides the sampling algorithm",
        "2211.03208_dcb0749f7df540ccd468ab19cc0e53bc": "MedusaGraph is another docking method of the same research group, which is based on graph neural networks",
        "2211.03208_bf56d9684440f026c1cc3f047e22243f": "\\cite{MedusaGraph}",
        "2211.03208_789aad00dbec6b471341cb6d7770b74f": "In contrast to MedusaDock-MedusaNet, it can directly predict the docking pose without extensive sampling using traditional methods",
        "2211.03208_78016e5da1f6a97d2ac4d4de9bb79d74": "MedusaGraph is 10-100 times faster than traditional docking programs",
        "2211.03208_37f3918a733cfc552fa2ac8c8852b492": "However, it requires an initial docking pose, which can be generated for instance with MedusaDock, which subsequently reduces the aforementioned speedup",
        "2211.03208_dc2cbaf020311f980bd4dcf7de7463fb": "MedusaGraph uses the scoring function MedusaScore which is part of MedusaDock",
        "2211.03208_1471fca951442d19b2c05243f664609d": "MedusaNet and MedusaGraph are freely available",
        "2211.03208_8ad0d4fe4c6c63a387c9455a1ea763fd": "TANKBind, which was mentioned in the previous subsection, is a full docking program as well",
        "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393": "MACHINE LEARNING APPROACHES TO VIRTUAL SCREENINGS",
        "2211.03208_ecd88a46da313ed0f32828fc6d207e79": "Deep learning-based docking programs are one way to use deep learning in structure-based virtual screenings to reduce computational costs and potentially improve the accuracy of the dockings",
        "2211.03208_508dd18d17fa4cc3776b9c0ef6be7f65": "Another way to use deep learning, and more generally machine learning in virtual screenings is to apply it on the screening level rather than only on the docking level",
        "2211.03208_78f3bcb335958df63bacd6cfb71ded0f": "Here, ligand-based machine learning models are usually trained by carrying out molecular docking on a small subset of compounds from the entire ultra-large ligand library",
        "2211.03208_fbc0ebe21aaecb78201f729d520466a6": "This elegant combination of LBVSs and SBVSs in ML-LB-ULVS can reduce computational costs dramatically",
        "2211.03208_b7917f6f2aa80c382ae280e943c28b02": "Subsequently, the entire library is screened with the trained ligand-based ML model (see also Figure",
        "2211.03208_6bfcb98e20518ec06aa4d1d686d0f16e": "We outline several of these deep learning approaches below, which focus on ultra-large structure-based libraries.",
        "2211.03208_589edc4b355de0cbe4240822e16d015e": "Deep Docking",
        "2211.03208_514c4343a93182c9cb57ba818cc96ccd": "Deep Docking was one of the first deep learning approaches for ultra-large virtual screenings",
        "2211.03208_3b5465e96896638bf8c76839c1c8892e": "\\cite{DeepDocking}",
        "2211.03208_7c1f265ae72eb811decc4493454d5c72": "Here, a small number of molecules (typically around 1",
        "2211.03208_b0351dd033e3fccf916d8be296e057d4": "of the entire library) is docked, and then a quantitative structure-activity relationship (QSAR)-based deep learning model is trained on them in an iterative fashion",
        "2211.03208_f2e34baa149e9e22567e4594d6304150": "The majority of the ligand library is then screened using the fast QSAR model, resulting in a speed-up of around 100 compared to the docking of the entire library",
        "2211.03208_6b465b3a4226a60cbca2ff823793ce85": "The authors have applied their method by screening over one billion compounds against twelve drug targets",
        "2211.03208_b4737cbd4b83315263429c7c7c1babd5": "In a separate paper, the authors applied Deep Docking to SARS-CoV-2 drug discovery, where they targeted the protein M",
        "2211.03208_9664b61c821afe5f4afa6140dd3d6e03": "with approximately 40 billion molecules",
        "2211.03208_615c039889548f421a9e0c52293130c3": "\\cite{DeepDockingCovid}",
        "2211.03208_51e484dd05308dc792948640fc9ab47f": "The code of Deep Docking is freely available, and a detailed protocol of the method is discussed in",
        "2211.03208_5236699913fff060d78945b47715a48e": "\\cite{DeepDockingProtocol}",
        "2211.03208_ec6c15de7b71eeb362034952517340fb": "Active Learning Workflow with AutoQSAR/DeepChem (AQ/DC)",
        "2211.03208_30dab85faba16483c15f640f33963037": "Similar to the Deep Docking approach, in the AutoQSAR/DeepChem (AQ/DC) approach, a relatively small number of ligands of the library is used for training a deep learning QSAR model in addition to molecular fingerprints",
        "2211.03208_6f52f6905917258ed076081d9ed3ed01": "\\cite{AQDC}",
        "2211.03208_48daf25b3f12eae48e0926ebf0ee1306": "The QSAR model uses graph-convolutional neural networks via the DeepChem package",
        "2211.03208_2793a0d297d63bedc7618bb889f178aa": "Optionally active learning can be used to refine the model during the workflow",
        "2211.03208_bd7a7c666a3e6848cfc26410a36e796e": "Around 5",
        "2211.03208_b737d20cd88934b119ca73f8c4ea7ee0": "of the top hits are then docked with regular docking programs, resulting in an overall speedup of around 15-20 compared to the standard ultra-large virtual screenings",
        "2211.03208_1efb0a93a575c6afc1146bcfb5f681b1": "In the same paper, the authors applied their new method to the target proteins AmpC and the D4 dopamine receptor, which they had targeted previously with standard ultra-large virtual screens",
        "2211.03208_03bcc691cba0e7bcec5e4914d032dbea": "\\cite{AQDC,Lyu2019}",
        "2211.03208_ae97b9b18d4a63656b1457023bac4bdf": "This resulted in a recovery of approximately 80",
        "2211.03208_0b66997e14c41ecc998efd9f716efc7a": "of the previously experimentally confirmed hit compounds.",
        "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2": "MolPAL",
        "2211.03208_2c94f831ea0c35ba988b0162a5dd59b0": "Another deep learning-based approach is MolPAL",
        "2211.03208_3b188d07765950a2f1c55314987ff4a6": "\\cite{MolPal}",
        "2211.03208_67cbf331209cd6459b16d9c3ec8de36d": ", which stands for",
        "2211.03208_b162d5cab664609de9a2b3188ffd328d": "MolPAL uses Bayesian optimization as well as molecular fingerprints and was tested with surrogate models based on random forest, feedforward neural networks, and directed-message passing neural networks",
        "2211.03208_f4f6c6a259331e05738304ed2df80ae2": "Only a small fraction of molecules is docked (around 2.5",
        "2211.03208_c80577c5595a9317f303d84cb81ea450": "), i.e. ones more likely to be scored favorably, resulting in a speedup of approximately 40",
        "2211.03208_90c48423dfb16e41c2221204718727dc": "In their study, roughly 90-95",
        "2211.03208_949600201c2ac41ca027f77015a08d43": "of the top 50,000 hits in a virtual screening of around 100 million compounds are recovered",
        "2211.03208_e45db4aa4dd1e343d588a09d5126dc45": "MolPAL is freely available and open-source.",
        "2211.03208_cbe9223e7bc275ad1b27cfe49be87895": "HARDWARE ACCELERATION OF MOLECULAR DOCKINGS WITH GPUS",
        "2211.03208_676c6ff17130136f7fb1fe998602a50b": "Virtual screenings, in particular at the ultra-large scale, typically require a large amount of computation time",
        "2211.03208_573626c32ded86e199ceae478ab534ca": "Therefore, often computer clusters or the cloud are needed to carry them out",
        "2211.03208_b5e10772482e029d596f16498cb73b9a": "Almost all traditional docking programs run on CPUs, and typically require seconds to minutes per ligand",
        "2211.03208_a77253443e70df22f0cf6815f7d17eb4": "In the previous sections, we have seen multiple ways on how the runtime can be reduced, by effectively reducing the number of traditional dockings required via the synthon-based approaches, by combining ligand-based virtual screens with structure-based screens to give rise to ML-LB-ULVSs, or by using deep learning-based docking methods",
        "2211.03208_b46868311e3ad9f8639b95e08fdedf6e": "Another approach, which can be used in combination with the above approaches, is to use graphics processing units (GPUs) instead of CPUs",
        "2211.03208_c22316c49c8c1f6882fe499f7caecf83": "GPUs can have up to 10-100 times better price/performance ratio than CPUs",
        "2211.03208_ef147d8f525ca85abb9cfaa37f09527d": "Docking programs for GPUs have appeared only in the past few years",
        "2211.03208_3f60cc817351c9072338f207d43217a9": "Some of them try to port traditional docking programs to GPUs, such as AutoDock-GPU",
        "2211.03208_dab4271f1a075bff3fbfced72b7d9734": "\\cite{santos2021accelerating}",
        "2211.03208_a93701c3733f70819b1c4ab54cf19186": ", Vina-GPU",
        "2211.03208_0ffd29bf9ae09ff42bde06d264b822b0": "\\cite{VinaGPU}",
        "2211.03208_432f21864119ca9f0c9091909bca5e6b": ", Uni-Dock",
        "2211.03208_175ffd2c07add3637451d94093f516a3": "\\cite{UniDock}",
        "2211.03208_e7c29e2b4e3d21c86f8dde6a542c1947": ", and MedusaDock GPU",
        "2211.03208_4afdc89216cee101c8fccf5adc18320a": "\\cite{MedusaDockGPU}",
        "2211.03208_8ccc1e689520df9e85198ea2bbfedde4": ", while others are new docking programs tailored for GPUs (e.g",
        "2211.03208_5339d76287bb91f5d14c002e13631276": "Accelerated CDOCKER",
        "2211.03208_90d36e2cba199fd74e9a4ab58b4b8751": "\\cite{CDOCKERGPU}",
        "2211.03208_43d6db381b39db2edc80d8f75c9c1761": "In addition, most of the deep learning-based docking programs that were discussed above run on CPUs and GPUs, e.g",
        "2211.03208_a4ac157de5706923ea2cc9efe60d0aa1": "\\cite{mcnutt2021gnina}",
        "2211.03208_4fbfc6969533e6a2b76f7249f12fc53a": ", MedusaDock-MedusaNet",
        "2211.03208_3d61bf21573c0d25ea17ed5ffc14a91d": ", MedusaGraph",
        "2211.03208_a41f39998616abaa873e8a382a9477c6": ", and TANKBind",
        "2211.03208_c000d869ee468e2a6547c4886cd17f6c": "AutoDock-GPU",
        "2211.03208_abcda23b0642790dd973741b8864245e": "is the GPU version of the well-known docking program AutoDock 4",
        "2211.03208_076ff15334130d82b83fb110a99ea803": "\\cite{AutoDock4}",
        "2211.03208_99282f8a8a9bd0485dcadc705cafc409": "AutoDock-GPU is available both as OpenCL as well as CUDA version and can run on CPU, GPU, and FPGA architectures",
        "2211.03208_5e5f9fcba9d654b120ba94c9a4b1341d": "\\cite{AutoDockGPU_FPGA,AUTODOCKGPUOPENCL}",
        "2211.03208_ae4babef334c1e27bf3942e7c6622269": "Compared to the single-threaded CPU version, the speedup is up to a factor of around 350 when using GPUs",
        "2211.03208_43ea1c3820c8376d442f54bf21e8c12f": "However, since AutoDock 4 was very slow in general, the GPU-accelerated version is roughly as fast as more modern CPU-based docking programs",
        "2211.03208_a44812a5d91f68c1c4b2a8eb3718867e": "The authors applied the new software to multiple case studies, including the docking of approximately 1 billion molecules for COVID-19 drug discovery in less than 24 hours on the Summit supercomputer.",
        "2211.03208_a1434e0ba91da6a98ee997a7f271a222": "AutoDock Vina",
        "2211.03208_de2d1b73398af2e588f3b91595340328": "is the most cited docking program of all time, with over 20,000 citations at the time of writing",
        "2211.03208_e72e279c066011e359c510ee783f7c17": "In addition, several benchmark studies show that it is among the most accurate docking programs",
        "2211.03208_c7f7bf44c0bf8019d20848be4b9c4576": "A GPU version of AutoDock Vina is therefore of great interest",
        "2211.03208_37b2b4c6b7228e4b390a046b3540228f": "One attempt was the software Viking, however, no speedup has been reported",
        "2211.03208_13bd459092bb4e95fb631e10bfff3035": "The first successful GPU version of AutoDock Vina with a significant speedup, Vina-GPU, was published in 2022",
        "2211.03208_5bf5884f3b46f8b3cbd63e697190d4cb": "It makes minor modifications to the algorithm of AutoDock Vina, but the final docking scores are almost identical",
        "2211.03208_f7bbe887a893febac44beab0b9847aef": "Vina-GPU exhibited a speedup between 21 and 50 when using an NVIDIA RTX-3090 compared to AutoDock Vina running on a 10-core Intel",
        "2211.03208_83168e6cb289d732cc78427b51f93153": "Core",
        "2211.03208_3e2b6f8bc11ac54910c9796467a26bd8": "i9-10900K CPU at 3.7 GHz.",
        "2211.03208_58920549509ec286fb1c0c592f807721": "Another software building on AutoDock Vina is Uni-Dock",
        "2211.03208_5974daf9cc9e721a983154ce0a3b3dc4": "In contrast to Vina-GPU, it builds on AutoDock Vina 1.2",
        "2211.03208_4dd1d6d5a1f17c36441defe505e90bd7": "\\cite{Vina1_2}",
        "2211.03208_95902faf2f966f8ca1acb4ab714775f3": ", while Vina-GPU is based on the original AutoDock Vina",
        "2211.03208_94ee90c84479bd64738b18ffbed83f9a": "Uni-Dock claims to have greater acceleration than Vina-GPU, and it also supports multiple scoring functions: Vina, Vinardo, and the AutoDock 4 scoring functions",
        "2211.03208_a1f4b8bedcd38930caad59eeb0988688": "Uni-Dock achieves a speedup of over 1000 when running on an NVIDIA V100 32G GPU compared to AutoDock Vina using a single core of an Intel",
        "2211.03208_8d39701929aff82fef86f94a11a2c78f": "Xeon",
        "2211.03208_f2442a67aca6787e6f480fa68bc448c6": "Platinum 8269CY (Cascade Lake) CPU running at 2.5 GHz",
        "2211.03208_38662a8c33c821a3cf847af94561df62": "Uni-Dock is not freely available and executable, but available via a webserver (",
        "2211.03208_be6e44cf9f961d27e982cafe7600efa4": "MedusaDock GPU",
        "2211.03208_eee9c85a0fd96eeba841add8dbd660c4": "is a GPU-enabled version of MedusaDock",
        "2211.03208_896d747ab5d9b118a486c37829f5b26d": "The speedups observed are moderate, in the lower single-digit range, when comparing MedusaDock running on a single core of an Intel",
        "2211.03208_83085cf4cbc7cfbc3fa751f4ae9f8e27": "E5-2680 v4 (Broadwell) and MedusaDock GPU running on an NVIDIA TESLA P100 GPU.",
        "2211.03208_8f4b9db57c4aa5151a4e107e58683e76": "CDOCKER (short for",
        "2211.03208_30f28ee8bdddfa525d56b5b02da2858e": ") and flexible CDOCKER are docking methods that are part of the CHARMM package",
        "2211.03208_6b6e3132f3655f2f69c7da401cce2044": "\\cite{CDOCKER,CDOCKER_FLEX}",
        "2211.03208_b8fda62ce0dadeefbd3e60f53160400c": "Accelerated CDOCKER is a GPU-accelerated version of the CDOCKER and flexible CDOCKER methods",
        "2211.03208_078152b0a1a6380e8e9e5684a307cace": "It uses the fast Fourier transform as a key algorithm for the GPU acceleration and achieves an impressive speedup of approximately 15,000 when using an NVIDIA GeForce GTX 1080 vs the original CDOCKER running on an Intel",
        "2211.03208_097ad6634a4bf73e2311d2ce2dd424e6": "Processor E5645 at 2.4 GHz",
        "2211.03208_ae0d8d11266958cccc69b5edf6375078": "CDOCKER also includes a parallel MD-based simulated annealing method that can run on GPUs in parallel, with an observed speedup of approximately 20.",
        "2211.03208_d86f031549ee5b6a2b6eb6bf10537816": "Most of the deep learning-based docking programs can use GPUs since deep learning models can usually be run on GPUs for their evaluation",
        "2211.03208_967d2ffe13275437c1be320148eb69d0": "Among them are GNINA, MedusaDock-MedusaNet, MedusaGraph, and TANKBind",
        "2211.03208_ef59a766a69c8e3828e7bc4b7c86b65a": "In addition, most of the pure scoring functions, classification functions and pose prediction methods based on deep learning can be run on GPUs",
        "2211.03208_c26e6b5ba81daebd29d2289187ef9750": "However, they would need to be implemented as full docking methods to be useful for most virtual screening campaigns.",
        "2211.03208_87e874c9b18a9195da2fc86d6185544c": "HIGH-THROUGHPUT FREE ENERGY SIMULATIONS",
        "2211.03208_23ecc17605becb65e0bc68124dbee1a8": "So far in this review, we have seen several examples of how multiple virtual screening stages can be used to save computation time, e.g. by using a very fast virtual screen (such as ML-LB-ULVSs or deep learning based docking methods in standard ULVS) of the entire library as the first stage",
        "2211.03208_06291815a397fa2f00d610c7a6a904e3": "Such virtual screens are generally less accurate than full molecular dockings",
        "2211.03208_1875e861bab97b2a355e535a847552c6": "Staging can also be used in the opposite direction, to increase the accuracy compared to molecular dockings",
        "2211.03208_e7d0666a9a2764075aa50cfd0db3043a": "Here, free energy simulations based on molecular dynamics (MD) simulations can be used to improve the accuracy of the binding affinity estimates for the best compounds of the previous stage",
        "2211.03208_61748e109f4b38997a49b54544193e18": "Free energy simulations are in theory exact (relative to the force field used), provided that the free energy converges (for that the simulations need to run long enough)",
        "2211.03208_9d64ddf56bbdd74b00f67789d7c844b1": "They take into account the full dynamics of the molecular system, can treat all solvent molecules explicitly, and include all enthalpic and entropic components of the free energy",
        "2211.03208_522b29d88c0a3f3e8364d88b85482166": "When applied to a larger number of systems in an automated way, free energy simulations are also referred to as high-throughput free energy simulations (HTFESs)",
        "2211.03208_cedabd3ed5ca65d8ccce356a2d72fbe7": "In addition, quantum mechanics/molecular mechanics (QM/MM) methods can be used to treat the parts of the system (typically the ligand, the binding site of the protein, and possibly some solvent molecules at the binding site) with higher accuracy",
        "2211.03208_792199f569f8fbb1f210bdc157062116": "This can for example be beneficial if metals are located at the binding site of the protein or part of the ligand",
        "2211.03208_806d0c2be206f8ce65c7e3012bcc378b": "Hardware acceleration, in particular the usage of GPUs, is key regarding HTFESs",
        "2211.03208_7e2da2a008b5036f752d75c6c881f3bf": "Multiple molecular dynamics software packages have been optimized for GPUs in the past 15 years, such as GROMACS",
        "2211.03208_a5ad7c3492a323cdecf170950c96d03a": "\\cite{abraham2015gromacs}",
        "2211.03208_f5f9e1bea1c6177ce333798c2ffd3705": ", AMBER",
        "2211.03208_68d8c25676505cae480dea220b245739": "\\cite{Amber2022}",
        "2211.03208_7c8e07f39e2efc413b44e7923e537650": ", CHARMM",
        "2211.03208_b15f4f5b69d132376375c7b4ee954d17": "\\cite{brooks2009charmm}",
        "2211.03208_129ab03605c12970397beb5b43021f26": ", and NAMD",
        "2211.03208_5a60d1604e25794d8725b98a6767c932": "\\cite{NAMD}",
        "2211.03208_c1c881a451bb759c33ec2ebdbbeacb77": ", which greatly enhances their simulation speed",
        "2211.03208_5f62d50335475208e2cf4db4480d1b54": "In principle, these MD simulation packages can be directly used to carry out free energy simulations of protein-ligand systems",
        "2211.03208_722929c26d6115e90219f55810d73ae8": "However, applying them to a large number of ligands will likely require custom scripting to automate certain processes",
        "2211.03208_e1630f71020ff47f411282de7330ea0f": "In the past few years, several high-throughput MD and free energy simulation methods have been developed, which automate many processes and allow to handle large numbers of protein-ligand systems.",
        "2211.03208_9d143e455825a0bbe2a2d304465166cd": "One of the first packages dedicated to high-throughput molecular dynamics was HTMD",
        "2211.03208_735213bcbe3e76c33607de7ea41f1c92": "\\cite{doerr2016htmd}",
        "2211.03208_1c52977a951e789ea89ed6479158c004": "It supports a large number of different tasks and features, such as molecular dynamics, Markov state modeling, clustering, free energy calculations, and projection methods, adaptive sampling, and can run in the cloud",
        "2211.03208_04899d15cd37154fb21735a6bf42c47d": "The package has been extended to also allow simulation of membrane proteins in an automated way, and it is freely available for academic groups",
        "2211.03208_ecdfb09af2f2fb1a24bdf23e1f6cf1dd": "\\cite{HTMD_membrane}",
        "2211.03208_718820f80416e93bf6dccd334858273a": "A package that is dedicated to high-throughput MD simulations that support free energy calculations is BRIDGE (Biomolecular Reaction and Interaction Dynamics Global)",
        "2211.03208_f4d8b3aa09196b954b9b458980eae630": "\\cite{senapathi2020bridge}",
        "2211.03208_8a2aeb0a94e355cc6c6b9ea49d6d890a": "It is an open-source web platform and built on top of the Galaxy platform",
        "2211.03208_9f9dcbee06f84fcf50729370baa30f6c": "BRIDGE supports absolute and relative binding free energy simulations",
        "2211.03208_9d6eb4a91ef38534e0469e59c91e0fbd": "It also allows to easily share obtained simulation data and supports independent verification of the data by external people, which can for instance be useful for other scientists or during the peer review process.",
        "2211.03208_7cc5f67f58ee7f9b1bdbe3cb17b3d6c4": "Traditionally, classical force fields such as AMBER and CHARMM have mostly been used in MD simulations and thus free energy simulations",
        "2211.03208_5e2e1879b64f8f15476089b252690017": "Recently, deep learning-based force fields have been developed, such as ANI (Accurate neural network engine for molecular energies) and AIMNet (atoms-in-molecules net), which have increased the accuracy of absolute binding free energy simulations by up to 50",
        "2211.03208_e4905bd056fbf4ffcefb9396b8100709": "\\cite{ANI,AIMNet}",
        "2211.03208_882fafc03598297563c3e69087002bdf": "High-throughput free energy simulations to estimate the ligand-protein binding affinity have also been carried out on a larger scale in",
        "2211.03208_654a2a103b71c5a30ac9de8c0c3e8603": "\\cite{guterres2020improving}",
        "2211.03208_5152cadcfe25b135f2697b622e22c4f3": "Here, the authors have used AutoDock Vina to dock the ligands to the target proteins to obtain an initial docking pose, and then run free energy simulations using OpenMM. 56 target proteins were used, and 560 ligands in total",
        "2211.03208_7918674898915415b411010799d8fd81": "The results show that the estimated binding free energies have improved in accuracy compared to the original AutoDock Vina scores",
        "2211.03208_772afc18f7a4db5f40838f7a8e780835": "The area under the ROC curve improved by 22",
        "2211.03208_9ed9ef5108880e9eb69163145801f383": "Packages for quantum mechanical simulations suitable for free energy calculations of protein-ligand systems exist as well",
        "2211.03208_6b0bf8c365d198a1e7c93b462983dbc0": "In principle, many of the standard packages for MD simulations provide some form of QM/MM support, such as CHARMM",
        "2211.03208_391108b9fda47a3655f10cd14c2564fc": "and AMBER",
        "2211.03208_fb5a2308b4e01831dc159729098870fa": "However, they are mostly focused on classical simulations",
        "2211.03208_18a9bc020e19ed7b9ac96e690665bcbd": "TeraChem",
        "2211.03208_f07e20c524df4dc9a13b6d14d6e4542f": "\\cite{seritan2021terachem}",
        "2211.03208_38f7d4771da3b578a78f970aee7ea43c": "was the first package for quantum mechanical simulations specifically written for GPUs, resulting in a remarkably high performance",
        "2211.03208_d921b5f6d1d6cd7b6428e4853a7fd2b2": "It can simulate entire proteins on the density functional theory level, and can also carry out QM/MM simulations",
        "2211.03208_3120953bf31ed867172f33adec41604f": "Another package that is currently developed for exascale supercomputers is NWChemEx",
        "2211.03208_5ed6ec358de85d1c1a7b02b908c81b85": "\\cite{NWChemEx}",
        "2211.03208_a4d5f845f5260f2a30b78ee96a2fd7a6": ", which will support quantum mechanical simulations of molecular systems considerably larger than possible today.",
        "2211.03208_3d1779a3fea7585e092f697bf6e79bed": "CONCLUSIONS AND OUTLOOK",
        "2211.03208_bba70b00a3000f065efb11ed916a1043": "Structure-based virtual screenings have evolved into a powerful tool for drug discovery in the past few years",
        "2211.03208_a4501ac1c4ba6d413bd3916814622175": "Ultra-large virtual screens allow to access billions of compounds, allowing to find exceptionally tight-fitting ligands for even highly challenging target sites",
        "2211.03208_9c07d79d15d07aa744c11860aeeb084d": "This approach allows to drug new target classes such as allosteric sites or protein-protein interactions, which with approximately 500,000 types are considered to be one of the holy grails of drug discovery",
        "2211.03208_47b872f4910a591bc95c868901c9d7ff": "Machine learning and deep learning techniques on the molecular docking and virtual screening levels allow to speed up the calculations by orders of magnitude, as do other algorithmic approaches such as synthon-based methods, or the use of hardware accelerators such as GPUs",
        "2211.03208_a708929a75aeec172d711b6adde7e5d3": "It is expected that virtual screenings will further expand the accessed chemical space by orders of magnitude in the coming years, with no limits in sight given the vastness of the chemical space of molecules suitable for drug discovery",
        "2211.03208_7e1ed2a8514bbd322f7ba9aecb598da0": "Deep learning approaches for molecular docking and for free energy simulations have the potential to significantly improve the accuracy and reliability of free energy predictions, though significant works lies still ahead to achieve this goal",
        "2211.03208_86ef4678563816269514d30b5e02a04d": "GPUs and other hardware accelerators will aid in accessing larger regions of the chemical space of druglike molecules in the future",
        "2211.03208_3d2b3fe4a826a2a537a526234059d246": "GPUs will be key for achieving highly accurate free energy simulations, whether on the classical or the quantum level, which hold great promise to improve the reliability of binding affinity prediction",
        "2211.03208_977192c43aee61329945e44edaf9a090": "In addition, structure-based virtual screens can be extended to tasks other than hit and lead discovery and optimization, such as predicting off-target binding via inverse virtual screenings or combining them with the prediction of pharmacokinetic properties",
        "2211.03208_c72fe6c90ce426eb830fa610477f2b92": "\\cite{Gorgulla2022}",
        "2211.03208_ff99a485c19027f523613db97916709b": "In summary, structure-based virtual screens are on the one hand already a mature technique, and able to be routinely applied in drug discovery campaigns to identify potent hit and lead compounds and to optimize them",
        "2211.03208_2017b0f8708ec60f0171c2f2cb25ee47": "On the other hand, they have only recently become powerful enough to be of real value in actual drug discovery projects, and have barely begun to scratch the surface of what they can achieve in the future",
        "2211.03208_90a2a4e7effdb9f3819f19875fccba91": "A bright future therefore likely lies ahead for structure-based virtual screens.",
        "2211.03208_2fff5dc868e4bfb332a0f28d298ca312": "[SUMMARY POINTS]",
        "2211.03208_507c62438ba3e87897e8e225f99914ef": "Early-stage drug discovery using traditional methods such as experimental high-throughput screens faces several major problems, such as high costs, labor, and poor initial hit compounds",
        "2211.03208_4d77e27457ea242ae88b5190a3d50a73": "Structure-based virtual screenings can solve most of these problems, by reducing the costs and workload, and by improving the quality of hit as well as lead compounds.",
        "2211.03208_8eafbe8b1206f0398048cd015d0df11d": "Ultra-large structure-based virtual screenings in particular have proven to be able to discover highly potent hit and lead compounds, as well as to optimize initial hit compounds",
        "2211.03208_3618e637f3a65bf0f29e7f50ac99bbd2": "This in turn leads to the ability to find potent binders to more challenging target classes such as protein-protein interactions.",
        "2211.03208_42bd73108430b239a5194e79431af044": "Synthon-based virtual screenings allow exploration of ultra-large ligand libraries without the need to screen the entire library, but only a small fraction of it",
        "2211.03208_b1dd1a5387eb7e21508d2038b416a993": "This allows reducing the computational costs by a factor of around 100.",
        "2211.03208_794cf976c92643042f2e2eb25b1621b4": "Deep learning methods for molecular dockings can be computationally much faster than traditional docking methods, and can in some cases already exceed their accuracy",
        "2211.03208_8ee68799b06e96ed8b64d18fb6e5372d": "These methods can be applied during ultra-large virtual screens as well as in synthon-based approaches.",
        "2211.03208_a6a3a7e21dba2faec30c175beffd49f7": "Machine learning approaches can be applied on the virtual screening level to dramatically speed up the computations, which is particularly beneficial when screening ultra-large libraries",
        "2211.03208_3b17e20826ccfea5e002723a22a4af1f": "Here, normally ligand-based machine learning models are trained on a training set obtained by applying structure-based virtual screens on a smaller part of the library and then applying the trained model on the entire ligand library.",
        "2211.03208_8a9b88a49589dcf09f0488810d7b206c": "GPUs can be used instead of, or in complement with, CPUs",
        "2211.03208_1d4dda12eec905dc3635e5dfdba3f75a": "They can provide one to two orders of magnitude better cost/performance ratio than CPUs",
        "2211.03208_d172743195da3730f2225fd26d0b880e": "Several docking programs are available that can make use of GPUs, such as AutoDock-GPU, Vina-GPU, and most of the deep learning-based docking methods.",
        "2211.03208_d253936b76990d7d6ad4d39197ee7257": "Free energy simulation methods to estimate the binding affinity of ligands to receptors can be more accurate than molecular dockings",
        "2211.03208_bdcff88839bab296629547cf9a60ff67": "They can model the complete flexibility of the receptor, as well as solvent molecules",
        "2211.03208_e4b2a3810573966ae4efd78d8946423e": "High-throughput free energy simulations have been devised that can be employed as an additional stage in structure-based virtual screening approaches.",
        "2211.03208_5ccba95ae26cfb9df479813500578a2d": "There have been multiple successive stories involving ultra-large virtual screens, which included experimental validation",
        "2211.03208_6276a9554c2c5c201305ba7af1b65a29": "In these studies, nanomolar to picomolar binders have been reported for different types of receptors, including enzymes, GPCRs, and protein-protein interactions.",
        "2211.03208_f19650067007bbffc5ea64708fecf22b": "[FUTURE ISSUES]",
        "2211.03208_cc7e4194bd0db7f29a463811839cd5fd": "The chemical space of small druglike molecules is estimated to contain over",
        "2211.03208_2ac70b1572cbea2ffe564e2a4cd138bd": "$10^{60}$",
        "2211.03208_3eb690c8b3cfb7ea51e11d411d3c6b60": "molecules, and even ultra-large virtual screens only sample a tiny fraction of this space",
        "2211.03208_cefa183b7bb39669ec7dd278acdcc3c1": "Further extension of structure-based virtual screens to larger parts of the entire chemical space of druglike molecules are promising.",
        "2211.03208_4aa31510c9e670604e707cc63561011d": "Deep learning approaches to molecular docking have the potential to significantly improve their accuracy",
        "2211.03208_fad0e5106d732cacac585a3a99eda0d2": "This is of high importance, as current molecular docking programs are highly inaccurate regarding their binding affinity estimates",
        "2211.03208_a54bd9127a7b8d7441f7175200b2bcbb": "Large, high-quality datasets will be key to achieving this goal with deep learning methods.",
        "2211.03208_cc5244a0a7891a048c1281f91b2d1dbe": "Machine learning approaches to virtual screens hold great promise to enable the exploration of larger regions of the chemical space than possible today",
        "2211.03208_27edcf9eb6418734d924820d8d09cda2": "The same is true of new methods that reduce the number of molecules that need to be explicitly screened, and intelligently decide which molecules are promising for a particular target protein.",
        "2211.03208_f0f539fa512cb539fd5e5425bc9cfc1d": "Further utilization of hardware acceleration via GPUs and other hardware (such as Google's Tensor Processing Units) has the potential to further reduce the costs of virtual screens while allowing for large chemical spaces to be explored.",
        "2211.03208_44e1520a071a1f242000f80a44b8f040": "High-throughput free energy simulations have great potential to improve the accuracy in structure-based virtual screens via multi-staging approaches",
        "2211.03208_2d145ee1b3b463f4390d3efefb0a4a91": "To date, only very few tools are available to aid with high-throughput free energy simulations, and more convenient and easy-to-use tools are needed",
        "2211.03208_a27bfefb026e18d0608fc84dbbbf5055": "Ideally, these can be applied in an automatic way after docking-based virtual screening stages.",
        "2211.03208_67b8ff32ff9ac82c4c03e61e17a15c29": "Quantum-mechanical scoring functions for molecular docking could improve the accuracy, in particular when there are metals at the active site",
        "2211.03208_4e7bae86d0e18cacdaa381841cfab371": "In the long term, quantum computers might provide substantial speed-ups for quantum mechanical scoring functions for protein-ligand docking.",
        "2211.03208_469ed90afc571ab9ff5e80c92358eff1": "While there exist already a few web servers for virtual screens, they are mostly not yet available for ultra-large virtual screens",
        "2211.03208_a70f0e8e969fbcdb55283daad5972f4f": "Visual interfaces that interface with the cloud for ultra-large virtual screens that are easy to use would facilitate the wider adoption of structure-based virtual screens by the drug development communities.",
        "2211.03208_ea42f5556a83c576c5b30f132da8234b": "Structure-based virtual screens could be of great value to predict off-target effects, for instance via inverse virtual screens of specific small molecules against the entire human proteome",
        "2211.03208_8070dd19dcc3faddacca43cd99c45eec": "The AlphaFold Structure Database essentially opened the door for such approaches",
        "2211.03208_80d740bf8bf639d064991994900ec524": "This could reduce the risk of toxicity of new drug candidates.",
        "2211.03208_7c83319f2d47d7f2be1820def61eba7b": "*DISCLOSURE STATEMENT",
        "2211.03208_0e7ef6ce1c6e51c7e50099b62429be3f": "C.G. is a cofounder of Quantum Therapeutics Inc., a company that uses computational methods for drug development",
        "2211.03208_10be3957e70031c39d39ea7c3ca51f73": "C.G. is a cofounder of Virtual Discovery Inc., which is a fee-for-service company for computational drug discovery.",
        "2211.03208_2733b732c5a325d4db107ac1d5f42ff8": "*ACKNOWLEDGMENTS",
        "2211.03208_26edf8c70159cca7a8b1e60c694cb86c": "C.G. would like to thank Brigitte Klein, Konstantin Fackeldey, and Akshat Nigam for proofreading the manuscript and for their valuable feedback",
        "2211.03208_4d2c845944df8a7e14c9e53fdbe1b960": "C.G. would like thank ChemAxon for a free academic license for their software."
    },
    "hierarchy": {
        "1": {
            "2211.03208_e353dbe42c8654f33588d4da0b517469": "2211.03208_484d63715016b3faeb431c83724680c9",
            "2211.03208_00edd66487f833a95eda2eee6138b4db": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_c88598c86e305019721baddb30a11bf3": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_88bd1313b3383d8bbeaa43be8c262c97": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_d0f93be314d972f0d80d1a19a24bfb5d": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_dd39daf8d1cc7846d94f7dd5f09e6833": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_5dcc89c995e4ea4b005de3033e930ad7": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_23f6995342463f05ce134cf17c997719": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_8b2d03e454e7bc67522d591de6622e04": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_5933ba40c36942af6d85eae2b87d1ac5": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_aca2dccf69f0f41ed5f00f9d42cf606a": "2211.03208_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03208_bdd1a6aa8eb88d576a329e265fe9d504": "2211.03208_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03208_63eff0f37e5014dc9ba3dbe70151bb91": "2211.03208_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03208_b938d4811425ec1851cf2a10ba8a3ff6": "2211.03208_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03208_f86d8659c8c7c2fb5553ea3003aabbfb": "2211.03208_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03208_a8f65dd93445b90d34246cc201862695": "2211.03208_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03208_7d74f3b92b19da5e606d737d339a9679": "2211.03208_7bade40785d1f5c1dbec8c0414eaac9a",
            "2211.03208_bb65db63651cd4e3a41b44fdae432363": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_b689c777394b5f7f6f3f843aaea0d2be": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_6394fd1a158b2d2db355851cb54fee54": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_7028be5298e9cad74470b4074a1cda9d": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_74c0fe0caf1082b04d2f2bd573753b41": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_5058f1af8388633f609cadb75a75dc9d": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_f7bce49f240e23a6ed180a0cc4bddedf": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_f51892cdc37fddc152a1dd2ff0b19367": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_ccc6558be912a04cde6a47bdfca5a51a": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_018225ca8486e9e14b3085877e21550e": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_ef28d2b1a3be00766a94fd3f28aebbd4": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_4dbde906faac0f6a705a01b88b3ca152": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_69d81486bdfb597516836a527b48279c": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_d751713988987e9331980363e24189ce": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_9abe45bda0ca40fab5224b9c04318c89": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_ec0ed49bbcf8a34ee9c4aba4fe22cf5b": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_e2fc2c4e8ff9d58b4e62fd8dee52a88c": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_20f7006392353f5367430876caa29123": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_7706d0228ba260b56bae7a9081ab6c95": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_e8a3f0c46f4cfa7552654153fcce5485": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_9371d7a2e3ae86a00aab4771e39d255d": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_ddc76e09e2939872f9185094dad4964e": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_682b28f800674f10c7c9fd794bbcc879": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_049369462a288edeb4936c74aa59eef7": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_eea4861c14bd502b42dba24ebd279919": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_84764da809cae3df77750e9b8d480e06": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_09faac44d5d9e429e0b60f8581355ac9": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_1b47b73b2235c63a53167ac1f6ed429a": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_2da15d511f9ab741fd489c0ebfad8248": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_6068718aff46d5d98007adff3935413a": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_3ae449e8e0dd7f92d1320260ae8dd6b2": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_0cb6e9ef39c0d450616a167527803943": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_42e7359ab8a75634000aa9017385088f": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_10761922a6de3a783a7f5cdafb0a69d4": "2211.03208_42e7359ab8a75634000aa9017385088f",
            "2211.03208_4e4106e65f51b68b5d9c3bd2433957ad": "2211.03208_42e7359ab8a75634000aa9017385088f",
            "2211.03208_510045ccf46342d64661aa3aec9b2453": "2211.03208_42e7359ab8a75634000aa9017385088f",
            "2211.03208_1d499cb3559f4f8e3b4547bf07e2bcf5": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_f12ff111a3706d64bbbf1887d70c671f": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_c882234274eb3ae7b7cdfff10aaca30b": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_2b91e61fba601575292f5388ab76bb9f": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_c6d57b100a63250fbcdd764ef1fa3a5f": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_4666daf2ac7c493ef801279d1121c717": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_fcca54e9c79a79e085a7bea9416caed8": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_edcf376aefa94122c3ee8daf56731834": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_30c045c509181b366d0d86a031fb3b5d": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_021c0e0548be7f524cb410946721ad1f": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_299c045524c45bb12e6cc848815c4108": "2211.03208_510045ccf46342d64661aa3aec9b2453",
            "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0": "2211.03208_42e7359ab8a75634000aa9017385088f",
            "2211.03208_4c97352f89f8849698c629b61eece9c1": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_b96b9debf6e3d9087712feee2d0c8711": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_c3616f8d049a5d17db244544451faa6d": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_1f9d1dcd989d1a8126765d9bd2d63626": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_8723e8e9ad42b0f14a075a247338c60b": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_2e3649d639926d026a58e4bab32e19f7": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_52c287fec5a764ce36ee28c9e267a895": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_5e8a48e1e0fa0f46c611df47f44077ca": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_2e2d69a7178955d1c78950920f27785d": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_e3a633752d977ef352f491bb43ea6dd3": "2211.03208_41d4aa98ac190bc7a302d579e00ba2f0",
            "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1": "2211.03208_42e7359ab8a75634000aa9017385088f",
            "2211.03208_6f75b012cabf3aa9778a473bedc85b1f": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_28814fb2f74548681fe397d38bf6e767": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_78d26f5aead5a03e3b0a2dd0860de0d6": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_28283cc35093c143c3f1295a4e5c3755": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_4ea6c08be733e3b23984b05dc7f6aeac": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_341ad7716eefc3d0d64d4bc268f657c5": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_b69f65843278cc5aa76103bcd4e9da2c": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_a3f17b1379791bda70b0d13066d77c9a": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_9f2ccebb04ee4d21924c64e954994d65": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_9d4e33ffb5b0f45b8ee26ab6ab3e8cdf": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_b0bdd9debec3e3eb8bd0dbca2b3a5fb3": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_00a3d913041ec28cdd8c9ee758163907": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_b4d523a4b7a364e228eaf16ebe43975d": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_be922fbd7d285e458648be106dba72f3": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_b99e1a6a42209f18b666374a41cc0b66": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_53bec7bc688e904523d0d21b291500f7": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_d2ff5363c1dd0f4727257e336d0da5fe": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_b5ccb8017156ad20f68bfbd51511f63a": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_910475193ac4573e3f84fa86992067e7": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_42fccbd12ae6fc95d09f82bfa00dadbe": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_fd9712b0e92dbbecd48bf130ae0286e9": "2211.03208_d7c49b0491f77344494f34d9dc9ccfb1",
            "2211.03208_f519b794f7279913664b1643599996aa": "2211.03208_42e7359ab8a75634000aa9017385088f",
            "2211.03208_f03d6d3094bc614d6a564059b04d1436": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_af67852c5a1cb1b7242fb03480396b4c": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_c3a41a742c26d523af873abd9ca942d1": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_0455b3ac71067b1786c4466049cfa118": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_f148449fd60722165d4036f53fa5900d": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_097b6fb93c7564a55642d3f8a442aa2b": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_2c897e5a79ca15cd0569bff0349c8f2d": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_6fc949f1c58c1777773050dea0ee0799": "2211.03208_f519b794f7279913664b1643599996aa",
            "2211.03208_c7b169652feac844cda7c5587312c759": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_6d20f13823a952f249b76535869d93f8": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_3b4956f7c1591b0192fe66563b4afd72": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_9b4bb9c1c6df97a256435a0be323384a": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_3735ec776c4236dfb173bedf7ad4214b": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_2a787130d9f2ad007b2fcd2a631d9cbf": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_ab8bc691e3955e8b4f53c2a1420f7283": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_7bade40785d1f5c1dbec8c0414eaac9a": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_9268e29cae0dbce44701e4f552b8a88e": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_180689304ed32b3d0d1a5d173c584c75": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_ff1c8e0a1437a795ad28b79194009771": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_8c5212fb2a54ea2458087f9ab9145696": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_ec9c3a652825bc7ee67e2760cd5a5b2b": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_52f938ca332cf61611120416c7b6e75e": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_7db08ad9fc83efa696e6a411368ba014": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_75d45cfbf72c6c2a9c5fc5c76d5373dd": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_7cb5ad2030e191b5782a704ecd84e665": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_c0cb5f0fcf239ab3d9c1fcd31fff1efc": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_16ea45fed9303a819148a75e6d65a820": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_405aaff66082ffe7231d7c1f79926c17": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_df96112e3966e5a6f963d1cfc5fecf43": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_8e712c6376fdada573a2512853a7ba91": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_40e1622410b0d5dd0a83821e57685bd4": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_7de5916534611a9040effb3f21fde466": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_cb0c0a15dc5986fb55471300c7d8c4dc": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_5d828b905ed58f9e6824e7052f0a9752": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_4465dbe57e79a2ee4e39316413e0cc2a": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_56a7c977f057a113fd4420fa237da151": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_3de5e5d26540971c29d3924965e278b7": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_5922cc1e9670522b09e1d9830eeb4220": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_3389dae361af79b04c9c8e7057f60cc6": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_35c903c95f82fe057554a22172b16f6c": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_868226b1a1295e2384e87a0a2af3a64b": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_74f370f3d05f637aa45898a91755b012": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_a9959ece70d841b452903f1422d22536": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_3df4044b87a5a851fb24d7db64430906": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_fd3ff5a05f4a7679c450c803f2879848": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_ad1cf81c6aafe9ebe09c084b327d4943": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_0a1a2e3fad3f86b51bce6184a054eb70": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_0ddc681816c94f7d5b2ead0be6f74889": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_a5accd5e01f1b09b14ada643d9dea188": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_dd082050d4dfad2dd6b632dd320c31f0": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_d5283f917f382c754d9098e06b707b9a": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_e30e5f5ab3838dce521c615e4d510585": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_88e57bc950f5bd184437d6b42754df4d": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_2d6499b6cb48936a6e0e1e790ed10679": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_94b2cd496a6be4f9838e6aef9bf0e08e": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_594a5104481bc6aa91e67a2d5800d236": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_ca4800d665f57392465a11eba466448f": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_370964eec07cba8c52acb1ce1b35ab6a": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_662a6fada78452edbb46fab925b017eb": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_7ef433f0bacb7db28689f6f23a865c22": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_9d31283197d429475290a9a0da6c09a0": "2211.03208_12a0c35a728d0a8916aa7ea0373ee94c",
            "2211.03208_4723e9083273eace05e3b18e949dc6cd": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_9cf914d6d74072c0801e6ffed4129f1a": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_d0de37c499ceb96d25b8fdec72905863": "2211.03208_56ceb9caa2ccb812fb39ec20cf086a6b",
            "2211.03208_b72afbec2389735b78da2e53553d89ca": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_8588b8399637ce1384b3648f2cfcc95b": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_2b50821594a324858eff64144d9b39de": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_af9b3b6d3e24f1580b5645c701c548c2": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_659539c501a349c7db4e410172799c8c": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_3602d31b2837efcf23694ab96eed8239": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_7c29e87fbde86cbe29df064f65eb652f": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_f39a140653b561d36503897a146bfe1b": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_6ba7595bbc191a3707b857e0d3e91552": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_59f8be32f381c709110a894bcca93a8e": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_53a5d3e7e6f3e0d4ee7b5e4f716fa498": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_6f22f05a0a4c69fcc6c085e1f4c9c4dc": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_54be83fc131cfe211c66bed8dc1dd399": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_ce84a14efece0b89d7ef6da313cb28ee": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_e3ce1cf0c07fcfa508ab166d612ed3e2": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_942ea7fbbb1d15212471005e42dd06e3": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_ac4aca32fcc6a453435252e61f0d365e": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_4140ba74fe55e12696111d41ca35c514": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_930128db7f87b62b6cec62a91360c312": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_e731d6fc1394199b207feee2b1902d42": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_696c5fe24e90f0c032709b88e32b23ec": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_122a5112c6433df14429df2b7a12a27c": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_3a1e650e24d6557bc83ce885309ac023": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_ff8b6b42dbde55af39ed61950ad578df": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_9dbdb3862e7fd115b28c323240b69a33": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_e3c590f5b7d0f05867d4a5b76011cc57": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_7b8277a034da7c872425ba25e83f6bd6": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_f98d675961ec14d1cecc8cc58e7dee45": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_e2e5ebba8d61e162c398d3c5954e2938": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_45b2e07ecc015dfcac28269744e5c5d0": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_5c3c70c8870acb1918b78df2b199657c": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_4a25d93176c92e4471a4ae9f916a9380": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_f66c4d5c725c6af565785a89269943b6": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_687c37a5bda95d3b76d8a0a77125f0ca": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_ce96ce64475d88003b81a20710c10f5e": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_65f7587e75dd404b64db7a06ba610520": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_95b5afccf084489b5be725531a49ad81": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_9789a1fe4568b2e46dec704357fa5ef0": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_4517b11aefbb9ba2a30b91bbb6cc3a4f": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_898a5dbb97ed195ddfbd9162e5ee3ec7": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_cda4d07cec34b460b0fd74d56b9c7819": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_df9c3c542c93c3dfced7f3c8be67966c": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_861516cb7b502ab98e58e4daa756c08c": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_4fff3e5e24eb34092c1a5b7ffa09fa90": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_8a858c9187e55bae12fe72bb1ea9aea2": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_2fb61f54976696fcdff226c8efda8891": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_aa257265c8aee8befa77be289572e288": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_4e33b121a75b146c1fe19c5858ef9b23": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_8c94418edff4099a27ee31bbc49b44c6": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_8d741630a94350e1edfcc516f7f63c3c": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_95dbff23855538c971f50ab2aca18475": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_ee00982bb278d3dc183df2302c15633d": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_71e07a3ff2ac796159ce07d2a53315c1": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_b742b75ae991a45ac9cc031b5bd0686d": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_485e6a90c4ae2e6721a98e8cfdb7e9d6": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_4075dbe8907fcde79289a2c613f25b04": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_3bdc3d338b3d212cd6a644cf42f82ab2": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_1c5a0e44f8e2113d439db268c96d6746": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_6ad49d1514f2e57a3c94be0295aa2d71": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_b9bdac61f61e60eecd0b7924c7f263dc": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_3326bcabe042decfdd15e7dcce5bc010": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_09a76ab96086c57906c69ca3ed654880": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_7e3c4998f84f9be8466624d89f3cdf8f": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_baac8a79c409a4e86978fea06ae835e7": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_544713707677505e226ed6d52cc1a0d2": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_37378b775d7c2cbcf2bdaa923df87297": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_80444fc1bf7c454b6436e44fed1b4f5a": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_dc75c46d42646f69f54942d37e34c609": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_14dd4530e2d81331b5f7ca3361d700e4": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_134e49d3bf505b634033bfab714a135b": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_51dce2a0bcc864df0a4c57616e6e363e": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_eab5747db8d998f6006da44bf47b5480": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_8b547135929d55d22e004313f64a9b65": "2211.03208_d0de37c499ceb96d25b8fdec72905863",
            "2211.03208_15edaad3b2cc900ad5425ee1b5804167": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_90efbd6976cd0faa966a66726c4cfdeb": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_b2669127e1a750745fa225d21bc29a8c": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_617aaa1762ba2348b9b8b2f5d627e843": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_7e01fda94d58c6c5298f4636bde23844": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_d1ca937864a2c72a099cdb4eacc7ae25": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_40da9c3526b91a507de74bcbaac94f40": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_2ce2397d70b1ceed1ccc5660dfff96f4": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_cffff10e9750ead9d9ddfa1174a86b0b": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_2334c24ea38a896131cbbc0c62292a6a": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_3708e3ff5ecb0a52200f61fa594e39dc": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_0cdb77ff353de75bc240285f152a77ed": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_645eada6f7778a72f18875a275906590": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_27f13911175e270233d73a6f6fd3b38c": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_7475def9272bd5162c14b89940498fe4": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_8217ed3c32a785f0b5aad4055f432ad8": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_b0fed81db02b36747f6b970025cf36d5": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_336840151875852facd44e802395498c": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_c07e0d80cc0b99701c0cdcba13ac402f": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_758823e541a9dc353cea2233efd15119": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_ca7bc8e9df9996cb4c4fe130d27934e7": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_30867f9b672d8e8048cbcfca136afde8": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_723b6c31d783e5eaf57e4bb50c834bba": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_a1e3b3029830f9efe861c0ec4abeb987": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_b093eab53909eb186c36db5146b36f93": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_8e13c3edb75a066d9fe4378b5284bceb": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_6306ed5a5b48c2e314f84f760d523d20": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_47041c50aba917030bd8c02874440f9e": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_13eabac0e0930ee4665cd7611734baf3": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_6cfabdfcde2b69a953065488221df44d": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_e2dd2c93d61cdbbb05768a8288d9545e": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_0e8412f03c23674c018540136d09fc3e": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_b7a775bcbc26d9bf001c429e35774a40": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_e8de5cd70bf293f1fa26942ed23be720": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_1cfac99084da113e3d8143b6125dc6e0": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_bdd0537e613c321a153f6e238afd5ba8": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_cb7ce2019e460a631b376fa6987fa8c3": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_ec16e92c49bfb68fc76845a4f4c60aa5": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_48787fd0fcf6f082f8a59e95717bc2c4": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_e5882a5bd4cc94ef1702da1425f1fcf2": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_3387e2e42b368c871c954eda32ec19eb": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_2770f8b75f06c1099acca762051bf7fb": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_2575f3b0597f76cd9948f4224293440b": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_fb0e94178bc37eb6e867fdd6500c800f": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_efd1106b4b7f17c71f853f1fdf478cb7": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_bc7fe9b8c8aaae197602b5cdc87c9fee": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_a235e7c16ddd61f0e191b52bdb5e0d5a": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_a4704fd35f0308287f2937ba3eccf5fe": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_b114d7bb7a7c41c31cdaad58b45fbdf6": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_bec4fc16e4f2fa14a6e15a33188ca33e": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_eba3521c043921de84939418622ed1e7": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_1e71e2473a3da64135c6326218ce34cd": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_d7cddd52118cfb32147e2c2eddeb890f": "2211.03208_15edaad3b2cc900ad5425ee1b5804167",
            "2211.03208_5abddcf8536e1af209061302c85f7d8e": "2211.03208_c7b169652feac844cda7c5587312c759",
            "2211.03208_0afbf14bb71360ba7c9717385ba3b5a5": "2211.03208_5abddcf8536e1af209061302c85f7d8e",
            "2211.03208_acfb8a5d05300acfa9012de36a04762f": "2211.03208_5abddcf8536e1af209061302c85f7d8e",
            "2211.03208_c09b9d631ae76379e943b10989a412e3": "2211.03208_5abddcf8536e1af209061302c85f7d8e",
            "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78": "2211.03208_5abddcf8536e1af209061302c85f7d8e",
            "2211.03208_9933ddbfd9097d258de8437cb3dd0fa0": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_85fcdbb23b6478bcc0b70d7911690d3e": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_16b3af1d2f02ab353cdccff431fe0036": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_c670da3212346056f3a67dc33af266e2": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_b6fca8f14049dd11d3ebe92a39bf6844": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_4805974743e1fba6b7725ff1224fda66": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_82cb7b71dac872e3bd3cb80ef50ab29b": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_a260b6f5acd9ef030849a26aced6115c": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_7a503c60c2fe0ca3c53ae65db51837bf": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_6152eb3be89cba37917809b5e9c3fec3": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_c2135345fd98ccba8db016b9e1d383ea": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_bac427453a99117084521e1b6f98b107": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_f6fc15a1e89fea1808ba6bae4a959e20": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_fdef354283c4be749fb36383c5b66a2e": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_4e26576bb5ead1f3313d043a437c54bb": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_ca9847d0ac9de2c3e5fcfa38433f2d38": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_d2ee827598166e763de1684b10e065bf": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_cb91b34420e29ac65071d0b91abc6f18": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_ad8749e4a7de5204849bf0d1ede87777": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_7b81f451258ddae6694de54ea279561c": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_dee7a62b54a156cbab0fa2a181a071a3": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_6ef4caf0863b35864a7f9d736a89271f": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_55d4eea75ce0a09ee9192ac3d58aa1e5": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_c0b61ee3b781eb6901e44e6161bdf0e9": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_875f0bd36dc53010da1dc44c907cbed6": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_3d0e23e8fcdebece006a1c9861df5a32": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_5466e5e4bfc2c380a44a6d211e2d688f": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_2aadcff329973d70c4ff59bf71d35975": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_91e7f2a1a1d6b09bfdcd6e30338d04fc": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_861220e4893dce6d4e20434afef7e021": "2211.03208_0dd41b7fbfd14bd71bd39230fcbbcb78",
            "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7": "2211.03208_5abddcf8536e1af209061302c85f7d8e",
            "2211.03208_c20b3df516480ccaee28d88c55608ccc": "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7",
            "2211.03208_249be74d9f92c01d79b8a6c1f4a872e1": "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7",
            "2211.03208_1667b93ee87fecfdbd28cfd2a47516bf": "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7",
            "2211.03208_e120c010c181db0befb657ee0618b63a": "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7",
            "2211.03208_00255fd5105203eaf61b2a8486d9dc54": "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7",
            "2211.03208_4897b5a600342a1bad767968a8893d37": "2211.03208_c5c15cd196347f8d66c5d7b6e96240d7",
            "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_7f11746fa794c4d1c16a49729fd23d7a": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_dc2b8ad10150a9530298cd8a7f226f60": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_2e340a8f6b907c443fc3a4f70301024e": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_e02a402585e71afd566ac56e6a60aa95": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_3a212828233a6d067b1e01efed425cad": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_8f036d0d01a2580029fd34bbc45a39e7": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f": "2211.03208_b023e3386e6d5e769fe1e66d15adf7aa",
            "2211.03208_3511d94edf62913789738a089dc5570b": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_8b09a5178e20d56d2bf2633d6f520d45": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_0f0e51caab917973d3b7a2a3fe28b3ab": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_302b2d26895badc9db016790464ee6a5": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_27a71d00d0a68d10e7769b477a2c087c": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_60f5c86aee2716c684d38a3c7cc346cc": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_dc5f776090ff64d06eb8f17e66d023c9": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_e6e6ef5448ce217ed342ba420ed90cdb": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_820021d99672ab407d5ebd5c1e6fca11": "2211.03208_91edeebbc4b99e453f3f4a6b0b2bbb0f",
            "2211.03208_281fd4300a5600795252de91b7d67870": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_74409aeb07b2cdf8313dd377bbcebd0a": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_6a80144c07d55923578d66c6ce37c210": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_58a3758f7c833f12be776765b4c60268": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_c08b98ef29a248700973d4ee14771317": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_906daa44b0a305a36af184d1ef605517": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_95600693372c284d62d04ff28cf09af4": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_4ca1dafeb60eddc851c2c2307da8ccca": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_975b028ccec1e768ec2dec2e8e29a9af": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_b68b17b2c0fa4ec10243566a81788884": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_385795c05684f56f0502df74278e3540": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_dd1953d90c0bfeacb5ebe4f93bb62060": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_db2d535fb400b3f5206dfd4d91f75abf": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_dc4d878536121939bc30c7afe97f39ff": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_a91a11b1bef5a2b8acda484c6708b783": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_64ea1878cb55de41ac559604dc481052": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_9f8ccac3a0a8d4ffd4436d5f1d7c5158": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_305a5c8d500f4505108f345fea983724": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_a8fc8c6ac8f008230cb6bd438e207f85": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_faed7aad4a1656c7571d5e01bc478bf3": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_1bb45eadd372b6cc94b26128f67f9ac4": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_4a534097ae61ea5a0bb68d9111c3c7b5": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_1fbf02e279e8d683cf5489b03009aabf": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_0ce3f788a8bd7353b43d8466a97371b0": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_50a3f88bc727aa54bd7fd17951bb994e": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_d1330ad1905fc7bb9644df2179cdeea8": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_ab0e79cd0d628b06ffc546d34566e4cd": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_1cffa750b4383837ab4afbac0b61c3fe": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_b0b32dfb65e7664c73c7814fe8a73a0f": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_eb1b25bb945e8c56950db3ff9393b236": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_370ff2dc6d1ec16afbd9f4a987bbe90f": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_bbb25a9a93197af71f6bc07ec7501c4e": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_92a91e565c3a07ca7078e09a55cc6254": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_a8273800b9eae144de2e33bfa7ead764": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_b21f5f68d3ca56339e6d5c570fcea775": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_b346cd5dbc9817749b98dfed122f4d71": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_0bf9abf29e9314c734b8c1fa62f56c11": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_f1291a96254b4cb0e11704ca1e42ea70": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_dbc8e2a285d5d7e7c79998a86c289030": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_597ad78c9db087d31154f5749ec8b507": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_f329c7970e5e9d3b61a60c0984ae903e": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_41e2217516ed51872c9119e9f9c94965": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_beb03d7aec704b818c725d7af5c73af0": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_c59f1a0082b0327d123ba07f2fac96da": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_4b8e4be5060674cae1d20ee57e318ce0": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_ada2580220e508894e25eaa462599838": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_cc8e1531f448a387f033a26df9ca2dcd": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_346907cbd8696452406cb88780d15ab9": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_3417762efa9a0dfba807c0d5b4f54288": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_844331cf089b71748bf8ca7d854e1fba": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_1e22e8820bea02d0c0078058dc47a652": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_a52420191c75a7361504ec3455ae802d": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_ec897ddeb24d82993e6c3c9d84269408": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_39f43f1cd20d0be58fbb00d5166c85d2": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_b815283492307d0cfb7843f10e9ff8d0": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_ed88b971de5407c3b1f049ddf98df007": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_7fd86b6257497f056ccf711c24bcb921": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_f3fd0b0c8c65e95c6d08179b73d29f27": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_b941251dc228af224a9e67de3e6463b7": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_56449cd2af03e8e2426f9aaff98f869b": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_aa1a042f2b9596a64b6de6fa43fd6c54": "2211.03208_50a3f88bc727aa54bd7fd17951bb994e",
            "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_b9f902030148ce4162d5c883d1b17dd0": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_a89425ad1d7705061151ed9aa55f045f": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_a5b4ea11d945ae9b0ae75dfe03dcf5f6": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_d37923487b214600faf947a66073879c": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_1996183f86ab7604d7b40091f6cb7053": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_f703e5120093aba2746d78c12ec90820": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_d93b84cd06f4def97ffbf1229e71610d": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_971bde4d5545d5d2ec6a256b98a9c1e5": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_e266f3b7ec44d915f63e44f3fdce05dd": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_fffae448c6a650e5e19fc4c851597edc": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_a406424ec12f7eab4c0ea453702345a3": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_528e07e94caa8c9f67ecc24bf51cf487": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_ae58cbf2d44f8d6c501ae083259a7f94": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_b7c594e9333a10d1445aad868966740a": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_20add7ff038bda97f7e85bcbe25f49ec": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_56cba769fe7c58e61c78b4b1b9cbf845": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_ab0e8f2dc2e002d593949ed5559ce7df": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_0009c8d624d6af685c51cd890ae68167": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_d7db27c678ec75ad62f46077565aeb86": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_0acd22c86297ad8396cfaa1e943bd815": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_cab92036a75c118f32feb84d80159774": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_2d9355a87d6fb599cbaec3d5e8a22dca": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_51f8a19153c29c48e072d25371710d9f": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_4a46151b183605ce395c49efe0e7c0ac": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_2b8a6df580922bd98109cbe779a67a50": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_ef6f3c90fd49f5481a7fa1ef7d80c402": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_06470e62582a0a158162818bf06c1d46": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_4a23620617fd478794bc16f05ef15ee3": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_649eaf8f617c494314d35231ec15dc44": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_dc9b9849e5c1ebc920da7c7539070ca6": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_719169532eed5df2834f41400b5d31b4": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_308b48fef9f366f90c53daafec315563": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_7313d87fe50b2fe9b38570d3d8fd55f1": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_7a9f678d931fa7c1e4446e99ce0edfb3": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_53cb0c2628d0a1c61ad17f6831d190ac": "2211.03208_d2bb6dff52a2eaa8a34e3bb683c897c5",
            "2211.03208_6dcca016d942682fb8db296218e8da7c": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_bd750c7786f1bffa961d08ed950e5a9d": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_4d567c4413465d19f3abee992988b44f": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_e75ccd9f66c414c5cacfca78fd78ca52": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_be1e5a5224359949235adedf591a588b": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_f842c9b3cb39f361987430c1048909ee": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_45012ff8b1a29f62caf25142aaebcfe4": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_adf2403e02555152f56f361da0e0a0be": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_b8f1e270b10ee38b4df4ac95a6cf32af": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_cc235e808cdbff7f106a358b74a90cca": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_a06d8b602582c193def980228db5f67a": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_b11bf6e7ca767d0751ea30f90f6842a9": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_5cc533e4c1c91ea62c7ff4eb7ef5b819": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_892de7dd6352670f10360811ae9dbed2": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_97dc7eef1837b15c97efa1fd5d37cddb": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_8308b5a376391e502fbd1fcb8f8e6ddd": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_1f2c3b99d5df7cd8b713c6017db2f790": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_2665d5c05f7691338f8c0929cb2791f0": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_8eef9215071793a019f50826b672451f": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_a9b6bcc386dcc2607d7a299b05e371c9": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_c7b5e2dbdea4b4f90a695e2c0b99c07d": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_c751b4ca66cb2ec9cd71761478f39150": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_baf3e47dd5d53c13f541d6a06b14b498": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_76d3475362eb9e950c8d516e2624b695": "2211.03208_6dcca016d942682fb8db296218e8da7c",
            "2211.03208_853fdeb1039f76abcdc82def0c68ffbd": "2211.03208_281fd4300a5600795252de91b7d67870",
            "2211.03208_be7c3bb77c8fc071c2f598571885ec9a": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_d545fb9a5855f8a4e8264aeb5244c31a": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_14de283550cd07da1158befeb21cc867": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_60cddaae594ce744bd6a0b4d839e8685": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_10560136aa9a6e383a69e7fe9aa0b5ab": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_94e3f09636fc091643916aab66ad6c74": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_51e712e04b64eacf5c14e741fe804665": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_5e1433445191b8433325390ecd47fa6d": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_20cc1773e87063190392bdea3d9866dd": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_0f909cc5aef9013569d0051fae06981c": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_72e5fa8d09c1d3babe67a15d7c4f2bef": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a13272e87713d5285edb797ed4545959": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_dcb0749f7df540ccd468ab19cc0e53bc": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_bf56d9684440f026c1cc3f047e22243f": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_789aad00dbec6b471341cb6d7770b74f": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_78016e5da1f6a97d2ac4d4de9bb79d74": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_37f3918a733cfc552fa2ac8c8852b492": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_dc2cbaf020311f980bd4dcf7de7463fb": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_1471fca951442d19b2c05243f664609d": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_8ad0d4fe4c6c63a387c9455a1ea763fd": "2211.03208_853fdeb1039f76abcdc82def0c68ffbd",
            "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_ecd88a46da313ed0f32828fc6d207e79": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_508dd18d17fa4cc3776b9c0ef6be7f65": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_78f3bcb335958df63bacd6cfb71ded0f": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_fbc0ebe21aaecb78201f729d520466a6": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_b7917f6f2aa80c382ae280e943c28b02": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_6bfcb98e20518ec06aa4d1d686d0f16e": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_589edc4b355de0cbe4240822e16d015e": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_514c4343a93182c9cb57ba818cc96ccd": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_3b5465e96896638bf8c76839c1c8892e": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_7c1f265ae72eb811decc4493454d5c72": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_b0351dd033e3fccf916d8be296e057d4": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_f2e34baa149e9e22567e4594d6304150": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_6b465b3a4226a60cbca2ff823793ce85": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_b4737cbd4b83315263429c7c7c1babd5": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_9664b61c821afe5f4afa6140dd3d6e03": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_615c039889548f421a9e0c52293130c3": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_51e484dd05308dc792948640fc9ab47f": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_5236699913fff060d78945b47715a48e": "2211.03208_589edc4b355de0cbe4240822e16d015e",
            "2211.03208_ec6c15de7b71eeb362034952517340fb": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_30dab85faba16483c15f640f33963037": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_6f52f6905917258ed076081d9ed3ed01": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_48daf25b3f12eae48e0926ebf0ee1306": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_2793a0d297d63bedc7618bb889f178aa": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_bd7a7c666a3e6848cfc26410a36e796e": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_b737d20cd88934b119ca73f8c4ea7ee0": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_1efb0a93a575c6afc1146bcfb5f681b1": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_03bcc691cba0e7bcec5e4914d032dbea": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_ae97b9b18d4a63656b1457023bac4bdf": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_0b66997e14c41ecc998efd9f716efc7a": "2211.03208_ec6c15de7b71eeb362034952517340fb",
            "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2": "2211.03208_7ee1eaf5d110ef4cb80eaaa5ba6d7393",
            "2211.03208_2c94f831ea0c35ba988b0162a5dd59b0": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_3b188d07765950a2f1c55314987ff4a6": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_67cbf331209cd6459b16d9c3ec8de36d": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_b162d5cab664609de9a2b3188ffd328d": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_f4f6c6a259331e05738304ed2df80ae2": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_c80577c5595a9317f303d84cb81ea450": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_90c48423dfb16e41c2221204718727dc": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_949600201c2ac41ca027f77015a08d43": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_e45db4aa4dd1e343d588a09d5126dc45": "2211.03208_0ca7b3a719cf28fd12ed3ad323f12ca2",
            "2211.03208_cbe9223e7bc275ad1b27cfe49be87895": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_676c6ff17130136f7fb1fe998602a50b": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_573626c32ded86e199ceae478ab534ca": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_b5e10772482e029d596f16498cb73b9a": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a77253443e70df22f0cf6815f7d17eb4": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_b46868311e3ad9f8639b95e08fdedf6e": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_c22316c49c8c1f6882fe499f7caecf83": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_ef147d8f525ca85abb9cfaa37f09527d": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_3f60cc817351c9072338f207d43217a9": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_dab4271f1a075bff3fbfced72b7d9734": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a93701c3733f70819b1c4ab54cf19186": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_0ffd29bf9ae09ff42bde06d264b822b0": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_432f21864119ca9f0c9091909bca5e6b": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_175ffd2c07add3637451d94093f516a3": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_e7c29e2b4e3d21c86f8dde6a542c1947": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_4afdc89216cee101c8fccf5adc18320a": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_8ccc1e689520df9e85198ea2bbfedde4": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_5339d76287bb91f5d14c002e13631276": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_90d36e2cba199fd74e9a4ab58b4b8751": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_43d6db381b39db2edc80d8f75c9c1761": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a4ac157de5706923ea2cc9efe60d0aa1": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_4fbfc6969533e6a2b76f7249f12fc53a": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_3d61bf21573c0d25ea17ed5ffc14a91d": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a41f39998616abaa873e8a382a9477c6": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_c000d869ee468e2a6547c4886cd17f6c": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_abcda23b0642790dd973741b8864245e": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_076ff15334130d82b83fb110a99ea803": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_99282f8a8a9bd0485dcadc705cafc409": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_5e5f9fcba9d654b120ba94c9a4b1341d": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_ae4babef334c1e27bf3942e7c6622269": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_43ea1c3820c8376d442f54bf21e8c12f": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a44812a5d91f68c1c4b2a8eb3718867e": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a1434e0ba91da6a98ee997a7f271a222": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_de2d1b73398af2e588f3b91595340328": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_e72e279c066011e359c510ee783f7c17": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_c7f7bf44c0bf8019d20848be4b9c4576": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_37b2b4c6b7228e4b390a046b3540228f": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_13bd459092bb4e95fb631e10bfff3035": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_5bf5884f3b46f8b3cbd63e697190d4cb": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_f7bbe887a893febac44beab0b9847aef": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_83168e6cb289d732cc78427b51f93153": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_3e2b6f8bc11ac54910c9796467a26bd8": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_58920549509ec286fb1c0c592f807721": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_5974daf9cc9e721a983154ce0a3b3dc4": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_4dd1d6d5a1f17c36441defe505e90bd7": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_95902faf2f966f8ca1acb4ab714775f3": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_94ee90c84479bd64738b18ffbed83f9a": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_a1f4b8bedcd38930caad59eeb0988688": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_8d39701929aff82fef86f94a11a2c78f": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_f2442a67aca6787e6f480fa68bc448c6": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_38662a8c33c821a3cf847af94561df62": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_be6e44cf9f961d27e982cafe7600efa4": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_eee9c85a0fd96eeba841add8dbd660c4": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_896d747ab5d9b118a486c37829f5b26d": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_83085cf4cbc7cfbc3fa751f4ae9f8e27": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_8f4b9db57c4aa5151a4e107e58683e76": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_30f28ee8bdddfa525d56b5b02da2858e": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_6b6e3132f3655f2f69c7da401cce2044": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_b8fda62ce0dadeefbd3e60f53160400c": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_078152b0a1a6380e8e9e5684a307cace": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_097ad6634a4bf73e2311d2ce2dd424e6": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_ae0d8d11266958cccc69b5edf6375078": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_d86f031549ee5b6a2b6eb6bf10537816": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_967d2ffe13275437c1be320148eb69d0": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_ef59a766a69c8e3828e7bc4b7c86b65a": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_c26e6b5ba81daebd29d2289187ef9750": "2211.03208_cbe9223e7bc275ad1b27cfe49be87895",
            "2211.03208_87e874c9b18a9195da2fc86d6185544c": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_23ecc17605becb65e0bc68124dbee1a8": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_06291815a397fa2f00d610c7a6a904e3": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_1875e861bab97b2a355e535a847552c6": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_e7d0666a9a2764075aa50cfd0db3043a": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_61748e109f4b38997a49b54544193e18": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_9d64ddf56bbdd74b00f67789d7c844b1": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_522b29d88c0a3f3e8364d88b85482166": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_cedabd3ed5ca65d8ccce356a2d72fbe7": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_792199f569f8fbb1f210bdc157062116": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_806d0c2be206f8ce65c7e3012bcc378b": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_7e2da2a008b5036f752d75c6c881f3bf": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_a5ad7c3492a323cdecf170950c96d03a": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_f5f9e1bea1c6177ce333798c2ffd3705": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_68d8c25676505cae480dea220b245739": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_7c8e07f39e2efc413b44e7923e537650": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_b15f4f5b69d132376375c7b4ee954d17": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_129ab03605c12970397beb5b43021f26": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_5a60d1604e25794d8725b98a6767c932": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_c1c881a451bb759c33ec2ebdbbeacb77": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_5f62d50335475208e2cf4db4480d1b54": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_722929c26d6115e90219f55810d73ae8": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_e1630f71020ff47f411282de7330ea0f": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_9d143e455825a0bbe2a2d304465166cd": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_735213bcbe3e76c33607de7ea41f1c92": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_1c52977a951e789ea89ed6479158c004": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_04899d15cd37154fb21735a6bf42c47d": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_ecdfb09af2f2fb1a24bdf23e1f6cf1dd": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_718820f80416e93bf6dccd334858273a": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_f4d8b3aa09196b954b9b458980eae630": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_8a2aeb0a94e355cc6c6b9ea49d6d890a": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_9f9dcbee06f84fcf50729370baa30f6c": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_9d6eb4a91ef38534e0469e59c91e0fbd": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_7cc5f67f58ee7f9b1bdbe3cb17b3d6c4": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_5e2e1879b64f8f15476089b252690017": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_e4905bd056fbf4ffcefb9396b8100709": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_882fafc03598297563c3e69087002bdf": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_654a2a103b71c5a30ac9de8c0c3e8603": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_5152cadcfe25b135f2697b622e22c4f3": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_7918674898915415b411010799d8fd81": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_772afc18f7a4db5f40838f7a8e780835": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_9ed9ef5108880e9eb69163145801f383": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_6b0bf8c365d198a1e7c93b462983dbc0": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_391108b9fda47a3655f10cd14c2564fc": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_fb5a2308b4e01831dc159729098870fa": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_18a9bc020e19ed7b9ac96e690665bcbd": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_f07e20c524df4dc9a13b6d14d6e4542f": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_38f7d4771da3b578a78f970aee7ea43c": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_d921b5f6d1d6cd7b6428e4853a7fd2b2": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_3120953bf31ed867172f33adec41604f": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_5ed6ec358de85d1c1a7b02b908c81b85": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_a4d5f845f5260f2a30b78ee96a2fd7a6": "2211.03208_87e874c9b18a9195da2fc86d6185544c",
            "2211.03208_3d1779a3fea7585e092f697bf6e79bed": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_bba70b00a3000f065efb11ed916a1043": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_a4501ac1c4ba6d413bd3916814622175": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_9c07d79d15d07aa744c11860aeeb084d": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_47b872f4910a591bc95c868901c9d7ff": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_a708929a75aeec172d711b6adde7e5d3": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_7e1ed2a8514bbd322f7ba9aecb598da0": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_86ef4678563816269514d30b5e02a04d": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_3d2b3fe4a826a2a537a526234059d246": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_977192c43aee61329945e44edaf9a090": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_c72fe6c90ce426eb830fa610477f2b92": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_ff99a485c19027f523613db97916709b": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_2017b0f8708ec60f0171c2f2cb25ee47": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_90a2a4e7effdb9f3819f19875fccba91": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_2fff5dc868e4bfb332a0f28d298ca312": "2211.03208_3d1779a3fea7585e092f697bf6e79bed",
            "2211.03208_507c62438ba3e87897e8e225f99914ef": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_4d77e27457ea242ae88b5190a3d50a73": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_8eafbe8b1206f0398048cd015d0df11d": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_3618e637f3a65bf0f29e7f50ac99bbd2": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_42bd73108430b239a5194e79431af044": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_b1dd1a5387eb7e21508d2038b416a993": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_794cf976c92643042f2e2eb25b1621b4": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_8ee68799b06e96ed8b64d18fb6e5372d": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_a6a3a7e21dba2faec30c175beffd49f7": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_3b17e20826ccfea5e002723a22a4af1f": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_8a9b88a49589dcf09f0488810d7b206c": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_1d4dda12eec905dc3635e5dfdba3f75a": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_d172743195da3730f2225fd26d0b880e": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_d253936b76990d7d6ad4d39197ee7257": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_bdcff88839bab296629547cf9a60ff67": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_e4b2a3810573966ae4efd78d8946423e": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_5ccba95ae26cfb9df479813500578a2d": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_6276a9554c2c5c201305ba7af1b65a29": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_f19650067007bbffc5ea64708fecf22b": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_cc7e4194bd0db7f29a463811839cd5fd": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_2ac70b1572cbea2ffe564e2a4cd138bd": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_3eb690c8b3cfb7ea51e11d411d3c6b60": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_cefa183b7bb39669ec7dd278acdcc3c1": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_4aa31510c9e670604e707cc63561011d": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_fad0e5106d732cacac585a3a99eda0d2": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_a54bd9127a7b8d7441f7175200b2bcbb": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_cc5244a0a7891a048c1281f91b2d1dbe": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_27edcf9eb6418734d924820d8d09cda2": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_f0f539fa512cb539fd5e5425bc9cfc1d": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_44e1520a071a1f242000f80a44b8f040": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_2d145ee1b3b463f4390d3efefb0a4a91": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_a27bfefb026e18d0608fc84dbbbf5055": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_67b8ff32ff9ac82c4c03e61e17a15c29": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_4e7bae86d0e18cacdaa381841cfab371": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_469ed90afc571ab9ff5e80c92358eff1": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_a70f0e8e969fbcdb55283daad5972f4f": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_ea42f5556a83c576c5b30f132da8234b": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_8070dd19dcc3faddacca43cd99c45eec": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_80d740bf8bf639d064991994900ec524": "2211.03208_7d74f3b92b19da5e606d737d339a9679",
            "2211.03208_7c83319f2d47d7f2be1820def61eba7b": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_0e7ef6ce1c6e51c7e50099b62429be3f": "2211.03208_7c83319f2d47d7f2be1820def61eba7b",
            "2211.03208_10be3957e70031c39d39ea7c3ca51f73": "2211.03208_7c83319f2d47d7f2be1820def61eba7b",
            "2211.03208_2733b732c5a325d4db107ac1d5f42ff8": "2211.03208_e353dbe42c8654f33588d4da0b517469",
            "2211.03208_26edf8c70159cca7a8b1e60c694cb86c": "2211.03208_2733b732c5a325d4db107ac1d5f42ff8",
            "2211.03208_4d2c845944df8a7e14c9e53fdbe1b960": "2211.03208_2733b732c5a325d4db107ac1d5f42ff8"
        }
    }
}