{
    "elements": {
        "2211.03016_870fc9ad8a7fc462cb389aa8bab2c3c0": "Document Root 2211.03016",
        "2211.03016_e353dbe42c8654f33588d4da0b517469": "Abstract",
        "2211.03016_3327b67e9b61d7102615bee71b21d81d": "The SABRE (Sodium iodide with Active Background REjection) experiment aims to detect an annual rate modulation from dark matter interactions in ultra-high purity NaI(Tl) crystals in order to provide a model independent test of the signal observed by DAMA/LIBRA",
        "2211.03016_c330e29978a170007848c41124ca961a": "It is made up of two separate detectors; SABRE South located at the Stawell Underground Physics Laboratory (SUPL), in regional Victoria, Australia, and SABRE North at the Laboratori Nazionali del Gran Sasso (LNGS)",
        "2211.03016_56bee53650687ef96b1b3e6a11ed597b": "SABRE South is designed to disentangle seasonal or site-related effects from the dark matter-like modulated signal by using an active veto and muon detection system",
        "2211.03016_b8ebe954c6012d149d5821ed10206f34": "Ultra-high purity NaI(Tl) crystals are immersed in a linear alkyl benzene (LAB) based liquid scintillator veto, further surrounded by passive steel and polyethylene shielding and a plastic scintillator muon veto",
        "2211.03016_ead6593e606c8f11a13306c3eda3d106": "Significant work has been undertaken to understand and mitigate the background processes, that take into account radiation from the detector materials, from both intrinsic and cosmogenic activated processes, and to understand the performance of both the crystal and veto systems",
        "2211.03016_9fdee3758127376ea4c5295015f46e8a": "SUPL is a newly built facility located 1024 m underground (",
        "2211.03016_39336a2ffd276833bc2af414ed460bfa": "$\\sim$",
        "2211.03016_fca8d1f9fcb3165f3c1b91cd3d65b6ba": "2900 m water equivalent) within the Stawell Gold Mine and its construction has been completed in mid-2022",
        "2211.03016_15aae8ea141667505613efb610bda0dc": "The laboratory will house rare event physics searches, including the upcoming SABRE dark matter experiment, as well as measurement facilities to support low background physics experiments and applications such as radiobiology and quantum computing",
        "2211.03016_8bec361805ff34ebec683d579ad67926": "The SABRE South commissioning is expected to occur in 2023",
        "2211.03016_b9534ec8703f28205fd073848f019d0c": "This paper describes the setup and projections for the experiment, and the description of the underground laboratory.",
        "2211.03016_5933ba40c36942af6d85eae2b87d1ac5": "INTRODUCTION",
        "2211.03016_c3f0db365e7a8968bcfc86e41790e8df": "Dark Matter (DM) represents one of the most important open problems in modern physics",
        "2211.03016_d872e35131b81a8f77b24785cfc9ddff": "\\cite{bertone}",
        "2211.03016_42c2e6984ac2381d2cda054f691fcdd1": "One search technique is direct detection which attempts to observe the recoil of a target after scattering with a DM particle, hypothesised as a WIMP (Weakly Interacting Massive Particles) with masses on the Gev/c",
        "2211.03016_e18b24c87a7c52fd294215d16b42a437": "$^2$",
        "2211.03016_ae294903e64b83ef53e44eef0195992e": "-TeV/c",
        "2211.03016_6178250dd8157ed5daa82412cc08febd": "and cross sections on the weak scale",
        "2211.03016_b8f96fc7f248f9f1165977c1a91d48db": "This interaction rate should modulate annually, with a sinusoidal trend, due to the rotation of the Earth around the Sun as it moves through the galactic dark matter halo",
        "2211.03016_5bc3b7c0d6e66503fc4c2b0b29daed18": "To date, only one direct detection experiment, DAMA/LIBRA, has observed a modulation compatible with that expected from DM",
        "2211.03016_75d8484bea8a196e2b4e9fc81f9165c5": "\\cite{dama}",
        "2211.03016_490baa36c71ff5a9a0bf8becce23e7b9": "However, this signal is in tension with every other direct detection experiment; all of which report null results for a standard WIMP",
        "2211.03016_15f6e748e9f2208d0d38a381176df179": "\\cite{tension}",
        "2211.03016_68c71902c846acd1481e7ea6964fa023": "These are possible explanations: the majority of experiments do not use the same target material as DAMA/LIBRA and the current experiments with sodium iodide crystals do not achieve the same sensitivity",
        "2211.03016_dc099370538ff0437533c35c476449e0": "\\cite{cosine,anais}",
        "2211.03016_2fde186e630527bdb84b42e2630cdadc": "Further, it can be argued that the modulation observed by DAMA/LIBRA is due to seasonal effects, for example muons which also present a modulation with a maximum and minimum in the same period, in the Northern Hemisphere, as DM",
        "2211.03016_054dda82a1c97872d7f3fcccbefc64db": "\\cite{borex}",
        "2211.03016_fbca2c10bf076739be2e7d3b547c15a3": "The SABRE Collaboration was formed to provide a model independent test of this DAMA/LIBRA signal",
        "2211.03016_18cd4bf5064e1c106e0d1db5bf82b6ca": "It foresees two detectors located in two different hemispheres: SABRE North at Gran Sasso National Laboratory (LNGS), in Italy, and SABRE South at the Stawell Underground Physics Laboratory (SUPL), in Australia",
        "2211.03016_5235390425d8bff73176bca751d00e67": "The two detectors have a number of common features as they are centred around the same detector module concept, and use common simulation, DAQ, and software frameworks",
        "2211.03016_80eb36a2cffadf8d0f562ba57008a24a": "The two detectors differ in their shielding designs - where SABRE South will utilise a liquid scintillator system for in-situ evaluation and validation of the background to provide background rejection and particle identification",
        "2211.03016_d1441ba3e71bd44be1dbb1157d95871f": "SABRE North has opted for a fully passive shielding since the organic scintillator has been phased out by LNGS",
        "2211.03016_0d2929c3f1134c00dba7832f0249f805": "The ultra-low background components will achieve the same sensitivity as DAMA/LIBRA; moreover, the site in the Southern Hemisphere will allow for the exclusion of systematic seasonal effects.",
        "2211.03016_365ed43da7c1c774364f70422e9eaa0e": "The SABRE South setup",
        "2211.03016_5a2ba9eabe41b50c9593a20a9e28d56d": "SABRE South is made up of three different subdetector systems: the NaI(Tl) crystal detector system, the liquid scintillator veto system, and the muon paddle detectors",
        "2211.03016_373c613b0a3c7641c0bc54acbf8d5bd7": "The crystals and the liquid scintillator veto system are further shielded by steel and polyethelyne walls",
        "2211.03016_e019e3ea7848298daf23ec9a3e52114a": "The full experimental setup is shown in Figure",
        "2211.03016_f6a61710d2229e24b64de417a68c127b": "The experiment can host seven NaI(Tl) cylindrical crystals 25 cm long and 5 cm in radius resulting in a mass of 7.2 kg per crystal (50.4 kg in total)",
        "2211.03016_e92f0c419a865feb4db83db75f4e21ca": "Each crystal is wrapped in PTFE foil, mounted on by PTFE crystal holders, and coupled to a Hamamatsu R11065 PMT (7.6 cm diameter)",
        "2211.03016_5fe01d749e9e087c1e07cf70763b4a36": "Crystals are then encapsulated in cylindical oxygen-free high-thermal-conductivity copper enclosures flushed with nitrogen.",
        "2211.03016_2e864acf963f9c1f2b7458a89c1c08f5": "\\begin{figure}[h]\n\\includegraphics[width=8.8cm]{layout.png}\n\\caption{Rendering of the SABRE South detector (top). Detail of the crystal enclosure (bottom).}\n\\label{layout}\n\\end{figure}",
        "2211.03016_14783684f49fbabd8dcc54306604439e": "Enclosures are submersed into a liquid scintillator which is primarily used to tag and remove high energy decay products such as those from",
        "2211.03016_b4e2341902944cd76a3e1cc409c53373": "$^{40}$",
        "2211.03016_02ae16e2519a19e3122139bfa58a666c": "K. The system has a 4",
        "2211.03016_f30fdded685c83b0e7b446aa9c9aa120": "$\\pi$",
        "2211.03016_de5a7f749416946b73cbf7c5bcc933b2": "coverage, made up of 12 kL of linear alkyl benzene (sourced from JUNO) doped with PPO and Bis-MSB",
        "2211.03016_e1b34ae0c81916bee3a5db51d0bc5277": "Around the sides of the steel vessel this is encased in eighteen 20.4 cm Hamamatsu R5912 PMTs that are sampled at a rate of 500 MS/s",
        "2211.03016_b890967a9cce3490b9c8abb2772d985a": "Based on preliminary optical simulations in Geant4, this system is expected to have a light yield of approximately 0.12 photoelectrons/keV, though this has a strong position dependence",
        "2211.03016_9654a9ec01587f0b9b71da6e73376772": "With a threshold of 50 keV the inclusion of this system is able to reduce the total background by 27",
        "2211.03016_ecdc1f7100b4d47644510d5117309b0b": ", providing a background of less than 1 cpd/kg/keV",
        "2211.03016_410536ae612361c56b6602ed3a6f6da3": "\\cite{sabre_background}",
        "2211.03016_5058f1af8388633f609cadb75a75dc9d": ".",
        "2211.03016_8c008e45ead6a7de00490d3c4f0b5b96": "The muon detection system is made up of eight 3 m long EJ200 detector paddles and has a total coverage of 9.6 m",
        "2211.03016_4eebc1c3b2eab339cbad93b357187b65": "$^{2}$",
        "2211.03016_d736985e79d30ece9210aab3ff2edc9d": "above the main vessel",
        "2211.03016_1e077afb3f42e0eae6d0324454867b63": "Each paddle is coupled to a Hamamatsu R13089 PMT on each end and sampled at a rate of 3.2 GS/s",
        "2211.03016_a2c0a62c12ba6ee1f7e07cfeb79daa7b": "Calibrations are still ongoing, but the energy threshold of these detectors is expected to be around 1 MeV",
        "2211.03016_7bd4ea671173537562eb09b6a74ae67c": "The detectors have approximately 400 ps timing resolution resulting in 5 cm position resolution, allowing for a long term measurement of the muon flux, and particle identification when used with the liquid veto system.",
        "2211.03016_003b123ab9ff3e330eeeeb593f5401e7": "High-purity crystals",
        "2211.03016_f706d266c663c8c582ab243de332df19": "Crystal radiopurity is the most important aspect of the experiment",
        "2211.03016_d6ca183c0c377a21f2840154f5cf61d1": "Indeed, as already demonstrated by other existing NaI(Tl)-based experiments,",
        "2211.03016_37b878284a39e76092810e8cce753a3e": "\\cite{dama,cosine,anais}",
        "2211.03016_e9f67cfa7f8e0a69335e5abc8038e50d": ", a large fraction of the background for DM search comes from residual radioactive contaminants in the crystal themselves, especially",
        "2211.03016_f2ccde2c59890cd8930c3ceee5b3728f": "K and",
        "2211.03016_0503f403bb0d74fffdd3f959e3848ded": "$^{210}$",
        "2211.03016_f6296930bffcdb958e8911a0eba02872": "Pb; the latter is a daughter of the uranium decay",
        "2211.03016_fa795a3ed916f6fae8dfc2b5de750e35": "Crystals are grown from Merck’s Astrograde powder, the highest purity NaI powder commercially available, which has a potassium contamination below 10 ppb, and uranium and thorium contamination below 1 ppt",
        "2211.03016_cc0ba1e00bd1b179b07ce7498619c389": "The SABRE collaboration, through an R",
        "2211.03016_7c645607517d3cb24015b852519c65e5": "D effort based out of Princeton in collaboration with Radiation Monitoring Devices company, has developed some of the lowest background crystals in the world with only 4.6 ppb of potassium (Figure",
        "2211.03016_9371d7a2e3ae86a00aab4771e39d255d": ")",
        "2211.03016_da3c0940dce665169238fd7d31e40fcc": "The analysed crystal mass is equal to 4.3 kg.",
        "2211.03016_65ef91e72bf78cb710dc23db00a3745e": "\\begin{figure}[ht]\n\\includegraphics[width=8.8cm]{crystal_table.png}\n\\caption{NaI-33 crystal measurements \\cite{antonello} in red compared the ones from DAMA/LIBRA \\cite{damacrystal}, ANAIS \\cite{anaiscrystal} and COSINE \\cite{cosinecrystal}. Potassium, Thorium and Uranium concentrations are very low respect to the other NaI(Tl) experiments.}\n\\label{crystalTab}\n\\end{figure}",
        "2211.03016_8cea4e1499828f28747d7b9d740b7c49": "RMD recently grew a NaI(Tl) crystal (NaI-35) for the SABRE South collaboration of a final mass of 3.3 kg which is currently being characterised at LNGS",
        "2211.03016_99fd3e9e96038098ddb98c7972cb0324": "Its light yield is",
        "2211.03016_36318038d0dab935b7147544d7916611": "11.6 Photoelectrons/keV.",
        "2211.03016_6b5c7d6efcb6f0120460ad85a2702844": "Background model and sensitivity",
        "2211.03016_be0a42d9ba79078ee3a0bdf82fe38943": "A full detector simulation was conducted to provide a background model for the radioactive contamination",
        "2211.03016_77b1a555e99ef4f1d0a7e96d6ccb1042": "The total radioactive background of less than 0.72 cpd/kg/keV (Table",
        "2211.03016_7d2dbb10cadf6634a7f7b446b4e8acc9": "), dominated by NaI background (radiogenic and cosmogenic) with",
        "2211.03016_658c3177e59fa5d9a4f09961cd1b958a": "K effectively suppressed with",
        "2211.03016_f033ab37c30201f73f142449d037028d": "80",
        "2211.03016_5f099425f5cf8f069747d0a5c4e50764": "efficiency",
        "2211.03016_77dc109e99c5ee7d9f1a6e5522187d58": "This meets SABRE South's goal of having less than 10",
        "2211.03016_cb761efa815623aa6aaa299d531eddda": "of background from non-crystal sources",
        "2211.03016_c7b5c27f421b40554748cd78227e1b45": "External backgrounds, shielding, LS bulk, and veto PMTs contribute less than 10",
        "2211.03016_3bc9eec2f73508c8fd3061946ac6e9c1": "cpd/kg/keV.",
        "2211.03016_a6e269e8fa988d92ff0a8e3a8abdebb8": "\\begin{table}[htb!]\n\\footnotesize\n\\centering\n\\begin{tabular}{lcc}\n\\hline\n & Rate & Veto Efficiency\\\\\n & [cpd/kg/kev]   & [\\%]\\\\\n\\hline\nCrystal radiogenic & $5.2 \\cdot 10^{-1}$ & 13 \\\\\nCrystal cosmogenic & $1.6 \\cdot 10^{-1}$ & 40 \\\\\nCrystal PMTs & $3.8 \\cdot 10^{-2}$ & 60 \\\\\nPTFE wrap & $4.5 \\cdot 10^{-3}$ & 13 \\\\\nEnclosures & $3.2 \\cdot 10^{-3}$ & 85 \\\\\nConduits & $1.9 \\cdot 10^{-5}$ & 96 \\\\\nLiquid scintillator & $4.9 \\cdot 10^{-8}$ & $>99$\\\\\nSteel vessel & $1.4 \\cdot 10^{-5}$ & $>99$ \\\\\nVeto PMTs & $1.9 \\cdot 10^{-5}$ & $>99$ \\\\\nShielding & $3.9 \\cdot 10^{-6}$ & $>99$ \\\\\nExternal & O($10^{-4}$) & $>99$ \\\\\n\\hline\nTotal & $7.2 \\cdot 10^{-1}$ & 27 \\\\\n\\hline\n\\end{tabular}\n  \\caption{Background rate in the dark matter region for the SABRE South components, and the corresponding veto efficiency.}\n  \\label{bulk_dmm_total}\n\\end{table}",
        "2211.03016_6050aae991fb0167483e1fb401f1c0ad": "These simulations also indicated that as well as providing shielding and vetoing, the liquid scintillator system also allows for in-situ measurements of background contamination to help inform fits due to well defined correlations in the liquid scintillator and crystals, an example of which is shown in Figure",
        "2211.03016_9da7af648e3438c4e2d53644315aa11c": "\\begin{figure}[h]\n\\includegraphics[width=6.2cm]{backgroundid.png}\n\\includegraphics[width=8.5cm]{id_scint_crys.png}\n\\caption{Top: energy depositions in both the crystal and liquid scintillator. Indicated in blue and pink are events due to $^{40}$K and $^{121}$Te. Bottom left: rate recorded in crystals from $^{40}$K and $^{121}$Te. Bottom right: rate recorded in liquid scintillator from $^{40}$K and $^{121}$Te.}\n\\label{id}\n\\end{figure}",
        "2211.03016_8d94f13e55681e03d597a0f5b7c43a5e": "The projected sensitivity of SABRE South assuming this background model from simulated radioactivity and a total crystal mass of 50 kg is shown in Figures",
        "2211.03016_be5d5d37542d75f93a87094459f76678": "and",
        "2211.03016_27e6b6bfdc49f919996d1b6faf2b71b5": "assuming a standard spin independent WIMP and showing the evolution of discovery and exclusion power for the DAMA/LIBRA modulation",
        "2211.03016_9b14d7ebd786d0cc4f4bbbe8adf5f7ed": "Based on these results SABRE South will be able to refute the interpretation of the DAMA/LIBRA modulation as a dark matter signal with 3",
        "2211.03016_8cda31ed38c6d59d14ebefa440099572": "$\\sigma$",
        "2211.03016_5bc574a47246f122016869b32a6aa6f0": "CL",
        "2211.03016_7a896245c385b18b45c6c5f711da1f76": "In the event of observation of the annual modulation, this signal would reach a significance of 5",
        "2211.03016_8210e4a04f4b8d17bd539650d513f1c9": "CL with two full years of data.",
        "2211.03016_7966cea82862747fb1886a70d15fe22e": "\\begin{figure}[htb!]\n\\includegraphics[width=6.0cm]{sens1.png}\n\\caption{90\\% C.L. assuming a standard spin independent WIMP, a SABRE South total crystal mass of 50 kg and background of 0.72 cpd/kg/keV.}\n\\label{sens1}\n\\end{figure}",
        "2211.03016_79fde6aa53fd73efac1c8f93e5437e75": "\\begin{figure}[htb!]\n\\includegraphics[width=5.9cm]{sens2.png}\n\\caption{Exclusion and discovery power of SABRE South for the DAMA/LIBRA modulation.}\n\\label{sens2}\n\\end{figure}",
        "2211.03016_f996c0d278aaea8fe5ef359e413ca603": "The Stawell Underground Physics Laboratory",
        "2211.03016_0554b23187bddd7d5f41c990d6d03c28": "SABRE South is to be placed at the recently completed Stawell Underground Physics Laboratory (SUPL)",
        "2211.03016_8180e608ac2707bb837bc3ec9d3aeb52": "This is located in Western Victoria, Australia, 240 km from Melbourne",
        "2211.03016_a44a235902f9a02a431aa46b6acdf7f8": "The laboratory is 1025 m below ground with a flat over burden of basalt, providing almost 3 km of water equivalent shielding, and a muon flux similar to that of Boulby, Figure",
        "2211.03016_3ef936f66e52ed4223edf5163dae612b": "Internal walls are pinned with steel, sprayed with low radioactivity shotcrete and coated with Tekflex to keep the radioactivity level low.",
        "2211.03016_0658d97de86026dcb45a55512b92b92b": "Construction was completed in mid-2022; background muon, gamma, and neutron measurements are planned to start in late 2022.",
        "2211.03016_9128dca39be3d59055884ac203858f47": "\\begin{figure}[h]\n\\includegraphics[width=8.5cm]{supl.png}\n\\caption{Muon flux at a number of underground laboratories.}\n\\label{supl}\n\\end{figure}",
        "2211.03016_5a605b8df8dd9e6743d08af8fed42835": "CONCLUSIONS",
        "2211.03016_26228dc63cad0e85e64b69741df694dd": "SABRE South is part of the SABRE Collaboration designed to test DAMA/LIBRA modulation",
        "2211.03016_8d136a62578c57f3f6bc6c0c2eb1fe3f": "SABRE South is the first dark matter direct-detection experiment in the Southern Hemisphere and will be located inside the new SUPL underground laboratory.",
        "2211.03016_8ff0b0112fb4ab61062670d1e6be54da": "High purity crystals and large active veto give ultra-low background of 0.72 cpd/kg/keV.",
        "2211.03016_7efaa9d2338ed0849be1519715c2335b": "SABRE South will have 5",
        "2211.03016_9b20af720cef661974fc79824d329547": "discovery (3",
        "2211.03016_ff1e04b5884cb7277943f94a73288f3d": "exclusion) power to a DAMA-like signal with 2 years of data taking.",
        "2211.03016_30822569e2b0a5cf75c822dbbc25cdab": "Construction will begin later this year with commissioning expected mid-2023, after which data taking will commence.",
        "2211.03016_d67644090516653146e1949bfeaf0320": "The SABRE South program is supported by the Australian Government through the Australian Research Council (Grants: CE200100008, LE190100196, LE170100162, LE160100080, DP190103123, DP170101675, LP150100705)",
        "2211.03016_89897e0dcbe6a5113761fc10c4314c59": "This research was partially supported by Australian Government Research Training Program Scholarships and Melbourne Research Scholarships",
        "2211.03016_eb70362f6d53f7851708019ad6be642f": "This research was supported by The University of Melbourne’s Research Computing Services and the Petascale Campus Initiative",
        "2211.03016_ed7f5f8f69f159e33f399ea4e0b6be1b": "We thank the SABRE North collaboration for their contribution to the SABRE South experiment design and to the simulation framework",
        "2211.03016_f6dc96fa3ee034985c27207439d4c1bf": "We also thank the Australian Nuclear Science and Technology Organisation for the assistance with the material screening and the measurement of background radiation at SUPL."
    },
    "hierarchy": {
        "1": {
            "2211.03016_e353dbe42c8654f33588d4da0b517469": "2211.03016_870fc9ad8a7fc462cb389aa8bab2c3c0",
            "2211.03016_3327b67e9b61d7102615bee71b21d81d": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_c330e29978a170007848c41124ca961a": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_56bee53650687ef96b1b3e6a11ed597b": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_b8ebe954c6012d149d5821ed10206f34": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_ead6593e606c8f11a13306c3eda3d106": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_9fdee3758127376ea4c5295015f46e8a": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_39336a2ffd276833bc2af414ed460bfa": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_fca8d1f9fcb3165f3c1b91cd3d65b6ba": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_15aae8ea141667505613efb610bda0dc": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_8bec361805ff34ebec683d579ad67926": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_b9534ec8703f28205fd073848f019d0c": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_5933ba40c36942af6d85eae2b87d1ac5": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_c3f0db365e7a8968bcfc86e41790e8df": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_d872e35131b81a8f77b24785cfc9ddff": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_42c2e6984ac2381d2cda054f691fcdd1": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_e18b24c87a7c52fd294215d16b42a437": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_ae294903e64b83ef53e44eef0195992e": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_6178250dd8157ed5daa82412cc08febd": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_b8f96fc7f248f9f1165977c1a91d48db": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_5bc3b7c0d6e66503fc4c2b0b29daed18": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_75d8484bea8a196e2b4e9fc81f9165c5": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_490baa36c71ff5a9a0bf8becce23e7b9": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_15f6e748e9f2208d0d38a381176df179": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_68c71902c846acd1481e7ea6964fa023": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_dc099370538ff0437533c35c476449e0": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_2fde186e630527bdb84b42e2630cdadc": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_054dda82a1c97872d7f3fcccbefc64db": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_fbca2c10bf076739be2e7d3b547c15a3": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_18cd4bf5064e1c106e0d1db5bf82b6ca": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_5235390425d8bff73176bca751d00e67": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_80eb36a2cffadf8d0f562ba57008a24a": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_d1441ba3e71bd44be1dbb1157d95871f": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_0d2929c3f1134c00dba7832f0249f805": "2211.03016_5933ba40c36942af6d85eae2b87d1ac5",
            "2211.03016_365ed43da7c1c774364f70422e9eaa0e": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_5a2ba9eabe41b50c9593a20a9e28d56d": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_373c613b0a3c7641c0bc54acbf8d5bd7": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_e019e3ea7848298daf23ec9a3e52114a": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_f6a61710d2229e24b64de417a68c127b": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_e92f0c419a865feb4db83db75f4e21ca": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_5fe01d749e9e087c1e07cf70763b4a36": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_2e864acf963f9c1f2b7458a89c1c08f5": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_14783684f49fbabd8dcc54306604439e": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_b4e2341902944cd76a3e1cc409c53373": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_02ae16e2519a19e3122139bfa58a666c": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_f30fdded685c83b0e7b446aa9c9aa120": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_de5a7f749416946b73cbf7c5bcc933b2": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_e1b34ae0c81916bee3a5db51d0bc5277": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_b890967a9cce3490b9c8abb2772d985a": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_9654a9ec01587f0b9b71da6e73376772": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_ecdc1f7100b4d47644510d5117309b0b": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_410536ae612361c56b6602ed3a6f6da3": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_5058f1af8388633f609cadb75a75dc9d": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_8c008e45ead6a7de00490d3c4f0b5b96": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_4eebc1c3b2eab339cbad93b357187b65": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_d736985e79d30ece9210aab3ff2edc9d": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_1e077afb3f42e0eae6d0324454867b63": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_a2c0a62c12ba6ee1f7e07cfeb79daa7b": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_7bd4ea671173537562eb09b6a74ae67c": "2211.03016_365ed43da7c1c774364f70422e9eaa0e",
            "2211.03016_003b123ab9ff3e330eeeeb593f5401e7": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_f706d266c663c8c582ab243de332df19": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_d6ca183c0c377a21f2840154f5cf61d1": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_37b878284a39e76092810e8cce753a3e": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_e9f67cfa7f8e0a69335e5abc8038e50d": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_f2ccde2c59890cd8930c3ceee5b3728f": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_0503f403bb0d74fffdd3f959e3848ded": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_f6296930bffcdb958e8911a0eba02872": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_fa795a3ed916f6fae8dfc2b5de750e35": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_cc0ba1e00bd1b179b07ce7498619c389": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_7c645607517d3cb24015b852519c65e5": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_9371d7a2e3ae86a00aab4771e39d255d": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_da3c0940dce665169238fd7d31e40fcc": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_65ef91e72bf78cb710dc23db00a3745e": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_8cea4e1499828f28747d7b9d740b7c49": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_99fd3e9e96038098ddb98c7972cb0324": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_36318038d0dab935b7147544d7916611": "2211.03016_003b123ab9ff3e330eeeeb593f5401e7",
            "2211.03016_6b5c7d6efcb6f0120460ad85a2702844": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_be0a42d9ba79078ee3a0bdf82fe38943": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_77b1a555e99ef4f1d0a7e96d6ccb1042": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_7d2dbb10cadf6634a7f7b446b4e8acc9": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_658c3177e59fa5d9a4f09961cd1b958a": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_f033ab37c30201f73f142449d037028d": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_5f099425f5cf8f069747d0a5c4e50764": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_77dc109e99c5ee7d9f1a6e5522187d58": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_cb761efa815623aa6aaa299d531eddda": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_c7b5c27f421b40554748cd78227e1b45": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_3bc9eec2f73508c8fd3061946ac6e9c1": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_a6e269e8fa988d92ff0a8e3a8abdebb8": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_6050aae991fb0167483e1fb401f1c0ad": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_9da7af648e3438c4e2d53644315aa11c": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_8d94f13e55681e03d597a0f5b7c43a5e": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_be5d5d37542d75f93a87094459f76678": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_27e6b6bfdc49f919996d1b6faf2b71b5": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_9b14d7ebd786d0cc4f4bbbe8adf5f7ed": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_8cda31ed38c6d59d14ebefa440099572": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_5bc574a47246f122016869b32a6aa6f0": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_7a896245c385b18b45c6c5f711da1f76": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_8210e4a04f4b8d17bd539650d513f1c9": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_7966cea82862747fb1886a70d15fe22e": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_79fde6aa53fd73efac1c8f93e5437e75": "2211.03016_6b5c7d6efcb6f0120460ad85a2702844",
            "2211.03016_f996c0d278aaea8fe5ef359e413ca603": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_0554b23187bddd7d5f41c990d6d03c28": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_8180e608ac2707bb837bc3ec9d3aeb52": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_a44a235902f9a02a431aa46b6acdf7f8": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_3ef936f66e52ed4223edf5163dae612b": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_0658d97de86026dcb45a55512b92b92b": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_9128dca39be3d59055884ac203858f47": "2211.03016_f996c0d278aaea8fe5ef359e413ca603",
            "2211.03016_5a605b8df8dd9e6743d08af8fed42835": "2211.03016_e353dbe42c8654f33588d4da0b517469",
            "2211.03016_26228dc63cad0e85e64b69741df694dd": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_8d136a62578c57f3f6bc6c0c2eb1fe3f": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_8ff0b0112fb4ab61062670d1e6be54da": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_7efaa9d2338ed0849be1519715c2335b": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_9b20af720cef661974fc79824d329547": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_ff1e04b5884cb7277943f94a73288f3d": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_30822569e2b0a5cf75c822dbbc25cdab": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_d67644090516653146e1949bfeaf0320": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_89897e0dcbe6a5113761fc10c4314c59": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_eb70362f6d53f7851708019ad6be642f": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_ed7f5f8f69f159e33f399ea4e0b6be1b": "2211.03016_5a605b8df8dd9e6743d08af8fed42835",
            "2211.03016_f6dc96fa3ee034985c27207439d4c1bf": "2211.03016_5a605b8df8dd9e6743d08af8fed42835"
        }
    }
}