{
    "elements": {
        "2211.03116_f6ff846601e0317251f55a692af687b1": "Document Root 2211.03116",
        "2211.03116_b799728037c1c785fc229c226aa2f89c": "[FOR]",
        "2211.03116_35dba5d75538a9bbe0b4da4422759a0e": "[1]",
        "2211.03116_e353dbe42c8654f33588d4da0b517469": "Abstract",
        "2211.03116_11573de01bf8a390bd42d1f7272bd269": "Computing systems form the backbone of many areas in our society, from manufacturing to traffic control, healthcare, and financial systems",
        "2211.03116_5666b6c97307e29a255ba13ea216bcf7": "When software plays a vital role in the design, construction, and operation, these systems are referred as software-intensive systems",
        "2211.03116_2a5783ed8b626f9c5975217ef9e22a97": "Self-adaptation equips a software-intensive system with a feedback loop that either automates tasks that otherwise need to be performed by human operators or deals with uncertain conditions",
        "2211.03116_0e05648b732e3d9de7ce0025d8174fd4": "Such feedback loops have found their way to a variety of practical applications; typical examples are an elastic cloud to adapt computing resources and automated server management to respond quickly to business needs",
        "2211.03116_aef8f3eb23a6a2d759671e41bc9bed4c": "To gain insight into the motivations for applying self-adaptation in practice, the problems solved using self-adaptation and how these problems are solved, and the difficulties and risks that industry faces in adopting self-adaptation, we performed a large-scale survey",
        "2211.03116_68065f8e23b8f3a12f54b5e13d671b7e": "We received 184 valid responses from practitioners spread over 21 countries",
        "2211.03116_2d96ad7ef5061d568127deb4859a17e0": "Based on the analysis of the survey data, we provide an empirically grounded overview of state-of-the-practice in the application of self-adaptation",
        "2211.03116_86889e673250563237dee1ac46b3bb3b": "From that, we derive insights for researchers to check their current research with industrial needs, and for practitioners to compare their current practice in applying self-adaptation",
        "2211.03116_db36d59dbd46c2226c47f5fb77326a16": "These insights also provide opportunities for the application of self-adaptation in practice and pave the way for future industry-research collaborations.",
        "2211.03116_0b79795d3efc95b9976c7c5b933afce2": "Introduction",
        "2211.03116_28e250eb2a9ad49e4e7167ca4f306439": "Computing systems form the backbone of our factories, traffic control systems, healthcare, telecommunication, financial systems, and so forth",
        "2211.03116_21d8b46fb7ff04835e7cc2ca9760fe85": "When software plays a vital role in their design, construction, and operation, these systems are often referred to as software-intensive systems",
        "2211.03116_d93be64620ceec2e3b67d5f44326cb39": "\\cite{Holzl2008}",
        "2211.03116_4fd7132dd0514558df522241de6014bf": "The trustworthiness and sustainability of these systems is vital for our society",
        "2211.03116_6cd98eeed9e623c71d3a0a207c65d58d": "\\cite{2889160.2889212,978-3-319-48992-6_1}",
        "2211.03116_f8171d836feea72b00c5c7ecde0ea51d": "Yet, building and maintaining trustworthy and sustainable systems is challenging due to complexity that arises from the growing demands on these systems, their continued integration, the uncertain operating conditions they face, the fast speed of technological progress, etc",
        "2211.03116_f1d2614e58e81deb3de1a11e364fb2f7": "These challenges have been a continuous driver for new and innovative approaches to design, develop, and operate software-intensive systems",
        "2211.03116_b8b600537497ed3e80e7bc5b95d11bb3": "One common approach today is so called DevOps in which development and operation are blended, allowing system components to be easily evolved and redeployed without impacting their operation",
        "2211.03116_bdfb6e9b9bec9a3bd3557aec28a3c9f8": "\\cite{cheng2009software}",
        "2211.03116_72877664622c85eb299c8d24cdec467c": "A classic approach to address the increasing complexity of software-intensive systems is transferring control from humans",
        "2211.03116_2316c33796e15217027249ec06559390": "\\cite{Lethbridge2005SSE}",
        "2211.03116_e1531685b7a37f3308f7e48e7d19a587": "to software components by equipping systems with feedback loops that automate tasks that otherwise need to be performed by human operators.",
        "2211.03116_18e6c9850d6914d1a0df47d442844016": "These feedback loops monitor the system and its environment, reason about the system behaviour and its goals, and adapt the system to ensure its goals under changing conditions, or gracefully degrade if necessary",
        "2211.03116_f6b48884cbf8f9be895a669e1b6e133a": "Such goals can be very diverse, ranging from ensuring a required level of performance under uncertain workload conditions, dealing with errors caused by external services that are difficult to predict, or defending the system against malicious attacks and the problems they may cause",
        "2211.03116_42dfd22aefe92256b08339cb8cbf9687": "A typical example is a feedback loop deployed in a cloud environment that expands or decreases computing resources to meet changing demands while minimising the cost of operation",
        "2211.03116_ef61ab18ebab151da76de7043823b9e7": "Another example is a container framework that performs autoscaling in a microservice deployment",
        "2211.03116_477bf4be811458266f889a025f05687d": "The principles of applying feedback control to software-intensive systems have been the subject of active study in academia",
        "2211.03116_fe0a3e0c48977edccb59eb448c65de6d": "Back in 1998, Oreizy et. al.",
        "2211.03116_22d7458906d165dc44c5b7205458b863": "\\cite{oreizy1999aba}",
        "2211.03116_05fced9b8bdcc83c050c3697cde2319d": "presented a seminal paper at the International Conference on Software Engineering (ICSE) where the authors introduced the notion of",
        "2211.03116_fe3b68a8a734767e3604bb0cc55426af": "that comprises two simultaneous processes: system adaptation that is concerned with detecting and handling changing circumstances, and system evolution that is concerned with the consistent application of change over time",
        "2211.03116_12f47da3866435076aecc74d2e3abc4f": "A few years later, Garlan et. al.",
        "2211.03116_0569e35b5265a0d44669432647352203": "\\cite{garlan2004rainbow}",
        "2211.03116_355188005c5a07c1dec9c0c40152e034": "stated the crucial role of architectural models as first-class citizens that enable a system to reason about system-wide change and adapt itself accordingly to achieve or maintain its goals",
        "2211.03116_ec4767f6d9a5b0ed43dab3a543a88e6f": "Blair et. al.",
        "2211.03116_4ad941476a1b7aa2d8428d213a9abdfe": "\\cite{Blair2009MR}",
        "2211.03116_95afa94f0e78edf2ab3c714ad33c3596": "consolidated and elaborated on these principles in what is now generally known as",
        "2211.03116_ec539f2e1c5e3d7b0295a082d9e5bc87": "models at runtime.",
        "2211.03116_6494727263339959063f528e52f497c0": "In 2007, Kramer and Magee",
        "2211.03116_c444d656ed7c6b31a1053243842eca0b": "\\cite{Kramer2007SMS}",
        "2211.03116_fc9b45668fb18b74071097c75ec4e37c": "stated the crucial role of software architecture in the realisation of self-adaptive systems, distinguishing adaptation management from goal management",
        "2211.03116_28b25e712b0d04970a7374b5c3a21952": "Over the last decade, the research community has developed a vast body of knowledge and know-how on principles, see e.g.,",
        "2211.03116_b9f53d7d17a38a3e73e76f983526892c": "\\cite{andersson2009modeling,Blair2009MR,FilieriICSE14,978-3-319-74183-3-12}",
        "2211.03116_192fcc457c201193a7e6bac49953feec": ", models and languages",
        "2211.03116_2763c841e037284d942a08d91cf85471": "\\cite{Relax2010Whittle,2593929.2593944,2555612,MetzgerQMBP20}",
        "2211.03116_8b84dd6ddf24f615a1c272af865787cb": ", processes and methods",
        "2211.03116_1e8b00d782f3d03cf2b1d6873c6eeeaa": "\\cite{Andersson2013,Cheng2014,8008800}",
        "2211.03116_90604c1849f93b2dea3997f0c2c498fa": ", patterns",
        "2211.03116_77af6ad83ffe332cd6576217be5f8015": "\\cite{1808984.1808990,weyns2013patterns,9223653}",
        "2211.03116_a986b7d0b94db2446b4d8ee03da06a98": ", and frameworks",
        "2211.03116_281e500324a7a72edc097c935366aa6c": "\\cite{garlan2004rainbow,Rouvoy2009,1882291.1882296}",
        "2211.03116_354294b3ccb73f935bb80a6c94e4cea5": "to engineer self-adaptive systems",
        "2211.03116_f57487d255ce9c962884d394ae513fc7": "Researchers have documented a substantial number of literature reviews and surveys on various topics in self-adaptive systems, such as the benefits of self-adaptation",
        "2211.03116_b9c35872efe979c11ba30a280cdddfea": "\\cite{6224395}",
        "2211.03116_fe88f185252ac0bfcf5a762638d49aaa": ", requirements for self-adaptive systems",
        "2211.03116_6d088eed54fc084150057ac1fb71a49e": "\\cite{978-3-319-05843-65}",
        "2211.03116_ae8c585de05e47d23e3da03257bf42e2": ", approaches to realise self-adaptation",
        "2211.03116_5b7ae3ae39f7689a73d62d3ac43cb7c5": "\\cite{MACIASESCRIVA20137267,MAHDAVIHEZAVEHI20171,9223653,7929422}",
        "2211.03116_76d6936b1083270adf0ef120eb04c0af": ", the use of formal methods in self-adaptive systems",
        "2211.03116_1d20734c58b2dbfaa7d3dbc8e86d034a": "\\cite{2347583.2347592}",
        "2211.03116_57bc624e47c46f96565bd2935dc7518e": ", self-protection",
        "2211.03116_3b7ade8ce6d1d51a21ba646fdadca3f1": "\\cite{2555611}",
        "2211.03116_6e9011363eb1858e2f251d7ed41bdeda": ", the notion of uncertainty",
        "2211.03116_9cfb8090d645eaeb5a86c5f6655d372b": "\\cite{MAHDAVIHEZAVEHI201745,10.1145-3487921}",
        "2211.03116_58d7302a895acb051900513e9dc4fdd9": ", and the use of machine learning in the realisation of self-adaptation",
        "2211.03116_d1d8848467bf58808816f092c36b7f4f": "\\cite{3469440}",
        "2211.03116_a5644e423f785ce4d6c736eb567da752": ", among others",
        "2211.03116_cd2ad40d908b084911e3fd85f5f2c1f8": "Basic research works in the field of self-adaptation are for example",
        "2211.03116_e90b9d33e5a814f92247f065bf59513e": "\\cite{huebscher2008survey,1516533.1516538,cheng2009software,Lemos2013roadmap,weyns2021introduction}",
        "2211.03116_bb1cc79893aaa7491ae58d0fdcc8c339": "In parallel, the principles of feedback control have been studied and applied in industry",
        "2211.03116_580e7218980e56b549c39c9c383e368d": "For example, about two decades ago, IBM launched its legendary initiative on autonomic computing",
        "2211.03116_602e030a5c5eb469e8c54a4436e7d0e9": "\\cite{kephart2003vision}",
        "2211.03116_505df07444b8735d559542e07e89698c": "Inspired by the autonomic nervous system of the human body, the central idea of autonomic computing was to enable computing systems to manage themselves based on high-level goals",
        "2211.03116_0bbb041e33d3a0be6024e4425517252a": "Four classic goals are self-optimisation, self-healing, self-protection, and self-configuration",
        "2211.03116_a2c50777385b5ae14dcbe16e10b149bf": "Autonomic computing delegates the complexity of system operation to the machine aiming to reduce the time required by operators to resolve system difficulties and other maintenance tasks such as software updates",
        "2211.03116_ee818997d4cc384c2b0b7b725f5d96f7": "Over the years, industrial solutions based on feedback loops have found their way to practical applications, for instance in the domain of elastic cloud to adapt computing resources and automated management of server parks to deal with changing business needs, e.g.,",
        "2211.03116_98c029bab5ff8d3b19e400636f82ca56": "\\cite{beyer2016,spyker2020}",
        "2211.03116_2965ffbeab0411bf985f6fdc21661122": "While the output of academic research is documented in research articles, journal volumes, and books, the current practice of self-adaptation in industry has never been systematically described.",
        "2211.03116_afb020f00fcfabbb0d7c7fa29a789280": "Objective and Research Questions",
        "2211.03116_ceac9b3a7921930a2939e55c969035d7": "Our general objective is to better understand the state of practice of self-adaptation in industry",
        "2211.03116_95a410a0b3984cf11c9cb914ffc5be18": "To that end, we perform a large-scale survey with active practitioners",
        "2211.03116_27072f628c2e6b88edde78f30208fbca": "Concretely, this survey aims at shining a light on what motivates practitioners to apply self-adaptation, what kind of problems they solve using self-adaptation, how practitioners design and develop self-adaptive systems, whether they follow any established practices, what difficulties and risks they face in adopting self-adaptation, and what future opportunities industry sees for the application of self-adaptation",
        "2211.03116_a6af288971ddc7588e0c17f4708a4cf1": "To the best of our knowledge, no systematic study has been done that investigates and these issues",
        "2211.03116_52e2190d090946294a5bfd572754cb9a": "Hence, there is no clear and documented view of why and how the principles of self-adaptation are applied in practice, and what challenges practitioners face when realising self-adaptation.",
        "2211.03116_25ab6cb495305f02e2871ed70242e3d2": "Investigating industrial practice on self-adaptation and answering the questions targeted by this study will help narrow the gap between industry and academia",
        "2211.03116_f8186a31710c0c08876ebf41cc9f55f2": "It aims at helping researchers in academia to get a better picture of how self-adaptation is applied in practice, the industrial needs in realising self-adaptation, and what problems practitioners face",
        "2211.03116_d41e074bae3fb94081d7340222b9dc34": "We conjecture that having a better picture about industry practice will help the research community to position their efforts with respect to industrial needs and make well-informed decisions to set future research objectives, both fundamental and applied",
        "2211.03116_8d189b794496e11e6e6fb1db3913169e": "On the other hand, drawing a picture of the state-of-the-practice can also benefit industry by sharing the motivations and potential benefits of self-adaptation, directing them towards relevant sources of information such as best practices, and identifying opportunities for collaboration with researchers to address the problems they face",
        "2211.03116_1df40fbff642f66e6b9fdf331d0af5fd": "We aim to answer the following concrete research questions:",
        "2211.03116_7d74f3b92b19da5e606d737d339a9679": "Item",
        "2211.03116_bf5ffb5cdfec8a6b39ca603ae8029ad5": "What drives practitioners to apply self-adaptation in software-intensive systems?",
        "2211.03116_2f47b4fb96e2b45bdb2985b3af21cbbe": "How do practitioners characterise self-adaptation?",
        "2211.03116_dffc03bd6f84cbc8daec89c1b66bae2a": "How do practitioners apply self-adaptation in industrial software-intensive systems?",
        "2211.03116_7a11db51f65ba5257d418bde529430e6": "What are the experiences of practitioners with applying self-adaptation and do they see opportunities for how and where to apply self-adaptation?",
        "2211.03116_2722d70cc981ad2caec468e3569ef35f": "With RQ1, we want to investigate the motivations of practitioners for applying self-adaptation, the kinds of industrial systems for which self-adaptation is applied, and the types of problems they solve using self-adaptation.",
        "2211.03116_a3adaf1bf271be70bc2ccaff9cb1c6c4": "In academic research, self-adaptation has been proposed for two main complementary problems",
        "2211.03116_8209906d53afa74b68252e1e5ef79df3": "\\cite{weyns2021introduction}",
        "2211.03116_fc87b0258e6a407b5221c748f9541017": ": 1) to automate the management of complex software-intensive systems based on high-level goals provided by operators, and 2) to deal with operating conditions that are hard to predict before deployment and need to be resolved during operation (i.e., mitigating uncertainties)",
        "2211.03116_35621a89add8eab865a3ce783ed5d5d6": "Key management tasks for self-adaptation are self-healing, self-optimisation, self-protection, and self-configuration",
        "2211.03116_1ff6b16abf004bd227d495385d2d2c55": "We want to understand whether industry uses the principles of self-adaptation to deal with the same or different problems, and whether and how they relate to the classic system and software management tasks",
        "2211.03116_bf698e084de95a6973a9d865cf8aa00b": "Answering RQ1 will shine a light on application areas, motivations, and concrete problems for which self-adaptation is applied by practitioners or could be applied by practitioners who currently do not use self-adaptation",
        "2211.03116_3d17ef3af19fd2d3b31b468cc8a3b5d7": "This may provide academics with insights in relevant areas to drive and validate research results on self-adaptation",
        "2211.03116_46532266eb6bd754fef6856a2c79f987": "The results may also indicate applications and problems that are not yet explored in industry and may benefit both academia and industry",
        "2211.03116_433d67d83998d1a94ddd92e6bc6c7c6c": "With RQ2, we aim to investigate the perception of practitioners on the concept of",
        "2211.03116_4b30fa94e9adc20d8f54c10be5cbfbf0": "We are particularly interested in how practitioners characterise self-adaptation as a property that enables a system to adapt itself at runtime.",
        "2211.03116_f22486234080234d0b9cbb9fb0476656": "To that end, we will elicit concrete examples of what they understand by self-adaptation",
        "2211.03116_5a2524aaba8fd7f2cd29019cfd6372f6": "This will give us better understanding of whether and how practitioners understand the concept of self-adaptation, what terminology they use, whether there are any differences in the viewpoints on what constitutes self-adaptation, and whether they consider self-adaptation altogether useful",
        "2211.03116_04dadb45baa9c2f3b77843f0a3f58c00": "This may also shine a light on whether there are any (emerging) industrial standard practices, e.g., a",
        "2211.03116_c5617d3205621e38cba62069e02601c2": "technology stack or tools.",
        "2211.03116_1641549f67cf47554a2fa77b6e6832a1": "Answering RQ2 will help researchers to get a better picture of how practitioners understand the concept of self-adaptation",
        "2211.03116_42f0e35141dc1ffd3ede92fe93694d1d": "On the other hand, the insights may reveal potential opportunities for practitioners to benefit from expertise of other practitioners as well as knowledge developed by researchers",
        "2211.03116_25b2287b04e57f100739429f6b04547f": "With RQ3, we aim at examining how self-adaptation has been realised and used in industry",
        "2211.03116_acced341a0d141789a522783fa98a056": "We are particularly interested in mechanisms, tools, benchmarks, and processes employed in the industry to engineer self-adaptive solutions.",
        "2211.03116_905c9fadd3c3ba3f2c0190eb4ead6644": "We will pay attention to the degree of automation and the role of humans in runtime adaptation as this is commonly considered important for trust in software-intensive systems, see e.g.,",
        "2211.03116_78543599eb26310dffe631f999bd79e0": "\\cite{978-3-030-00761-4-4}",
        "2211.03116_5058f1af8388633f609cadb75a75dc9d": ".",
        "2211.03116_11b68aa7470bd84b12d6607fddc26d27": "Furthermore, we are interested in comparing industrial practices with solutions developed by academics, such as modelling techniques, frameworks, and verification techniques",
        "2211.03116_0c60d5b32faece0e90bf26304561d152": "We also want to understand how practitioners obtain trust in the self-adaptive solutions they employ",
        "2211.03116_5c90701afecf89fff4544e9da0b1ca6f": "Answering RQ3 will provide insights into best practices on how practitioners realise self-adaptation",
        "2211.03116_37eb025c522b75f6e3cf624e01684432": "It will highlight the criteria that practitioners use to apply and realise self-adaptation solutions and may shine a light on to what extent solutions from the research community have been adopted in industry",
        "2211.03116_61c25c2bfdc6a3b0713bc51b9da57840": "These insights will open opportunities for both academia and industry to steer future research and improve practical applications",
        "2211.03116_01d42f48d9d85437d93f8923605c6e4d": "Finally, with RQ4, we want to understand the difficulties and risks, if any, that practitioners experience in the design, implementation, and other engineering activities of self-adaptive systems",
        "2211.03116_29baf0a0adf1402130b27bf49114a5f3": "We also will probe whether practitioners face problems for which they would appreciate support from researchers",
        "2211.03116_40b810108bfdb244969987c47db46d57": "Finally, we elicit opportunities that practitioners see for applying self-adaptation that are not exploited yet",
        "2211.03116_2c5d46c8647bb2bc67e5fe5630da7798": "Answering RQ4 may help to fill the gap between academia and industry",
        "2211.03116_4486c4a6e5f8fcbb80f2e8dbd7ec5d0e": "Furthermore, identifying problems and risks may trigger new collaborative studies to investigate and address these challenges",
        "2211.03116_aff0989ecdfce972aebd368b4bdd8da0": "Such studies are likely to bridge the gap and result in more targeted research and improved industrial applications of self-adaptive systems.",
        "2211.03116_4504e115ba62f77bb8bc8f44070e9b41": "Contributions",
        "2211.03116_e527bdacb0db0edd81d6dc284f57d91b": "By drawing a landscape of the use of self-adaptation in industry, the survey results benefit both researchers and practitioners",
        "2211.03116_d9be6ca3f0073ea2f268716ba4342f62": "Concretely, the contributions of this study are:",
        "2211.03116_a8f65dd93445b90d34246cc201862695": "List (itemize)",
        "2211.03116_4a122607680e96bd07f5cbb7c1982534": "An empirically grounded overview of state-of-the-practice in the application of self-adaptation;",
        "2211.03116_cda4b08bfc0204dbf03b85ca3ddb554a": "Insights for researchers to assess their current research in relation to industrial needs;",
        "2211.03116_0105cea4c18c08997332ca3dd0bdbfb8": "Insights for practitioners to assess the level of their current practice in applying self-adaptation;",
        "2211.03116_a522cdf748464f32040796b81d29fc42": "Additional prospects for applying self-adaptation in practice and opportunities for industry-research collaborations.",
        "2211.03116_6bc9228ed5f7e8fb76e4f5f9cfceeaa9": "Preliminary results of this study were reported in",
        "2211.03116_26d0a42f7729e4321a6cbe0c990eeadf": "\\cite{3524844.3528077}",
        "2211.03116_ba2da4fa054b42e18a6b2c6121d430ea": "That paper only considered a small subset of questions and reported initial results based on one batch of data.",
        "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f": "Outline",
        "2211.03116_2e2d69a7178955d1c78950920f27785d": "In Section",
        "2211.03116_1bd78ccb3159e353366e2824f0ef47bb": "we present the study design with the survey questions and analysis methods used",
        "2211.03116_d2c24d59e0baff4d0155fbdf62590867": "Section",
        "2211.03116_faf9531f93ded226d30210c7b09ddc8a": "presents the results for each research question and provides key insights for each research question",
        "2211.03116_c762eaecf975d0e42c7629a87d1d169f": ", we derive insights from the study results for researchers and practitioners",
        "2211.03116_a759d5b1a7969bc5508607767154a9e8": "discusses threats to validity",
        "2211.03116_1c8865005d77bf339c151bddcc1f75d8": "Finally, we wrap up and conclude in Section",
        "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b": "Research Method",
        "2211.03116_128a8b41e6be654e78c96e41de1e9e39": "In this study we use a survey as research method",
        "2211.03116_541c64f840f64e087929bfd091f00f55": "\\cite{gray2013drr}",
        "2211.03116_ea548b51ac4531246be85d61606575a7": "Subsequently, we discuss the population and sample, the questionnaire, and the data analysis methods we used.",
        "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce": "Population and Sampling",
        "2211.03116_84522cc681651c06e56eff9bb97ea3e4": "Our target population are practitioners that are actively involved in the engineering of industrial software-intensive systems in any domain",
        "2211.03116_df77e31905c23d844a9356d1692b2fc7": "This includes architects, designers, developers, testers, maintainers, operators, and other people who have technical expertise and are actively involved in the development and maintenance of these software systems",
        "2211.03116_4f532f11da55b276d224e05de403909a": "Concretely, we contacted 355 practitioners from a wide variety of companies",
        "2211.03116_03684e31fb5b27415ef50dbde9615010": "via the networks of the researchers involved in this study (i.e., the authors of this paper) to complete the survey",
        "2211.03116_d50162a9db0930e95b07c9df681677fc": "We used two criteria to invite people: (1) participants should be active in different domains that are representative of software-intensive systems, and (2) participants have the required expertise to answer the questions",
        "2211.03116_b6d7cf9269a8a15dc209a9aef36d8ed1": "The invited practitioners were spread over in total 21 countries.",
        "2211.03116_640d5a80ad2250b7fa171f0bf8f599e8": "The invitations were sent by personalised emails in different batches during the period from November 30, 2020 until July 31, 2022",
        "2211.03116_9324857e7793a3016d3b4095a5145e80": "We sent reminders according to a predefined",
        "2211.03116_8a01e310f9e2228d2a753f04eb47c312": "Survey Instrument",
        "2211.03116_935039bd55926e6ea89800fce25ddc97": "The survey used a questionnaire to collect data based on a set of predefined questions",
        "2211.03116_fae9e564278ed1f6d14862813c9cae8c": "Because practitioners are not necessarily familiar with the term self-adaptation, the survey started with a gentle introduction of the core idea of what constitutes a self-adaptive system using basic terminology commonly used in industry, and illustrated this with a few characteristic examples to make it concrete",
        "2211.03116_4bca476802b0b7632f03c76733332b6b": "We used both closed and open questions",
        "2211.03116_257a54fe95896716b20e7078a629e7f4": "Closed questions have a predefined set of answers, such as yes/no, or multiple choice",
        "2211.03116_fa3e0ffd446dd220b5bee3fe329c8c98": "We also allowed participants to add extra options for answering several closed questions using a text field",
        "2211.03116_729a5f764731d37ad571e1c9ffa3a9a0": "Open questions provide a space that participants can use to provide an answer",
        "2211.03116_aeb9dc4eec8736d48764010a13dc98f0": "While closed questions allow acquiring a clear view on a particular topic using basic statistics, open questions allow acquiring in-depth insights using qualitative analysis",
        "2211.03116_694f254b730d46291694c6bc878b5733": "We provide a replication package with all study materials, including the study protocol, the questionnaire, the raw data, and the analysis results.",
        "2211.03116_7f11be890de36955b36bf4e01d656f44": "For this study we used a self-administered anonymous online questionnaire (Survey",
        "2211.03116_cda6fb9c44d4f4c749a283ce1e3895c8": "Report hosted by Linnaeus University, Sweden).",
        "2211.03116_67a42c76da6fa3c913c06100f08aff5c": "The main motivation to use an online questionnaire is to involve a large set of participants with relatively low cost (both time-wise and financially).",
        "2211.03116_f97fef819f89632f048844ae13b10322": "We created an initial list of survey questions that were directly derived from the research questions of this study",
        "2211.03116_3f8cc8b95df0ce577ac0acf86fe81dad": "The initial list of questions was composed by two members of the research team and then crosschecked by the other team members",
        "2211.03116_5f1e4b440d128b7da0696bbb39fe47dd": "We validated the questionnaire in a pilot with eight randomly-selected participants from the target population",
        "2211.03116_338f5c0d496c355891e0ac1aff7203d1": "For this pilot, we added additional meta-questions to the questionnaire about clarity of terminology and questions, relevance of the questions, scope of the questions, and the time required to complete the survey",
        "2211.03116_39e663d84ec7021201ecef2cea132f32": "For both clarity of terminology and clarity of the questions we obtained an average score of 4.38 on a scale from 1 (Not clear at all) to 5 (Very clear)",
        "2211.03116_d8c70bbf6e0bb81eaef3b3b10aaef7dc": "None of the participants indicated that questions should be removed or modified",
        "2211.03116_4541d43a0df4cb20517f9f85788bdcd5": "Six participants indicated that no important aspects were missing",
        "2211.03116_91791d9acfab3396bb8d5d9d9336a365": "One participant hinted that we may also probe whether the use of self-adaptation requires a specialised team in the company or alternatively infrastructure to share knowledge",
        "2211.03116_3f7f0233f909727ea8252fb24df5868c": "Another participant suggested adding a question about scalability of solutions for self-adaptation",
        "2211.03116_a7a327cd75f17a8d95df867f16c605a5": "One participant stated that the example system we used to introduce self-adaptation may create some bias, and further that answers to questions may differ depending on roles on the engineering teams",
        "2211.03116_c0a55d14230ab1c4c233cabfebcefbfb": "The average reported time to complete the survey was 24 minutes",
        "2211.03116_22497900298374b5b5244be6f93d2a4f": "Based on the feedback, we adjusted the introductory part of the questionnaire",
        "2211.03116_2943a325e91636494b06402c79bfcf78": "We did not revise the questions as they were perceived as clear and well scoped",
        "2211.03116_3fbc47062d4ba1be3eaf64fb67602d0f": "The finalised questionnaire was then distributed to the participants as explained above",
        "2211.03116_6fad98098213b276b036514d42449ecf": "The first part of the questionnaire (Table",
        "2211.03116_dd69f840de8d4c40d2206f636f8724d6": ") solicited whether the participant applies self-adaptation and collected general demographic information",
        "2211.03116_eb325ae53f6e55224f790c6bfc28aea7": "This allowed us to check whether the participant had experience with self-adaptation (Q0.1), confirm a good coverage of kinds of software-intensive systems across participants (Q0.2), the size of the companies of participants (Q0.3), as well as a confirmation of the participant's role (Q0.4) and years of experience (Q0.5).",
        "2211.03116_acb34a561422b2a9a0281782faa41b1d": "\\begin{table}[!h]\n\\caption{Questionnaire: Demographic information}\n\\label{tab:demographics}\n\\begin{tabular}{lp{6.6cm}p{5.4cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ0.1 & Have  you  worked  with  concrete  self-adaptive  systems? & Yes; No \\\\\nQ0.2 & What kind of software systems does your organisation build? & Free text \\\\\nQ0.3 & Approximately, how many people are working on engineering software in your organisation? & 1-10; 11-20; 21-50; 51-100; more than 100\\\\\nQ0.4 & What is your role in your organisation? & Project Manager; Designer; Programmer; Tester; Operator; Maintainer; Other (free text)\\\\\nQ0.5 & How many years of software engineering experience do you have in total? & 1-3 Years; 4-8 Years; 9-20 Years; If other, please specify (free text) \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_0244280b34d5151045e0c201fa9b4816": "\\begin{table}[hbt]\n\\caption{Questionnaire -- demographic information (Q0.1-Q.4, Q0.6-Q0.8: single choice; Q0.5: multiple choice)}\n\\label{tab:demographics}\n\\begin{tabular}{lp{3.5cm}p{4cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ0.1 & When answering this questionnaire, do you consider yourself as a software engineering researcher or practitioner? & Researcher; Practitioner; Both\\\\\nQ0.2 & How many years have you worked in the software industry? & 0; $<$1; 1-3; 4-5; 6-10; $>$10 \\\\\nQ0.3 & How many years have you worked in academia? & 0; $<$1; 1-3; 4-5; 6-10; $>$10 \\\\\nQ0.4 & What is your primary software engineering field of expertise? & Requirements engineering; Architecture/design; Programming languages; Software testing; Evolution and maintenance; Software processes; Empirical software engineering; Other (free text) \\\\\nQ0.5 & Have you ever served as a reviewer for the following software engineering journals or conferences?  & Conferences: ASE; EASE; ECOOP; ESEC/FSE; ESEM; GPCE, ICPC, ICSE; ICSME; OOPSLA/SPLASH; RE; Journals: ACM Transactions on Software Engineering and Methodology; Empirical Software Engineering; IEEE Software; IEEE Transactions on Software Engineering; Information and Software Technology; Journal of Systems and Software\\\\\nQ0.6 & Have you ever published an empirical study? & Yes; No\\\\\nQ0.7 & Have you ever reviewed an empirical study? & Yes; No\\\\\nQ0.8 & In your opinion, is empirical research in software architecture different to empirical research in other fields of software engineering? & Yes; No; I don't know\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_ffb552c166489117b70a9eb5480bb5fa": "The second part of the questionnaire aimed at questions related to RQ1 collecting data about the problems for which the participants apply self-adaptation (Q1.1), the main business motivations for using self-adaptation (Q1.2), and the benefits obtained from applying self-adaptation (Q1.3) (see Table",
        "2211.03116_9371d7a2e3ae86a00aab4771e39d255d": ")",
        "2211.03116_9e76bbca0e1afcabebfc092ff71886b9": "The first two questions had multiple options.",
        "2211.03116_e34a728b74b75faf3d11045eb37d3aa1": "\\begin{table}[hbt]\n\\caption{Questionnaire: Drivers for applying self-adaptation in industrial software-intensive systems (RQ1)}\n\\label{tab:rq1}\n\\begin{tabular}{lp{6.6cm}p{5.4cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ1.1 & For which problems do you or your organisation apply self-adaptation capabilities, i.e., a managing system that monitors and adapts a managed system to achieve some objectives? & To automate tasks; To deal with changes in the environment; To deal with changes in business goals; To optimise system performance; To detect and resolve errors; To detect and protect a system against threats; To configure/reconfigure a system; Other (free text)\\\\\nQ1.2 & What are the main business motivations for you or your organisation to apply self-adaptation? & To improve user satisfaction; To reduce costs; To mitigate risks; To open up new application opportunities; Other (free text)\\\\\nQ1.3 & What could be the benefit of self-adaptation in one of the systems you worked with? Please explain briefly. & Free text\\\\\n\n%Q1.6 & Novice researchers might find it useful to start with one particular research method, namely... & ... Systematic literature review; Mapping study; Experiment; Case study; Survey; I disagree with this statement independent of the method; I don't know; Other (free text)\\\\\n\n \\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_e3c401910b4e846c600106e0f54d51ca": "The third part of the questionnaire covered a question related to RQ2 on how practitioners characterise self-adaptation (see Table",
        "2211.03116_478e8b88ba6e2af39aa872754b29cd38": "This part included only one question that asked participants to describe a concrete self-adaptive system they had worked with (Q2.1).",
        "2211.03116_dff1cdc7684710777f497c020ab372d7": "\\begin{table}[hbt]\n\\caption{Questionnaire: How practitioners characterise self-adaptation (RQ2)}\n\\label{tab:rq2}\n\\begin{tabular}{lp{8.6cm}p{3.4cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n%Q2.1 & Have you worked with concrete self-adaptive systems? & Yes; No\\\\\nQ2.1 & Think of a concrete self-adaptive system you worked with. Name this system and briefly explain its purpose (please use this system to answer the following three questions) & Free text\\\\\n\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_53c4f3b4d435ce9cc01cd3cf17f44806": "\\begin{table}[h!]\n\\caption{Questionnaire: How self-adaptation is applied in industrial software-intensive systems (RQ3)}\n\\label{tab:rq3}\n\\begin{tabular}{lp{8.6cm}p{3.4cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ3.1 & What mechanisms or tools does the self-adaptive system you worked with use to monitor a managed system during operation? By monitor, we mean tracking properties of the system or its environment. & Free text\\\\\nQ3.2 & What mechanisms or tools does the self-adaptive system you worked with use to analyse conditions of a managed system during operation? By analyse, we mean examining conditions of the system or its environment and determining whether any adaptation is required or not. & Free text\\\\\nQ3.3 & What mechanisms or tools does the self-adaptive system you worked with use to change a managed system or parts of it during operation? By change, we mean adjusting parameters of the system, or adding, removing or changing any parts of it. & Free text\\\\\nQ3.4 & What is the degree of automation of the majority of the self-adaptive solutions you work with in your organisation? & Semi-automated; Fully automated; Mixed (Semi and Fully Automated); Other (free text)\\\\\nQ3.5 & Do you reuse solutions to realise self-adaptation in systems you work with? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always \\\\\nQ3.6 & Please provide a concrete example of reuse you used to realise self-adaptation? & Free text \\\\\nQ3.7 & Why do you not often reuse solutions when realising self-adaptive systems? What hinders the reuse, please provide a short answer. & Free text\\\\\nQ3.8 & How do you ensure that you can trust the self-adaptive solutions you build? Examples could be extensive testing or human supervision, but you may use other means. Please describe briefly. & Free text\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_4e602ff5f827daef61de4fa1d9e8c077": "\\begin{table}[hbt]\n\\caption{Questionnaire: How self-adaptation is applied in industrial software-intensive systems (RQ2) (systems, mechanisms)}\n\\label{tab:rq2}\n\\begin{tabular}{lp{6cm}p{1cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ2.1 & Have you worked with concrete self-adaptive systems? & Yes; No\\\\\nQ2.2 & Think of a concrete self-adaptive system you worked with. Name this system and briefly explain its purpose (please use this system to answer the following three questions) & Free text\\\\\nQ2.3 & What mechanisms or tools does the self-adaptive system you worked with uses to monitor a managed system during operation? By monitor,we mean tracking properties of the system or its environment. & Free text\\\\\nQ2.4 & What mechanisms or tools does the self-adaptive system you worked with uses to analyse conditions of a managed system during operation? By analyse, we mean examining conditions of the system or its environment and determining whether any adaptation is required or not. & Free text\\\\\nQ2.5 & What mechanisms or tools does the self-adaptive system you worked with uses to change a managed system or parts of it during operation? By change, we mean adjusting parameters of the system, or adding, removing or changing any parts of it. & Free text\\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_6eedd38cf2c8486eaa7fb23a6068bca1": "\\begin{table}[hbt]\n\\caption{Questionnaire: How self-adaptation is applied in industrial software-intensive systems (RQ2) (automation, reuse, trust)}\n\\label{tab:rq2}\n\\begin{tabular}{lp{4.4cm}p{2.6cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ2.6 & What is the degree of automation of the majority of the self-adaptive solutions you work with in your organisation? & Semi-automated; Fully automated; Mixed (Both Semi and Fully Automated); Other (free text)\\\\\nQ2.7 & Do you reuse solutions to realise self-adaptation in systems you work with? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always \\\\\nQ2.8 & Please provide a concrete example of reuse you used to realise self-adaptation? & Free text \\\\\nQ2.9 & Why do you not often reuse solutions when realising self-adaptive systems? What hinders the reuse, please provide a short answer. & Free text\\\\\nQ2.10 & How do you ensure that you can trust the self-adaptive solutions you build? Examples could be extensive testing or human supervision, but you may use other means. Please describe briefly. & Free text\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_32f70504912f4495ed4fa3c88246a107": "\\begin{table}[hbt]\n\\caption{Questionnaire: How self-adaptation is applied in industrial software-intensive systems (RQ3) (risks, challenges)}\n\\label{tab:rq2}\n\\begin{tabular}{lp{4.4cm}p{2.6cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ2.11 & Did you encounter particular difficulties or challenges when engineering or maintaining self-adaptive systems you worked with? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always\\\\\nQ2.12 & Please give one or two examples of the difficulties or challenges that you encountered when engineering or maintaining self-adaptive systems.  & Free text\\\\\nQ2.13 & Did you face any risks when engineering self-adaptive systems you worked with? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always\\\\\nQ2.14 & Please briefly describe one or two risks that you faced when engineering self-adaptive systems. & Free text\\\\\nQ2.15 & 8.Have you faced or seen any problems of self-adaptation for which you would appreciate support from researchers? & Free text\\\\\nQ2.14 & Please briefly describe one or two risks that you faced when engineering self-adaptive systems. & Free text\\\\\nQ2.15 & How did you mitigate the risks that you faced? Please explain briefly. & Free text\\\\\nQ2.14 & Please briefly describe one or two risks that you faced when engineering self-adaptive systems. & Free text\\\\\nQ2.15 & How did you mitigate the risks that you faced? Please explain briefly. & Free text\\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_9b76b722e6a22cf713622b815dd53a04": "The fourth part of the questionnaire addressed RQ3 on how practitioners apply self-adaptation in their practice (see Table",
        "2211.03116_3c9bbcc6a710203e0bfc893b2cdc0d4d": "The first three questions investigated the mechanisms that participants use to monitor (Q3.1) and analyse (Q3.2) the system during operation, and change the system when needed (Q3.3)",
        "2211.03116_3a210ea55590946f36cbb834ea0ea4f0": "The next question investigated the degree of automation of self-adaptation (Q3.4)",
        "2211.03116_1860d75ad8434f077f5f7729ad42b887": "The next three questions investigate reuse of solutions (Q3.5-Q3.7)",
        "2211.03116_2ea23c11384a9af8cceaa0b85f2e0d4a": "The last question of this part of the questionnaire probed whether and how practitioners establish trust in the self-adaptation solutions they build (Q3.8).",
        "2211.03116_2651185d34d384d00cf1017d093a5b7f": "\\begin{table}[h!]\n\\caption{Questionnaire: Risks, challenges, and opportunities when applying self-adaptation in practice (RQ4)}\n\\label{tab:rq4}\n\\begin{tabular}{lp{8.6cm}p{3.4cm}}\n\\hline\\noalign{\\smallskip}\nID & Question & Response options\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nQ4.1 & Did you encounter particular difficulties or challenges when engineering or maintaining self-adaptive systems you worked with? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always\\\\\nQ4.2 & Please give one or two examples of the difficulties or challenges that you encountered when engineering or maintaining self-adaptive systems.  & Free text\\\\\nQ4.3 & Did you face any risks when engineering self-adaptive systems you worked with? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always\\\\\nQ4.4 & Please briefly describe one or two risks that you faced when engineering self-adaptive systems. & Free text\\\\\nQ4.5 & How did you mitigate the risks that you faced? Please explain briefly. & Free text\\\\\nQ4.6 & Have you faced or seen any problems of self-adaptation for which you would appreciate support from researchers? & Never; Very Rarely; Rarely; Sometimes; Frequently; Very Frequently; Always\\\\\nQ4.7 & For which problems of self-adaptation would you appreciate support from researchers? Please briefly explain one or two such problems. & Free text\\\\\nQ4.8 & In your organisation or in industry in general, do you see application opportunities for self-adaptation that are currently not exploited? & Yes; No\\\\\nQ4.9 & Please describe or give examples of the application opportunities for self-adaptation that are currently not exploited. & Free text\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_c79bc6dfc1e541cb7b69665b068084d2": "Finally, the fifth part of the questionnaire addressed RQ4 on difficulties, risks, and opportunities of applying self-adaptation in practice (see Table",
        "2211.03116_991446b5062940197653c9e6fb35484b": "The first two questions investigated difficulties (Q4.1 and Q4.2); the next three questions focused on risks and risk mitigation (Q4.3-Q4.5)",
        "2211.03116_1150d552769155044e5d9f2e713553c5": "The next two questions probed the interest of practitioners to get support from researchers for solving problems with self-adaptation (Q4.6 and Q4.7)",
        "2211.03116_381e9d0bb15dbc7bc15e3da5c84273f7": "The last two questions investigated opportunities for applying self-adaptation beyond the current practice (Q4.8 and Q4.9).",
        "2211.03116_9be6f36acb04ffd449925044303cf71e": "The questionnaire concluded with a question (Q5.1) about how confident participants were in general about the answers they gave when answering the survey questions with possible answers: Very confident; Confident; Sufficiently confident; Neutral; Somewhat unconfident; Not confident; Not confident at all.",
        "2211.03116_323d6a1348df47d3174f578e1eff00eb": "Data Analysis",
        "2211.03116_01fc9f1a1b8d9a7f6c91e8a3547881e4": "To analyse closed questions, we used descriptive statistics and quantitative data analysis",
        "2211.03116_a3f29047d706567e5bf07cf2661334ab": "Therefore, we mostly report frequencies of answers, percentages relative to the respective number of responses, and relationships between answers to questions based on contingency matrices (based on the categorisation of answers)",
        "2211.03116_9db05e1117cd9433875dd3f00bddb994": "We only report relationships that led to relevant insights",
        "2211.03116_1c89f7e50493ef113b93d7d5da9e7bb0": "To analyse comments to open questions, we used qualitative data analysis",
        "2211.03116_e01b34f47ddb3728a9fc2d9b43677958": "In particular, we used inductive reasoning to construct codes and infer categories from the data by labelling occurrences of codes and grouping them into categories",
        "2211.03116_995712d2bac2412a997f1665d9391480": "\\cite{Stol2016}",
        "2211.03116_d26f48ae9c1f9ff56c48ad8e531ed963": "Similar to others (e.g., Prechelt et al.",
        "2211.03116_f410c47495523d7a73c630eec74f1291": "\\cite{Prechelt2018}",
        "2211.03116_89742f76fd2c3912da9d9477f4e763e9": "), we tried to keep coding simple",
        "2211.03116_94d7abc706b81a3667ad01556ada9bab": "We did not have a pre-defined coding schema or a pre-defined granularity or semantic style for the codes",
        "2211.03116_4cf89614f028fdf3990df4b2931e9556": "However, we interpreted comments in the context of the question for which they were given",
        "2211.03116_d12c58dd87a860f22345ad4918d26e61": "We used a simple version of open coding",
        "2211.03116_18b466a262a4f85f9dc9320dcb439d06": "\\cite{Strauss1990}",
        "2211.03116_a758dbb271975f94b66819f6f4cfe412": "Similar to Mendez Fernandez et al.",
        "2211.03116_1d832d14cea94a099012da78db2bc410": "\\cite{Fernandez2016}",
        "2211.03116_41687a7c038e7f54ac1444a9745125d7": ", we used open coding to add codes to small coherent fragments of the comments",
        "2211.03116_18d8fcf0319201b17aa1d243c67aa511": "We then categorised the developed concepts in a hierarchy of categories as an abstraction of the codes",
        "2211.03116_ad3391d79c54c380b45ed8d5e05861f1": "We coded in sub-teams of two or three coders in total 886 comments of 12 open questions",
        "2211.03116_334252ac8dcedffe068be50c0f777b6e": "Coding was first done individually and then consolidated in the sub-team",
        "2211.03116_d2826781a7d5735555b215a7606a6b26": "Two other researchers crosschecked the consolidated coding",
        "2211.03116_179d7d0d29bf685e0f18065db98405db": "Where necessary, the coding was adjusted in consensus between the sub-team and the researchers",
        "2211.03116_fcf2822d81515b5905e57a18535a8837": "We excluded some comments from coding, e.g., if they did not provide any additional insights or if they were too generic, e.g., a participant answering",
        "2211.03116_68eec46437c384d8dad18d5464ebc35c": "Always",
        "2211.03116_2df999f7cc4d968af5004e2b379654cd": "to a closed question and stating",
        "2211.03116_962b77f1bec7dd116fa9f581e8711fd3": "This is how we work",
        "2211.03116_e41ee2734bd4234c628bdf6dde0928d9": "in the comments",
        "2211.03116_26ff6184d5d08477035fb47f696f748b": "Also, we did not map the answers to a closed question to comments for that question",
        "2211.03116_88ddaa915b856a911097e513e74859ac": "For example, a participant may have answered that they never reused solutions for self-adaptation, but in their comments indicated reasons that they",
        "2211.03116_ad88adbdac50799a3bc8c02b217c6f76": "might",
        "2211.03116_7a32333ff8605ec668a651d845ab11a3": "do so (i.e., one comment may cover several concepts, which may not necessarily match the answer to the closed question)",
        "2211.03116_0f841f01f3645307bdb24fde42b3ea7a": "When reporting example quotes from comments in Section",
        "2211.03116_72a0be2806a30f53d9c0cbfba6b76db4": ", we use verbatim excerpts, including spelling and punctuation errors.",
        "2211.03116_fd69c5cf902969e6fb71d043085ddee6": "Results",
        "2211.03116_27571e5f33e0d3700aa1bb218ad08e71": "Demographic Information",
        "2211.03116_aa6bac568639f744386a483dbbbb0cab": "In total, 184 participants completed the survey from 355 invitations, i.e., a response rate of 51.8",
        "2211.03116_7418974a3abb3c41c5d001c9cdc042af": "Based on the answers to the first question (Q0.1), we split the answers of the other questions of the demographics in two groups: those provided by all participants and those provided by participants that worked with concrete self-adaptive systems.",
        "2211.03116_0a2ed9047e5bafedc798458470705f3e": "Experience with self-adaptation (Q0.1):",
        "2211.03116_eaf1dd8dfa3390252f1ca286629951b9": "Of the 184 participants that provided valid data, 100 (54.4",
        "2211.03116_3e31324191c91f35ae1b52dba9c2170b": ") expressed to have worked with concrete self-adaptive systems.",
        "2211.03116_ea34a9aacfe331886e927c86bfea8a5f": "Software systems built by organisations (Q0.2):",
        "2211.03116_460fe70794d3801c3b0f5f6e64fbb152": "Almost all participants (181, 98.4",
        "2211.03116_e29d65b9fed4dc4be622bbc6b6a8f844": ") provided a valid description of the kind of systems they build",
        "2211.03116_255bff050fe5417305d97c6baa3d4b3c": "Based on the analysis of the data we could classify the answers along two axes: the",
        "2211.03116_77a3c1689d60a7a7bb7cf5dff2ef5262": "of software systems built by the organisations, and the",
        "2211.03116_f9b5dfcd7b8a7d0ad235428144eaa74f": "of the software systems",
        "2211.03116_f6c29d45716c56e64735376991fde4fe": "The type refers to the domain, while the focus refers to the activities on which the organisation concentrates within the domain",
        "2211.03116_43a977b3008988a3526a8b1a2b198864": "For example, automation (focus) within manufacturing (type)",
        "2211.03116_8ee35e3d1efe2cd41f03df8e884593ba": "Note that the domain may be abstract, e.g., embedded systems or communication and networks",
        "2211.03116_46aefbc0e4c7d2fa576d7bfd584ef790": "Focus on the other hand may refer to purpose, such as analytics, but also specific technologies or methods, such as machine learning",
        "2211.03116_666df2f48cd16f38212c093999248769": "Figure",
        "2211.03116_488cb6928a5f64178c2a46edb1979cb9": "summarises the types of systems we identified",
        "2211.03116_f2723b83c2aafa6983a0701a74715c5a": "The most frequent types are web/mobile, embedded, cyber-physical, IoT systems, data management, and cloud (together these four types represent 52.5",
        "2211.03116_ff1cb1c60c9f5ab90ec3dc0f81430149": "of all systems)",
        "2211.03116_70b072efc492029a33a567dcc5fa18c8": "Sixteen participants (8.8",
        "2211.03116_7d948e1f4dd831e78777575def4f41f4": ") built various types of systems.",
        "2211.03116_93c6d71f12ae70bcdd79fb194468686a": "The results show that the percentages of the types of systems of all participants and those that worked with self-adaptation are similar",
        "2211.03116_c2366059cf32931cfc22ac16ee63dc2a": "In addition to the types of systems, 104 participants (56.5",
        "2211.03116_dd80d51029ae18d1a5e5f38e137315eb": ") also provided insights in the focus of the systems they build",
        "2211.03116_caec758d0b77b4c87f32c9b6a1d4e61e": "Among the 100 participants that worked with self-adaptation, 60 provided a description of the focus.",
        "2211.03116_5d60f76153e23febedae8a343fbb6cbc": "provides an overview the results",
        "2211.03116_4edb63a20b563058fc3fc43aef8e56ef": "The dominant focus is monitoring, analytics and control, representing 27.4",
        "2211.03116_d720dc83baa3886589fdd1e2e85933ae": "of the foci described by the participants",
        "2211.03116_dbabe2f82d465e9a4b72d8b84ec5b7d4": "Other key foci are services (21.7",
        "2211.03116_cce62a8c7241facab9017abf66d381af": "of the participants that described the focus of the systems they built) and quality and security (14.2",
        "2211.03116_ce96ce64475d88003b81a20710c10f5e": ").",
        "2211.03116_8a40db0d67bdbe5bb0ad6a8c0cc446a4": "Overall, the variety in the types of systems built by the participants and the different foci in activities underpins the representativeness of the data collected during the survey.",
        "2211.03116_87147ebfadf5c00e0d193a3803d3f93c": "\\begin{table}[h!]\n\\centering\n\\caption{Types of software systems build by organisations (Q0.2).}\n\\label{tab:contingency_q1-1-types}\n\\begin{tabular}{llc}\n\\hline\\noalign{\\smallskip}\nTypes of system %& Focus \n& All (of 184) &  With self-adaptation (of 100) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n    Web/mobile & 35 (19.3\\%) & 15 \\\\\n    \n    Embedded/CPS/IoT & 24 (13.3\\%) & 13 \\\\\n    \n    Data management & 21 (11.6\\%) & 10 \\\\\n    \n    Cloud &  15 (8.3\\%) & 11 \\\\\n    \n    Transportation & 13 (7.2\\%) & 9 \\\\\n%& Multi-facet & 4 \\\\\n% & Automation & 3 \\\\\n% \\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n    Communication \\& networks & 11 (6.1\\%) & 7  \\\\\n%& Multi-facet & 4 \\\\\n% & Distributed ledger & 1 &\\\\\n% & Cloud & 1 \\\\\n% \\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n    IT infrastructure & 11 (6.1\\%) & 7 \\\\\n %& Multi-facet & 3 \\\\\n % & Services & 2 \\\\\n %& Cloud & 1 \\\\\n    Manufacturing & 10 (5.5\\%) & 8 \\\\\n %& Multi-facet & 3 \\\\\n % & Services & 2 \\\\\n %& Cloud & 1 \\\\\n    Finances & 8 (4.4\\%) & 5 \\\\\n \n    e-commerce & 7 (3.9\\%) & 3 \\\\\n     \n     Public/society  & 3 (1.7\\%) & 1 \\\\\n     \n     Others & 7 (3.9\\%) & 3 \\\\\n \n     Various & 16 (8.8\\%) & 8 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_993ae58197d980f57dc570deb391d8d9": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=\\columnwidth]{Q0.2-Type-fig.pdf}\\vspace{-10pt}%%%\n\\caption{Types of software systems build by organisations (Q0.2).}\\vspace{-10pt}%%%\n\\label{tab:q1-1-types}\n\\end{figure}",
        "2211.03116_99d4a49301bdf09d875d5c0e99a03dbd": "\\begin{table}[hbt]\n\\centering\n\\caption{Focus of software systems build by organisations (Q0.2). %Percentages refer to participants that provided descriptions.\n}\n\\label{tab:contingency_q1-1-focus}\n\\begin{tabular}{llc}\n\\hline\\noalign{\\smallskip}\nFocus of system %& Focus \n& All (of 104) &  With self-adaptation (of 60) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n    Monitoring/analytics/control & 29 (27.4\\%) & 16 (26.7\\%)\\\\\n    \n    Services & 23 (21.7\\%) & 11 (18.3\\%)\\\\\n    \n    Quality/security & 15 (14.2\\%) & 9 (15.0\\%)\\\\\n    \n    Management &  13 (12.3\\%) & 7 (11.7\\%)\\\\\n    \n    Apps & 10 (9.4\\%) & 6 (10.0\\%)\\\\\n    Automation & 9 (8.5\\%) & 5 (8.3\\%)  \\\\\n%& Multi-facet & 4 \\\\\n% & Distributed ledger & 1 &\\\\\n% & Cloud & 1 \\\\\n% \\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n    Machine learning/AI & 7 (6.6\\%) & 6 (10.0\\%)\\\\\n %& Multi-facet & 3 \\\\\n % & Services & 2 \\\\\n %& Cloud & 1 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_761533a3292279f6b8e560c7a3dd6506": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.9\\columnwidth]{Q0.2-Focus-fig.pdf}\n\\vspace{-10pt}%%%\n\\caption{Focus of software systems built by organisations (Q0.2).}\\vspace{-10pt}%%%\n\\label{tab:q1-1-focus}\n\\end{figure}",
        "2211.03116_3201bda4968dcc98b9006123a5a25f01": "Software engineers working at companies (Q0.3):",
        "2211.03116_608a7b99975f80b9e4802b2c2a453541": "summarises the results of the number of software engineers that work at the companies of the participants",
        "2211.03116_5fd984b0114e0cd5e7891888e30d15c0": "About half of the companies have more than 100 employees who work as software engineers",
        "2211.03116_44495a42106872aa9a065c4f2e157d64": "The other half is about equally divided over four categories of companies with between 1 and 100 software engineers",
        "2211.03116_5255c60934c7e542df0a1e03e9f54ead": "The results are similar for all participants and those that have worked with self-adaptive systems",
        "2211.03116_6a2ceefdac169b9c357e61769eb7e9d7": "The numbers show that we collected data from participants of companies with a significant number of software engineers, i.e., people dedicated to building software-intensive systems (because our study is interested in the engineering of software-intensive systems, we collected the number of software engineers at the companies and not the total number of employees as a measure for size).",
        "2211.03116_100defb45b302bd23ae2af93a9d008dc": "\\begin{table}[hbt]\n\\centering\n\\caption{Size of companies (Q0.3).}\n\\label{tab:q0-2}\n\\begin{tabular}{llc}\n\\hline\\noalign{\\smallskip}\nSize & All (0f 184) & With self-adaptation (of 100)\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n 1-10 & 24 (13.0\\%) & 9 \\\\\n11-20 & 17 (9.2\\%) & 13 \\\\\n 21-50 & 29 (15.8\\%) & 11 \\\\\n51-100 & 24 (13.0\\%) & 14 \\\\\n$>$ 100 & 90 (48.9\\%) & 53  \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_50e94a1aa57b823f98a901d01de4e338": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.7\\columnwidth]{Q0.3-fig.pdf}\\vspace{-10pt}%%%\n\\caption{Size of companies (Q0.3).}\\vspace{-10pt}%%%\n\\label{fig:q0-3}\n\\end{figure}",
        "2211.03116_28007869a6f177a4c6145d99a7d1ec3e": "Roles of participants in their organisation (Q0.4):",
        "2211.03116_5686666f285a1b88442c5f87258c1746": "The role(s) that participants have in their company are summarised in Figure",
        "2211.03116_1e63f59f45e99ac8c997e8330bb1205e": "Of 184 participants, 129 indicated that they have one role in their organisation",
        "2211.03116_45e82afb601ca6ff424124f8b2f7fbb8": "The other participants indicated that they have two or more roles",
        "2211.03116_1098fa7bdda55baa81f2e6ddb413fc52": "Overall, the participants reported on average 1.6 roles in their company",
        "2211.03116_87fdc9efbab296bea4b4e6a241d626e6": "The participants that worked with self-adaptation reported on average 1.5 roles",
        "2211.03116_97e4e2d8ec66f3dfade6d23baf19fc85": "The most frequent roles are programmer and project manager/coordinator, each representing over 40",
        "2211.03116_a4b61edcca927970cf14a9f554e7526f": "of the participants",
        "2211.03116_421de78c51f7d57671b367e425179e01": "About one in three participants works as a designer or architect",
        "2211.03116_2828889d7efbb0f8688d02cd68b2c185": "The representation of the other roles is lower in the sample",
        "2211.03116_03034feaec6ac3a3ec68551eb2d54a82": "The relative numbers for the roles of all participants and those that work with self-adaptive systems are again similar",
        "2211.03116_821ceb1e53359a216a7058a1ca1036ed": "One exception is researcher: 9 of the 10 participants that work as researcher have worked with self-adaptive systems",
        "2211.03116_d08b44ae70c7ba2877c79ab4dc497303": "The results show that we collected data from participants with a broad range of key software engineering roles in industry.",
        "2211.03116_f92b39e6f84f0b8927070226fa794ad9": "\\begin{table}[hbt]\n\\centering\n\\caption{Roles of participants in their companies (Q0.4).}\n\\label{tab:q0-3}\n\\begin{tabular}{llc}\n\\hline\\noalign{\\smallskip}\nRole & All (of 184) & With self-adaptation (of 100) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nProgrammer & 84 (45.7\\%) & 44 \\\\\nProject manager/lead & 76 (41.3\\%) & 40 \\\\\nDesigner/architect & 54 (29.3\\%) & 28 \\\\\nMaintainer & 18 (9.8\\%) & 7 \\\\\nSpecific expert & 18 (9.8\\%) & 8\\\\\nTester & 16 (8.7\\%) & 8 \\\\\nOperator & 10 (5.4\\%) & 5 \\\\\nResearcher & 10 (5.4\\%) & 9 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_f8c7112dce3dd66555550e8370761b1b": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.9\\columnwidth]{Q0.4-fig.pdf}\\vspace{-10pt}\n\\caption{Roles of participants in their companies (Q0.4).}\n\\label{fig:q0-4}\n\\end{figure}",
        "2211.03116_56744c5f5bcb735eadf31cf4157c7315": "Experience of participants (Q0.5):",
        "2211.03116_8638944292577f278df11b558ed472b1": "summarises the years of experience of participants as software engineers.",
        "2211.03116_1e852e25f667d6102a2417e36d7fab67": "A majority of the participants have at least 9 years of experience as software engineer; i.e., 69.6",
        "2211.03116_69aa870fdf9addb53c897996547d7a98": "of the total sample and 76.0",
        "2211.03116_f44cefb0b31400162b17fc97ba2ddc49": "of the practitioners that worked with self-adaptation",
        "2211.03116_c49eb459ee19a55b26f0d29661b14dda": "The distributions for all the participants and those that worked with self-adaptation are similar",
        "2211.03116_ffea9b7e88b0e0881008bc074816bdde": "The numbers show that most participants of the survey are experienced software engineers.",
        "2211.03116_6c14d8fb93b6bfa2f4983753387935a0": "\\begin{table}[hbt]\n\\centering\n\\caption{Software Engineering experience of participants (Q0.5).}\\vspace{-5pt}\n\\label{tab:q0-4}\n\\begin{tabular}{llc}\n\\hline\\noalign{\\smallskip}\nExperience (years) & All (of 184) & With self-adaptation (of 100) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n 1-3 & 20 (10.9\\%) & 6 \\\\\n4-8 & 36 (19.6\\%) & 18 \\\\\n 9-20 & 83 (45.1\\%) & 46 \\\\\n$>$ 20 & 45 (24.5\\%) & 30 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_f376e58e6dde20d27beb47e910c0a0c1": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.7\\columnwidth]{Q0.5-fig.pdf}\\vspace{-10pt}\n\\caption{Software Engineering experience of participants (Q0.5).}\n\\label{fig:q0-5}\n\\end{figure}",
        "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7": "Drivers for Applying Self-Adaptation (RQ1)",
        "2211.03116_506688c22094ce65f9d63e4b81944916": "We now analyse the data that we collected for answering RQ1",
        "2211.03116_d9e2678b382a3584038c61f13423baa5": "This research question focuses on the drivers of practitioners for applying self-adaptation and the types of problems they solve using self-adaptation",
        "2211.03116_9ac41c2ce8f4dec7a0b4ba39eb6df90c": "Note that the data used to answer RQ1 comes from the 100 participants that have experience with concrete self-adaptive systems (i.e., the participants that answered",
        "2211.03116_93cba07454f06a4a960172bbd6e2a435": "Yes",
        "2211.03116_7d0764e33fbd4594d52248c7defc8633": "to Q0.1).",
        "2211.03116_eeaca4748931d1c3e74d99f11658b5d6": "For which problems do you apply self-adaptation? (Q1.1)",
        "2211.03116_9d980abc6424acf866a20bd31ae2ace9": "summarises the results",
        "2211.03116_e214c30db99d8beabf87e41e8394a4d1": "On average, the participants applied self-adaptation for 3.6 types of problems from the predefined list (with seven options)",
        "2211.03116_b9c5b1bca54291976fdcc01ffad131a0": "The results show that practitioners apply self-adaptation to deal with a variety of problems",
        "2211.03116_53d39e4af17ea5ff04e4cc7092b7044e": "Optimising performance and automating tasks are the main problems addressed by self-adaptation in industry",
        "2211.03116_3a0988950c8314b9b9d4b7306bf9371c": "On the other hand, dealing with changes in business goals is less frequently solved using self-adaptation. `Others' include for example support for testing and evolution.",
        "2211.03116_912892261fc3209b50eabc9b4b57e31d": "\\begin{table}[hbt]\n\\centering\n\\caption{Problems to apply self-adaptation (Q1.1). \n% Percentages indicate the fraction of participants that selected the problems.\n}\\vspace{-3pt}\n\\label{tab:q1-1}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\nProblem & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nTo optimise performance & 78 \\\\%49 (79\\%)\\\\%& 78 (69\\%)\\\\\nTo automate tasks & 61 \\\\%41 (66\\%)\\\\%& 64 (57\\%)\\\\\nTo deal with changes in the environment & 60 \\\\%35 (56\\%)\\\\%56 (50\\%)\\\\\nTo configure/reconfigure a system & 51 \\\\%39 (63\\%)\\\\%56 (50\\%)\\\\\nTo detect and resolve errors & 46 \\\\%30 (48\\%)\\\\%& 44 (39\\%)\\\\\nTo detect and protect a system against threats & 33 \\\\%25 (40\\%)\\\\%& 38 (34\\%)\\\\\nTo deal with changes in the business goals & 15 \\\\%8 (13\\%)\\\\%& 11 (10\\%)\\\\\nOthers & 12 \\\\%10 (16\\%)\\\\%7 (6.2\\%)\\\\\n%Not specified & 4 (6\\%)\\\\%4 (3.5\\%)\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_c41d00d3c15531ee0a4fc045897272fc": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.85\\columnwidth]{Q1.1-fig.pdf}\\vspace{-10pt}\n\\caption{Problems to apply self-adaptation (Q1.1).}\n\\label{fig:q1-1}\n\\end{figure}",
        "2211.03116_3b3559efb171b34fe55b2b87275d8b0b": "What are the main business motivations to apply self-adaptation? (Q1.2)",
        "2211.03116_a6391668bcf329da880f7ebe78035339": "On average, the participants provided 2.1 business motivations to apply self-adaptation",
        "2211.03116_48023f3641d97ea4c2afc78f51a8dacb": "Improving user satisfaction, reducing costs, and mitigating risks are the most selected motivations for using self-adaptation",
        "2211.03116_c3ffcb1f61a116064dd14d28ca093a30": "Opening up new application opportunities was selected by a lower number of 21 participants",
        "2211.03116_46e3673effebc8d529a8639161110bf0": "Examples of `Others' are improving utility and managing complexity.",
        "2211.03116_4cd3e0959cde0442a56e6104e4a41b6a": "\\begin{table}[hbt]\n\\centering\n\\caption{Main business motivations to apply self-adaptation (Q1.2). \n% Percentages indicate the fraction of all participants \\\\ that selected the motivations.\n}\\vspace{-3pt}\n\\label{tab:q1-2}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\nMotivation & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nTo improve user satisfaction & 67 \\\\%43 (69\\%)\\\\\nTo reduce costs & 66 \\\\%41 (66\\%)\\\\\nTo mitigate risks & 44 \\\\%33 (53\\%)\\\\\nTo open up new application opportunities & 21 \\\\%14 (23\\%)\\\\\nOthers & 16 \\\\%(15\\%)\\\\\n%None & 2 (1.8\\%)\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_d1bc2b9adb0fd285fb55054d29961ad7": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.65\\columnwidth]{Q1.2-fig.pdf}\\vspace{-10pt}\n\\caption{Main business motivations to apply self-adaptation (Q1.2).}\\vspace{-10pt}%%%\n\\label{fig:q1-2}\n\\end{figure}",
        "2211.03116_73dddbf2a3f91103007671565ef899c3": "What could be benefits of applying self-adaptation? (Q1.3)",
        "2211.03116_3ed2712934ea2cd07fe87ffe7f8b41d4": "\\begin{table}[hbt]\n\\centering\n\\caption{Contingency matrix Q1.1}\n\\label{tab:contingency_q1-1}\n\\begin{tabular}{llll}\n\\hline\\noalign{\\smallskip}\nRole & Quantitative & Qualitative & No preference\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nResearcher & 21 & 11 & 40 \\\\\nPractitioner & 5 & 1 & 7 \\\\\nBoth & 0 & 4 & 16 \\\\ \n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_295f68a8274e6d5f9fe2342c0a06b461": "Ninety-two participants",
        "2211.03116_4b9997ad9e8f7b5c0b00a2d4eeeefb55": "provided meaningful descriptions of benefits of self-adaptation, an average of 1.8 benefits per participant.",
        "2211.03116_0958cf795a5dd4ab8f9f7f169d0ce186": "We summarise the findings in Table",
        "2211.03116_45e73637a82d4ab4512583570d41fbe0": "For each category (bold font) and code, we include how often it appeared and we provide a few example quotes.",
        "2211.03116_3532f05abac8314260eb10b58a3a6807": "The dominating benefits of applying self-adaptation are",
        "2211.03116_c4b39647f8e97a433ff7ac0f5d2afebf": "(61 participants),",
        "2211.03116_947d296aacc1e228c9b1ac6f79b84c0e": "in costs and resources (38 participants), and",
        "2211.03116_bd71c5d6427be06d6621479c997a63ee": "(37 participants).",
        "2211.03116_78f8cc7eee05dc2ed816b0478c67b524": "\\begin{table}[hbt]\n\\caption{Comments: Reported benefits of self-adaptation (Q1.3).}\n\\label{tab:codes_q1-3}\n\\begin{tabular}{p{3cm}lp{9.6cm}}\n\\hline\\noalign{\\smallskip}\nCategories/codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Improved utility} & \\textbf{61} & \\\\\nRobustness & 21 & ``fault tolerance, one node dies, a new one is spawned without manual intervention''; ``better error handling and prompt disaster recovery'' \\\\\nPerformance & 16 & ``Improve performance and quality-of-service''; ``increase in the speed of adaptation''  \\\\\nAvailability & 8 & ``The main benefit for us is the 99.9999\\% availability, which is crucial for some customers of these cloud-specific solutions''\\\\\nOther & 16 & ``for IoT: optimized operations, improved energy usage''; ``an important part to guarantee the safety [...] of the overall system.''\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Savings} & \\textbf{38} & \\\\\nCosts & 25 & ``The primary benefit is cost reduction''; ``the cheaper bills for running this in an efficient manner in e.g. a cloud service''\\\\\nResources & 13 & ``scales down resources during hours when traffic is low, and scales up during peak hours, without any manual interference.''\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Improved human interaction}  & \\textbf{37} & \\\\\nUser experience & 19 & ``Keep Telco network in optimal condition so that QoS and user experience is maximized, and churn minimized''; ``better user satisfaction because of prompt website responses''\\\\\nEngineers support & 18 & ``removes most of the optimization burden from programmers, so they can be more productive''; ``Reduce workload on human operators; make (the results of) certain actions [...] repeatable and predictable''\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Handle dynamics} & \\textbf{22} & \\\\\nLoad dynamics & 12 & ``Change AGV behavior depending of the workload with the goal to save energy (battery life).''\\\\\nContext dynamics & 10 & ``Each machine is unique and its optimal operational parameters change over time due to ware, location, task and seasonal factor.''\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Other improvements}\n& \\textbf{16} & \\\\\nVarious & 16 & ``In case of spikes in incoming events the system is able to adapt [...] avoiding bottlenecks.''; ``Easier and faster market integration''; ``It's fundamental in huge infrastructure systems otherwise we cant make it happen.''\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_7bade40785d1f5c1dbec8c0414eaac9a": "List (enumerate)",
        "2211.03116_60a9fd2182284da45537e5539022df29": "Self-adaptation is widely applied in industry across a wide variety of domains.",
        "2211.03116_a9f02dfa5971cea6b6ce3a4cdc86f2eb": "Practitioners primarily apply self-adaptation to optimise performance, automate tasks, and deal with changes in the deployment environment.",
        "2211.03116_bf5b841b7415d86eee2fbde3e64d17df": "The dominating business motives to apply self-adaptation in industry are primarily improving user satisfaction and reducing costs, and secondarily mitigating risks.",
        "2211.03116_48c96b8d6ad45d3b0a2793ba3e67ab00": "The main benefits of applying self-adaptation are improved utility (in robustness and performance), savings (costs and resources), improved human interaction (user experience and engineers support), and handling dynamics (in the context and system load).",
        "2211.03116_0d60f2ec599457b296928b8366e401b1": "RQ2: Characterisation of Self-adaptation",
        "2211.03116_41f9ad5af9823e71410328c358602c50": "Explain a concrete self-adaptive system you worked with (Q2.1)",
        "2211.03116_514ae45756e2e917a3107dbacb15cd55": "Except for one, all participants with experience in self-adaptation provided a concrete description of a system they worked with.",
        "2211.03116_651ae5789ab776f2fcaf80b5e62801dc": "Tables",
        "2211.03116_be5d5d37542d75f93a87094459f76678": "and",
        "2211.03116_159a38bb0582aa5c65571d2248c70dca": "summarise the findings",
        "2211.03116_6abfc2f3c52ab1e3b79c0abd9d53656b": "We focused on characteristics of self-adaptive systems and identified three categories:",
        "2211.03116_c0cb5f0fcf239ab3d9c1fcd31fff1efc": ",",
        "2211.03116_8a0e2b549d223aba55a866c38d1c9275": ", and",
        "2211.03116_de0bf74dc3b2b029d7aec6e7eff0f8f0": "of adaptation",
        "2211.03116_606946baf4864d642705789565f2afae": "With subject we mean the system or part of it that is adapted; type refers to the kind of adaptation that is applied, and trigger refers to the source that initiates adaptation.",
        "2211.03116_57a24dc06cd7e45b07d7ed24283f9ca3": "\\begin{table*}[b!]\n\\caption{Analysis of comments I -- Explain a concrete self-adaptive system you worked with (Q2.1)}\n\\label{tab:codes_q2-1.I}\n\\begin{tabular}{p{3cm}lp{9.6cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Subject of adaptation} & \\textbf{99} &  \\\\\n\nSystem & 28 & ``Our company develops safety critical systems for railway. Systems architecture is often with redundancy - e.g. 2 out of 3 system, where is automatic reconfiguration implemented. Purpose is high safety and availability''; ``A flexible manufacturing system ... the system and the individual station within the system can \"sense\" what kind of work piece it has in front of itself and what it or another machine should do with it in the next step.'' \n\\\\\n\nModule & 22 & ``Environment compensation system for capacitive touch interface. Such system is influenced by envirenmental change (for example temperature)''; ``We manage the memory usage of the process. Once memory usage over a limit (i.e. 90\\%), we start throttling the workload.''\\\\\n\nPlatform layer & 13 & ``Monitoring the memory/CPU/disk consumption of our servers and suggesting measures to fix it through human intervention.'' \n\\\\\n\nApplication layer & 11 & ``HotSpot JVM ... reads a program's Java bytecode, and adaptively tunes the performance of the program at runtime, adapting to runtime profiles.''\\\\\n\nCluster & 10 & ``Spark executor auto-scaling system. We built this system to automatically add or remove nodes to our Spark cluster when we have a high demand of resources from our Spark jobs.'' \\\\\n\nNetwork & 6 & \n``\"Our radios apply 'channel assessment' ... that optimizes the radio channels used during BLE communication. Our radios also apply very aggressive power management. peripherals and cores are switched off whenever possible to minimize the system's power usage.\"'' \n\\\\\n\nMixed & 6 & ``Enterprise-cloud environment consisting of dozens of different (micro) services providing functionality to 3rd parties as well as internal employees - data management, authentication and authorization, business process automation, as well as internal development process support (build servers, logging, etc.).''\n\\\\\n\nCI/CD pipeline & 3 & ``Sacling up and down our infrastructure (CI/CD) chain to build and integrate the truck software.'' \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_9f69166552fe6e8a893625228dcdfb49": "\\begin{table*}[h!]\n\\caption{Analysis of comments II -- Explain a concrete self-adaptive system you worked with (Q2.1)}\n\\label{tab:codes_q2-1.II}\n\\begin{tabular}{p{3cm}lp{9.6cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Type of adaptation} & \\textbf{99} &  \\\\\n\nAuto-scaling & 33 & ``Automated horizontal scaling of AWS EC2 instances for medical data processing systems''; ``autoscale a cluster based on the resource usage of the nodes of the cluster.''\\\\\nAuto-tuning & 28 & ``A mink feeding robot, that can adjust the food amount according to a set of feeding rules and the food left over from last feeding.'' \\\\\n%The robot can also calibrate the food amount delivered, if the expected amount does not macth the delivered amount.'' \\\\\nMonitor/Analysis & 22 & ``We configured AWS alarms to monitor performance of our systems in case we get more than few number of HTTP 400/500 errors''; ``Monitoring the memory/CPU/disk consumption of our servers and suggesting measures to fix it through human intervention.'' \\\\\nAutomated reconfiguration & 11 & ``Continuos integration system - Other \\& starts building \\& testing a new version as soon as it detects code changes  Build alignment - Creates a new release whenever a subsystem builds successfully.''\\\\\nOther & 5 & ``Our mobile robots scan their environments using laser scanners and other sensors and plan their behavior accordingly.'' ``self healing automotive systems''\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Trigger for adaptation} & \\textbf{99} &  \\\\\nSystem properties & 27 & ``Auto-scaling functionality of an Azure Service Fabric cluster running a transformation load for processing AGV statistical and playback data.''; ``Realtime focused data streaming protocol ... must take care to avoid exhausting the network resources and thus incurring packet loss and latency spikes, which are very noticeable in games.''\\\\\n\nEnvironment properties & 18 & ``An IoT system running in Kubernetes and used to monitor water leaking for household insurance.''; ``A flexible manufacturing system ... can \"sense\" what kind of work piece it has in front of itself and what it or another machine should do with it in the next step.'' \\\\\n\nSystem load & 14 & ``Kubernetes, for handling load intensive periods for scaling up, and self recover from crashes.''; ``Autoscaling of SaaS applications in function of load on AWS and Azure clouds.'' \\\\\n\nEvents & 12 & ``We use kubernetes which provides notification callbacks on any event such as host/pod not available, based on these events we auto mark the node was inactive and do not use those nodes for further write or read operations''; ``Auto Scaling an EMR cluster in AWS based on incoming event data''\\\\\n\nUser actions & 7 & ``[adapt] cache warm up strategy based on user interactions''; ``scammers ... To decide the users that are most likely to be a scammer, the system tracks the past performance of models responsible for flagging potential scammers.''  \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_4c1ef618c7ed2f8b59e52e1eb6253d14": "We identified reasons for why students might be used as subjects in empirical software architecture research.",
        "2211.03116_ebf55d30f7961d09dbe54c244240bed4": "Twenty-nine comments pointed out that students may be suitable to achieve the goal of a study",
        "2211.03116_2c0fd23a190e54ee964a8923f7d4ca09": "For example, students may be representative subjects for studies about novice developers",
        "2211.03116_22d9f7f92ed110272a01c614f0f04128": "As one respondent wrote,",
        "2211.03116_ddf49929e9c9c99f13f224162947105f": ", echoed in another comment:",
        "2211.03116_539b78eabe019b8e652ac51631cdd850": "Similarly, another one wrote",
        "2211.03116_9106d92b7bc977c35b1f5384e6147ff2": "One respondent gave a concrete example:",
        "2211.03116_58ef8fafb44486016cb421badd874d2b": "Finally, one respondent wrote that",
        "2211.03116_d1506ccde40ed119bb08e01a72de4340": "and that",
        "2211.03116_ba5de27760fcf35dd1c605f3aacece26": "Five comments pointed out that students are the next generation of practitioners",
        "2211.03116_6eee9898d5ffef4f29232c42dbc7792a": "Another one added that",
        "2211.03116_5febb344d7b8a0177c6bc2bf4945c717": "Another one stated that",
        "2211.03116_5a259605066b8eb5f8bdfe9d696b61a7": "In a similar way, one respondent stated that",
        "2211.03116_79b59b138557331e311753a4f4d1a3e2": "Four comments highlighted a more pragmatic view and pointed out that students might be the only subjects researchers have access to",
        "2211.03116_da544805812101212c31fe69c7004f82": "As stated by one respondent,",
        "2211.03116_c7f208b762ea79e3615dbb9bfc766eb2": "Three comments emphasized that students, in contrast to practitioners, might be less biased",
        "2211.03116_acc5c74d90d03dc48bced20ed87a44c1": "One respondent wrote that",
        "2211.03116_7b72739c8babc579f5bb407f3ecf2e27": "Another one emphasized that",
        "2211.03116_9be96ca42755dd5a3ded7546015ddd9c": "We also identified reasons for why students should not be used in empirical software architecture studies.",
        "2211.03116_a681b58b874e8057f3ac09d69d712d33": "Nine comments highlighted that students lack the experience required for software architecture studies to be meaningful",
        "2211.03116_a7aef7759798cfe2f3053a7aa7fcff23": "Nine comments highlighted that students are not representative to practitioners, therefore, results are not applicable to software architecting in industry",
        "2211.03116_014d3b0c2199edcfce49f801534931ca": "while another stated that",
        "2211.03116_7780c3622e091fbe86cd6caeaf43d50f": "Ninety-nine participants provided a description of what is the subject of adaptation in the systems they work with",
        "2211.03116_92aad4ab3d6e37fb73150842e313546e": "Top results are",
        "2211.03116_98adfd300f55f67e0b90dc1fceab475f": "that occurred 28 times, followed by",
        "2211.03116_1d32553a76addf20e86d01f27d89bf05": "with 22 times (i.e., a part of a system).",
        "2211.03116_f402225bd45ec1d5e0f44ebe0469cd84": "(infrastructure, execution platform, etc.) was mentioned 11 times and",
        "2211.03116_5a10611e0eace6fadb62769fe142fe60": "11 times",
        "2211.03116_0eb4944725ea25ae686c7c08c0f4f594": "Of the participants that worked with self-adaptation, 86 described in total 101 instances of the types of adaptation they apply (i.e., an average of 1.17).",
        "2211.03116_5fc7c5d5229c40d0e826d6f2a93d2742": "with 33 occurrences and",
        "2211.03116_e1a7b2a99ad87b696b26f48e5c313eaa": "with 28 are the most frequent types of adaptations applied by the participants",
        "2211.03116_98f49b14badf4ba1addaa2006b36308d": "Twenty-two participants focus on",
        "2211.03116_a48efea0bb6bd588ca82bedcac23ab44": "only (they may use the human in the loop for other adaptation functions)",
        "2211.03116_57267fb2685be0591a0337f532c08194": "Finally, 62 participants explained in total 78 triggers of adaptation in their work (i.e., an average of 1.21 triggers)",
        "2211.03116_75e20d539d2ed5ba872add2596fc437c": "The main triggers originate from",
        "2211.03116_4382782700c88a590f38af5ebddb53ae": "with 27 occurrences and",
        "2211.03116_da764fa16f1cd4f9a925081cd6f4adc0": "with 18 occurrences",
        "2211.03116_8419ceaf0f8a653fb987cd780f7a167b": "Changes in the system load, events,",
        "2211.03116_48c9bc6b6766c20905b44accc58b21b5": "and user actions are the other types of triggers for adaptation.",
        "2211.03116_51c45b795d5d18a3e4e0c37e8b20a141": "Table",
        "2211.03116_5a94a4b5439aef7298166eaf3cfab653": "shows the mapping of system domains (derived from Q0.2) to the (parts of systems that are) subject of adaptation",
        "2211.03116_454143a43d26df4ab78709e55f975957": "The results show that self-adaptation is applied to a variety of domains and at different levels of systems",
        "2211.03116_f4b58a8512b792377e16d997b7181f9b": "shows the mapping of the subject of adaptation to the type of adaptation",
        "2211.03116_ff4071fda3b0402a24f1800cc878c161": "The results show that auto-scaling and automated adaptation are broadly applied",
        "2211.03116_d341e083b8169aba7c030ec2b0106657": "On the other hand, auto-tuning and monitor/analysis are primarily applied for adaptation at system level",
        "2211.03116_ad2f8a45952594d5ec7cc07595b1e2b2": "shows the mapping of the type of adaptation to the trigger of adaptation",
        "2211.03116_6b6d3f8cb0fb0e68699c38b5b3a8ba82": "Remarkably, changes in the (work) load are only applied for auto-scaling.",
        "2211.03116_fd2ce9e963cec834a233f8089758e89d": "\\begin{table*}[hbt]\n\\centering\n\\caption{Contingency matrix: system domain (top 7 derived from Q0.1) versus subject of adaptation (Q2.2)}\n\\label{tab:contingency_q0_1_2_2}\n\\begin{tabular}{lccccccc}\n\\hline\\noalign{\\smallsckip}\nDomain & System & Module  & Support system & Cluster  & Cloud & Application & Generic \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nWeb/mobile & 2 & 5 & 1 & 2 & - & - & 1 \\\\\nEmbedded/CPS/IoT & 5 & 1 & 2 & - & - & 1 & - \\\\\nTransportation & 1 & 2 & 1 & - & - & - & - \\\\\nNetworks & - & - & 1 & - & 2 & 1 & 1 \\\\\nBusiness management & - & 1 & 1 & - & 1 & 1 & - \\\\\nData management & 1 & 1 & 1 & - & 3 & - & - \\\\\ne-commerce & 2 & - & - & 1 & - & - & - \\\\\nGeneral & 5 & 2 & 3 & 2 & 1 & 1 & 1 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_280997025feb74dd9af3dd16d025ac4c": "\\begin{table*}[hbt]\n\\centering\n\\caption{Contingency matrix: subject of adaptation versus type of adaptation (Q2.2)}\n\\label{tab:contingency_q2_2a}\n\\begin{tabular}{lccccccc}\n\\hline\\noalign{\\smallskip}\nSubject & Auto-scaling & Automated reconfiguration  & Auto-tuning & Monitor/Analysis  & Automated CI & Other \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nSystem & 1 & 1 & 6 & 4 & - & 2 \\\\\nModule & 5 & 5 & 1 & 1 & 1 & - \\\\\nSupport system & 3 & 2 & - & - & 2 & - \\\\ \nCluster & 7 & 1 & - & - & - & - \\\\ \nCloud & 3 & - & - & 1 & - & 1 \\\\ \nApplication & - & - & 1 & - & - & - \\\\ \nGeneric & 1 & 1 & - & - & - & 2 \\\\ \n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_2d464df6e82552b6b8ff0069032acc47": "\\begin{table*}[hbt]\n\\centering\n\\caption{Contingency matrix: type of adaptation versus trigger of adaption (Q2.2)}\n\\label{tab:contingency_q2_2b}\n\\begin{tabular}{lccccccc}\n\\hline\\noalign{\\smallskip}\nType & Load & Events  & Environment properties &  System properties & User actions \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nAuto-scaling & 9 & 2 & - & 1 & 1  \\\\\nAutomated reconfiguration & - & 2 & - & 2 & 1  \\\\\nAuto-tuning & - & 2 & 4 & 2 & -  \\\\\nMonitor/Analysis & - & 1 & 1 & 1 & -  \\\\\nAutomated CI & & - & 2 & - & - & -  \\\\\nOther & - & - & - & - & -  \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_531a789b2a8c373b3d3c42108cc58970": "Self-adaptation is applied at different levels of industrial software-intensive systems: from a complete system to parts of a system and support systems.",
        "2211.03116_69655dbe39e93730d5f1b8692dc648dc": "The dominating types of adaptations applied in industry are auto-scaling, auto-tuning, and monitoring/analysis.",
        "2211.03116_c53f9af4002dc7af10b0da1c50781319": "Adaptions in industrial software-intensive systems are triggered by changes in properties of systems and their environments, dynamics in system load, relevant events, and through user actions.",
        "2211.03116_21f00580a82449f36ef32ea163202f68": "Technologies such as elastic cloud and auto-scalers are key enablers for the realisation of self-adaptation in practice.",
        "2211.03116_cc67736361f33f3674c420481d534726": "RQ3: Application of Self-adaptation",
        "2211.03116_543e2e89d9ba27de98b55e054512def4": "What mechanisms or tools does the self-adaptive system you worked with use to monitor a managed system during operation? (Q3.1)",
        "2211.03116_155b1e0b084eb54ee19262fa02e44105": "The participants provided a total of 146 instances of mechanisms or tools they used for monitoring in a self-adaptive system they worked with, i.e., on average, 1.5 mechanisms/tools per participant.",
        "2211.03116_37f8a892f3084a13d90634a23a159549": "summarises the findings",
        "2211.03116_9ca1d6cf557ac11d42296e2f30270b6e": "The participants focused on both",
        "2211.03116_4a2028eceac5e1f4d252ea13c71ecec6": "what",
        "2211.03116_c127f308dab4a04e831325faec68053e": "is being monitored and",
        "2211.03116_db88a0257c220dbfdd2e40f6152d6a8d": "how",
        "2211.03116_f3ee6b5d7d0dd5094f80a78446ef2b41": "monitoring is done",
        "2211.03116_c489ad6c50f2d4f810f4278bb969f1de": "Based on this we identified three categories:",
        "2211.03116_6e4ac029260b2294e8eab5b19cb37225": "Of the 100 answers, we marked 14 as unclear.",
        "2211.03116_58127132cb6b4639e902227c186ef58d": "\\begin{table*}[t!]\n\\caption{Analysis of comments -- Mechanisms or tools used to monitor a managed system (Q3.1).}\n\\label{tab:codes_q3-1}\n\\begin{tabular}{p{3cm}lp{9.6cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Monitoring metric} & \\textbf{75} &  \\\\\n\nResource usage & 23 & ``Active sessions counting, resource utilisation (e.g. RAM) monitoring given by VM''; ``Typically CPU and Memory usage''; ``Helsim: uses CPU counters to measure time or power consumption to process particles''\\\\\n\nLoad & 18 & ``Number of incoming HTTP requests''; ``The system polls the queue of the Spark job scheduler in our cluster every 5 seconds via REST API, using a NiFi flow.''; ``Number of queries''; ``number of requests''\\\\\n\nReliability metrics & 13 & ``AWS lambda error metric is monitored to see if the sum of 400/500 errors for every part 5 mins is less than some specified amount.''\n%; ``Generic Q: Monitoring is typically done using health endpoints that should preferably not only answer back with a static `Ok', but rather either do some tests or present metrics. It may for example check the rate of failures of incoming requests. Another possibility that is commonly used is to monitor the process state, i.e. to detect dying processes.'' \n\\\\\n\nPerformance metrics & 12 & ``We track the response times for the users' requests.''; ``monitored systems implement specific features to provide data about their performance.'' \\\\\n\nApplication state & 9 & ``Tracking properties are - correct integrity - functionality of memorries (RAM, ROM), correct values and integrity of data among redundant parts.'' \n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Monitoring mechanism} & \\textbf{20} &  \\\\\nEnvironment sensors & 9 & ``Based on external information (external sensors like Lidar, Camera, GPS, ...) making sure no accident were to happen''; ``Exteroceptive are aggregated to create a snapshot of the world's state. These are LIDAR and Image sensors. We use Proprioceptive sensors to determine the robot's state. These are encoders only.'' \\\\\n\nLogging mechanisms & 6 & ``Logging software triggered whenever an incoming request is made''; ``The system logs all interactions, both errors and successful operations.''\\\\\n\nSystem sensors & 4 & ``Based on internal information (internal sensors like Wheel speed, steering angle, yaw and roll sensors, ...) optimize the performance to support the driver to drive optimal.''\\\\\n\nHumans & 1 & ``Human review decisions are used to monitor the precision of models.''\n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Monitoring tool} & \\textbf{34} &  \\\\\n\nKubernetes monitoring & 9 & ``Kubernetes clusters are made out of master and worker machine nodes. On the worker nodes runs a process called kubelet that monitors the state of the worker nodes in the Kubernetes cluster''; ``Probes implemented in the application, metrics provided by K8s metrics server (goes down to cgroups via kubelet)'' \\\\\n\nPrometheus & 9 & ``- every service exposes a defined set of metrics. We collect metrics regarding every layer of the distributed system. We mainly use Prometheus and Splunk to collect these metrics.''; ``Prometheus and grafana for monitoring health of services'' \\\\\n\nAWS monitoring & 8 & ``We use AWS CloudWatch service to monitor and act on any event with ServerLess AWS lambda functions.''; ``AWS Lambda based monitor which monitor aprox number of message in SQS queue'' \\\\\n\nOther: Azure monitoring, Datadog, Splunk, cAdvisor, Elasticsearch & 8 & ``Default tooling from Azure / AWS in combination with splunk''; ``We are using Datadog to collect relevant metrics.''; ``AKS monitors the system load and response time to start-up more instances. It also checks for malfunctioning applications and restarts them when stalled, providing high availability.'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_10aa33cdf7d7fe7dce0c384fd20d06a0": "The participants mentioned in total 75 metrics they use for monitoring.",
        "2211.03116_33cf08a771e9805a9a9241e9d54477f2": "with 23 occurrences,",
        "2211.03116_b04b2070fcc3592b178f50ea65f22161": "with 18, and",
        "2211.03116_c99dbf17f41a6af2c1f391c01d7bd623": "with 13 are the most frequently mentioned metrics",
        "2211.03116_8cc304f5376a32160f028e2339eec813": "The participants described in total 20 monitoring mechanisms.",
        "2211.03116_2418e036e149d42d432a5968c102133a": "occurred nine times and",
        "2211.03116_18ccb9645940428e6b3c377997ac475a": "four times",
        "2211.03116_874d58d0398071feb206053fc0a58b61": "Six participants described different",
        "2211.03116_5656c816663a3fc322206d9b805f53bf": ", and in one system, a",
        "2211.03116_f7a5a23fa797176c3d0ece7b5e6944ef": "is involved in monitoring",
        "2211.03116_2fe09f0cc04202a8485b874d63257549": "Finally, the participants provided in total 34 tools they use for monitoring",
        "2211.03116_46ccb2c7ae5a0afaabf106ba99edbb30": "The most prominent tools are",
        "2211.03116_f68e52a4f606d1d712f1be12054c5582": ", which each occurred nine times, followed by",
        "2211.03116_7ae81ea19a77ce137aece8aa4a1991fe": "with eight occurrences.",
        "2211.03116_a37e59162720c1dc8ae8299baae20cf3": "What mechanisms or tools does the self-adaptive system you worked with use analyse conditions of a managed system during operation? (Q3.2)",
        "2211.03116_816b4939bbcb2d86a31404c0e9fc567c": "The participants provided a total of 115 instances of mechanisms or tools they used for analysing conditions of a self-adaptive system they worked with, i.e., on average 1.5 mechanisms/tools per participant.",
        "2211.03116_24170f8841ec8a1fedf2c5edc937ab62": "We identified two categories:",
        "2211.03116_9db0410a6addaef35858aad089e611e4": "Out of the 100 valid answers, 21 were marked as unclear or not applicable (such as",
        "2211.03116_ec09ceedbd9ed3f4e7387b27c263d321": "Fairy simple algoritms",
        "2211.03116_e81c4e4f2b7b93b481e13a8553c2ae1b": "or",
        "2211.03116_3fbdfdc056292c1a1a0a3de96e51b7e2": "The tech stack we use is proprietary and the tools we use are built in house",
        "2211.03116_71a3630b55c3bb529444a28630caf13c": "The rest of the participants mentioned in total 73 mechanisms they use for analysis",
        "2211.03116_91808e128fee94a2ad01f6a449623d91": "The most frequently mentioned mechanisms are",
        "2211.03116_4b4c2bebc40548a6b75925df3faf4a04": "(such as interference, statistical data analysis, what-if analysis, and search-based methods) with 18 occurrences,",
        "2211.03116_0a5d2ba909adce9143f2f07e13bcd85d": "with 16 occurrences, and",
        "2211.03116_2bde88920b0ea5a6f642494f40a52b23": "(mostly machine learning) with 12 occurrences",
        "2211.03116_587d4fd6ac25217d62ab401c06075e4f": "The participants provided in total 23 tools they use for analysis.",
        "2211.03116_0f11e4ef750308e4dc418961e631fb6c": "occurred nine times, followed by",
        "2211.03116_3aba977ab28bf068489b0f1c711f465e": "with seven, and",
        "2211.03116_de019074dc247263ba29d5f3cf5e934e": "with two occurrences",
        "2211.03116_0c756a788a5ffb5652dad8140fcf8172": "Other tools mentioned by the participants include Splunk, JMX, Jasmina, Azure, Openshift, and Kibana.",
        "2211.03116_43c60be3f63e1286c960a6c9f32c6b15": "\\begin{table*}[h!]\n\\caption{Analysis comments -- Mechanisms or tools used to analyze conditions of a managed system (Q3.2).}\n\\label{tab:codes_q3-2}\n\\begin{tabular}{p{3cm}lp{9.6cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Analysis mechanism}  & \\textbf{73} &  \\\\\n\nData analysis methods & 18 & ``I think it uses some rolling average or some similar algorithm to estimate whether to scale up or down.''; ``simple statistical inferences based on metrics and simple rules encoded by developers.''; ``statistical analysis of data''\\\\\n\nComparison to threshold & 16 & ``Comparing the error rate with constant/dynamic thresholds.''; ``Hard  coded critical boundaries like min max values which lead to switching over to emergency modes [...]''; ``when it falls below Service Level Agreements this indicates a need for auto-scaling'' \\\\\n\nMetric(s) calculation & 12 & ``Failure rate is used to measure quality of adaptation parameters.''; ``Capturing performance of each node. ''; ``Measurement of traffic load, CPU utilization, and general availability metrics (reachability, status, ...)'' \\\\\n\nLearning & 12 & ``Each station has a kind of edge computing component that performs some analysis based on machine learning results.''; ``It tracks both the internal working conditions (load) of itself as a serving component, and learns about overall serving conditions.''; ``The system uses biosensory feedback to determine the riders' happiness [...]'' \\\\\n\nCustom rules & 9 & ``Mostly a simple ruleset gleaned by experimentation and observing how the resulting adaption steps perform at runtime.''; ``we have alertmanager to set up some rules that are known to be issues that have clear solutions'' \\\\\n\nAutoscaling policy & 5 & ``[...] the response of the scheduler is parsed and the queue length is evaluated. If greater than zero, the flow performs a SCALE UP operation. If equal to zero, the flow performs a SCALE DOWN operation.'' \\\\\n\nSemantic reasoning & 1 & ``Reasoning on knowledge graphs'' \n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Analysis tool} & \\textbf{23}\n\\\\\nAWS analysis tools & 9 & ``Analytics functions native to the cloud environment the system runs in (AWS).''; ``AWS based auto-scaling conditions as provided in the Cloud formation setup of the cluster'' \\\\\n\nKubernetes stack & 7 & ``The master nodes have all sorts of different components such as the kube-scheduler, controllers and state db (etcd), that are managed via the kube-apiserver. ''; ``Built-in Kubernetes/Openshift mechanisms [...]'' \\\\\n\nDynatrace & 2 & ``analyze was done by Dynatrace or by Keptn itself by checking against thresholds'' \\\\\n\nOther & 5 & ``We mainly use rule-based systems like Splunk to automatically analyse production metrics against patterns.''; ``Default tooling from Azure''; ``Kibana'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91": "What mechanisms or tools does the self-adaptive system you worked with use to change a managed system or parts of it during operation? (Q3.3)",
        "2211.03116_bd3b4a2af504156aa4a99947fe9418dd": "The participants provided 126 instances of mechanisms or tools they have used for applying changes, i.e., 1.3 mechanism/tool per participant.",
        "2211.03116_e6153293f594a679ac53f75985f12d0e": "Out of the 100 valid answers, 23 were marked as unclear or not applicable",
        "2211.03116_d72166f8e59ffa8e2ed703e8f8d4689d": "In total, 83 instances of mechanisms for change were reported.",
        "2211.03116_ebc55e99cde911beb0d0341ce9fede9c": "with 36 occurrences and",
        "2211.03116_5288ec02f07693b59db5451c0500240b": "(changing the adaptation logic, network reconfiguration, parameter adjusting, load balancing) with 25 occurrences are the most frequently mentioned changing mechanisms",
        "2211.03116_14526a4c3570ae6e0fcf525f33df8bdc": "Twelve participants used",
        "2211.03116_56595cdc8f34b4bc2ca2d7c890b14288": "that refer to notifications and change tasks done by humans.",
        "2211.03116_ba2ec4f0b1df570acb9f4276462e0c18": "The participants mentioned 19 tools they use for enacting change.",
        "2211.03116_ec96e54b5ef46460aaa267f8373eedbc": "occurred nine times,",
        "2211.03116_da7ba542c8dd44cd1256808081eb0585": "seven times and other tools, including Openshift and Dynatrace, three times.",
        "2211.03116_b04ae0d7ee85bc1f5e2f7811e608cc71": "\\begin{table*}[hbt]\n\\caption{Analysis of comments -- Mechanisms or tools used to changea managed system or parts of it (Q3.3).}\n\\label{tab:codes_q3-3}\n\\begin{tabular}{p{3cm}lp{9.7cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Change mechanism} & \\textbf{83} &  \\\\\n\nScaling mechanisms & 36 & ``The server-side system has a load balancer. Hence we increase the number of workers behind the load balancer to decrease the average response time for the users.''; ``It adjusts the number of worker nodes.''; ``Adding a completely similar server / serverless Lambda instance''; \\\\\n\n% ### autoscaling \n% adding/removing infrastructure resources & 14 & ``Provisioning additional resources (e.g. VMs)''; ``Adding a completely similar server / serverless Lambda instance''; ``Mainly on increased load additional services and resources are added/removed'' \\\\\n%; ``Basically adding computational power through infrastructure as code.'' \\\\\n\nReconfiguration & 25 & ``The adaptation directly adjusts the period between the packet send events, as well as the number of packets allowed during each send event. [...]; ``Depending on context, controlled variables are managed through different automation systems.''; ``reconfiguration of the management entity ... to support a larger (or smaller) scale distributed system''; ``load balancer/director that may support controlling the exposure facade towards the system environment. '' \\\\\n%reconfiguration of the management entity (in the cloud) to support a larger (or smaller) scale distributed system'' \\\\\n\n\n\n% ### reconfiguration \n% adjusting parameters of control loop & 7 & ``Optimisation/scenario modelling based on the incrementally trained ML-model leads to new operational parmeters which is fed into the control system.''; ``There are disturbance and controlled variables...and the controlled ones can be changed. Depending on context, controlled variables are managed through different automation systems.'' \\\\\n\n% ### reconfiguration\n% load balancing & 2 & ``It can split its serving units into n pieces so that it can shed load to other instances of itself that have less load.'' \\\\\n%; ``a system may be supported by load balancer/director that may support controlling the exposure facade towards the system environment. '' \\\\\n\nNon-automated & 12 & ``To effect change on the managed system, the results from the tool need to be approved by an engineer, and are then acted on by the mining and plant teams. These processes are for the most part not automated [...].''; ``Generating alerts and expecting humans to resolve the error manually based on suggestions.''; ``Did not do this [...]. Based on safety protocols this could not be secured'' \\\\\n\n% ### non-automated\n% notification & 4 & ``Generating alerts and expecting humans to resolve the error manually based on suggestions.'' \\\\\n\n% ### non-automated\n% none & 3 & ``Did not do this (if I understand the question right). Based on safety protocols this could not be secured''; ``None'' \\\\\n\n%Changing application logic & 9 & ``If there are many unsuccessful runs, the mechanism is disabled for a while to prevent wasting CPU time.''; ``Depending on the fault detected, the system can go into fail-safe modes [...]. This is done through re-parametrization at runtime and/or through modification of the lifecycle state of components [...]''; ``It uses a search algorithm to find candidates of schedules, and then evaluate the performance using the cost model.'' \\\\ \n%; Iteratively, it will find the optimal implementation (schedule) for the operators and then apply it in real applications.'' \\\\\n\nRestarting/deploying & 7 & ``Mostly just restarting the managed subsystems. In the case of Kubernetes HPA, its the horizontal scaling (up/down) of the Pods''; ``Generally restarts the unhealthy workload, but in the case of autoscaling can also be used to add or remove replicas''; ``... our pipelines use simple bash scripts to deploy previous versions when new versions fail.'' \\\\\n\n% ### restarting/deploying\n% automatic code deployment & 2 & ``... our pipelines use simple bash scripts to deploy previous versions when new versions fail.'' \\\\\n% ; ``[...] automatic deployment to staging environment of feature branches for which a merge request has been created'' \\\\\n\nMigration & 3 & ``Once the control process informs the control plane, it starts a workflow what we call as instance warming workflow which will dump items that supposed to go to that node from another replica and fills them.''; ``virtual machine (VM) migration or creation.'' \n%\n% ### migration\n% VM migration & 1 & ``virtual machine (VM) migration or creation.'' \\\\\n% This is because a controller can be considered as a software running on a VM. Whenever the controller location changes, VM migration is required. Similarly, a new VM will be created if a new controller is needed for increasing network workload. '' \\\\\n%\n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Change enacting tool} & \\textbf{19}\n\\\\\nKubernetes & 9 & ``Mostly just restarting the managed subsystems. In the case of Kubernetes HPA, its the horizontal scaling (up/down) of the Pods''; ``... to change topology we simply use K8S api to add/remove worker pods'' \\\\\n\nAWS & 7 & ``AWS based in-built auto scaling capabilities ''; ``Use the AWS ElasticLoadBalancer and also trigger actions via AWS Lamda functions when required.'' \\\\\n\nOther & 3 & ``IBM ITM, Log Analyzer, TCAM''; ``UC4 Automation Engine workflows that orchestrate kubernetes clusters''; ``Build-in Openshift mechanisms'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0": "What is the degree of automation of the majority of the self-adaptive solutions you work with in your organization? (Q3.4)",
        "2211.03116_351f99f925b397b2ba9a962748583f3e": "All 100 participants provided an answer to this question; Figure",
        "2211.03116_3426c82a5daf58da29879eab5ba27146": "Forty-seven participants reported mixed automation in their projects (both semi and fully automated), while 31 indicated semi automation and 19 indicated full automation",
        "2211.03116_6d3cdbdcb9952c93854b2fbd13a8358a": "Three participants selected other; two of them mentioned that there is no automation, the third stated",
        "2211.03116_e8273e68444cd89938774024f7d99cf1": "fully-automated till first incident.",
        "2211.03116_e294cb39e98cb6586e9e8125159ea3d0": "\\begin{table}[hbt]\n\\centering\n\\caption{Degree of automation of the self-adaptive solutions the participant has worked with (Q3.4).}\n\\label{tab:q3-4}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\nAutomation degree & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nMixed (Both Semi and Fully Automated) & 47 \\\\\nSemi automated & 31 \\\\\nFully automated & 19 \\\\\nOther & 3 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_cd49766e83683ee9ee72d67401086c98": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.6\\columnwidth]{Q3.4-fig.pdf}\n\\vspace{-10pt}%%%\n\\caption{Degree of automation of the self-adaptive solutions the participant has worked with (Q3.4).}\n\\vspace{-10pt}%%%\n\\label{fig:q3-4}\n\\end{figure}",
        "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4": "Do you reuse solutions to realise self-adaptation in systems you work with? (Q3.5)",
        "2211.03116_ac1a4a919fc36337093f136ba2918d36": "All 100 participants provided answers to this question that are summarised in Figure",
        "2211.03116_9f18c47056915a2574d9b3b94e927d35": "A majority of 71 participants reuse at least sometimes solutions in self-adaptive systems (44 of them reuse solutions frequently to always)",
        "2211.03116_10cb3319e64064109e715b8b49faefbf": "The other 29 participants rarely, very rarely or never reuse solutions.",
        "2211.03116_2fb9b0c335008141b2f1713c7840acea": "\\begin{table}[hbt]\n\\centering\n\\caption{Do you reuse solutions to realise self-adaptation? (Q3.5)}\n\\label{tab:q3-5}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\nAnswer & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nNever & 13 \\\\\nVery Rarely & 10 \\\\\nRarely & 6 \\\\\nSometimes & 27 \\\\\nFrequently & 26 \\\\\nVery Frequently & 14 \\\\\nAlways & 4 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_425aa8f092982c1c239a7bcfccc24108": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.7\\columnwidth]{Q3.5-fig.pdf}\n\\vspace{-10pt}%%%\n\\caption{Do you reuse solutions to realise self-adaptation? (Q3.5)}\n\\vspace{-10pt}%%%\n\\label{fig:q3-5}\n\\end{figure}",
        "2211.03116_3dd4a319b4b94243ae477d06da4483eb": "Please provide a concrete example of reuse you used to realise self-adaptation? (Q3.6)",
        "2211.03116_cf52fe996a987120a396d05d59048e28": "Sixty-seven participants provided examples of reuse in the realisation of the self-adaptive systems.",
        "2211.03116_8a49370ccc62ad364ff217df223fda90": "We focused on the subjects of reuse and identified five categories:",
        "2211.03116_5ea944ade78c2c60cf23b4866dbea55a": "The 67 participants provided in total 91 objects of reuse in adaptation, i.e., an average of 1.4",
        "2211.03116_c6ce8e7df3d0e9033cd54be29160af4f": "Code occurred 33 times, with",
        "2211.03116_57924eac5a5f54652b8c1ac0dcb1b72f": "as the top subject of reuse (18 instances)",
        "2211.03116_3c64cf03b835c669386a0d67f99bc040": "Design artifacts was mentioned 22 times with",
        "2211.03116_3c24fe63898e7a18ad04b72abb71b921": "as main subjects of reuse (each with seven instances)",
        "2211.03116_3c6c6ae1c1dc451a3a658bf079a007d1": "Specification was mentioned 18 times as objects of reuse, IT infrastructure 11 times, and procedures seven times",
        "2211.03116_7df436e912b6615f0c32ce149abaf85a": "The results demonstrate that reuse in self-adaptation is common practice, although the use of patterns (a topic that gets increasing attention in research) is limited.",
        "2211.03116_aba18774b240680f938adeb999fec6e5": "\\begin{table}[hbt]\n\\caption{Comments: Examples of reuse in self-adaptive systems (Q3.6).}\n\\label{tab:codes_q3-6}\n\\begin{tabular}{p{3cm}lp{9.7cm}}\n\\hline\\noalign{\\smallskip}\nCategories/codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Code} & \\textbf{33} &  \\\\\nModules & 18 & ``Self adaptation mechanisms used for speech recognition ... are also used for computer assisted coding solutions. ''; ``Different parts of the Behavior tree can be reused in different robots.''\\\\\nScripts and algorithms & 8 & ``The same scripts and solutions are constantly reused - because its the easiest way to create new with a constant lack of time.''; ``Threshold algorithms are reused frequently, with the threshold value adapted for the specific use case.''  \\\\\nLibraries & 7 & ``internal libraries that simplify monitoring, interaction with external tools, etc''\n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Design artifacts} & \\textbf{22}\n\\\\\nPatterns & 7 & ``We try to reuse design patterns (e.g. autoscaling) for all cloud native applications we build.''; ``Re-use of design patterns like MAPE-K. ''\\\\\nArchitecture & 7 & ``AWS stack\\,...\\,can be used as a generic template cross different applications which are based on a job processing ''\\\\\nKnow-how & 5 & ``We use similar principles in different product.''; ``We reused knowledge of driver parameter adaptation from FDM (3 axis) printer while designing a SLA (single axis) printer.''\\\\\nModels & 3 & ``machine learning cost models can be reused by different systems''\n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Specifications} & \\textbf{18}\n\\\\\nPolicies \\& rules & 5 & ``auto-scaling policies ... have a standard definition which can be reused in different systems or use-cases.''\\\\\nConfiguration files & 5 & ``K8s config files for different cloud native application can be similar''\\\\\nTemplates & 4 & ``We reuse very similar set of configuration templates of container deployment''\\\\\nMetrics & 4 & ``Kibana alerts''\n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{IT infrastructure} & \\textbf{11}\n\\\\\nFrameworks\\,\\&\\,platforms & 7 & ``a framework for monitoring metrics that allows labels to be given to properties, the time-series data to be tracked in a database, and then hooks to visualization database and alert systems.''\\\\\nTools & 4 & ``Use the same tools AWS provides for all our different product deployments.''\n\\\\\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Procedures} & \\textbf{7}\n\\\\\nProcesses & 3 & ``Writing \"watchdog\" processes for systems that aren't deployed to kubernetes''\\\\\nPipelines & 2 & ``pipeline (Application\\,-\\,Datadog\\,-\\,custom logic\\,-\\,AWS API) is replicated with different settings for different use-cases.''\\\\\nSchedules & 2 & ``Most of the approaches we use for digital twins share some history ... An example of that is in the scheduling space, where schedules need to adapt to changes in resources or the inclusion and removal of tasks.''\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81": "Why do you not often reuse solutions when realising self-adaptive systems? What hinders their reuse, please provide a short answer? (Q3.7)",
        "2211.03116_43507992707ef6c4eb1abc097085fea0": "This was a conditional question that was only asked to the participants that answered never or very rarely to Q3.5 (that asked whether participants reuse solutions to realise self-adaptation)",
        "2211.03116_b65b07bd4a3e1bff11cad6ad25223eb5": "Twenty-three participants provided such an answer to Q3.5.",
        "2211.03116_31a4846751e21116ba6c911699b21310": "From 18 participants that provided valid answers, we identified 19",
        "2211.03116_34d5924036806ff8e69a5758b5847954": ", i.e., an average of 1.1",
        "2211.03116_67c7d93e053a4e9f7b1370a548ffaa26": "The main hurdle reported by 11 participants is",
        "2211.03116_eaa96cb4b9ee16e953b38069c2bd8db0": ", hampering easy reuse",
        "2211.03116_2d8604cd88d42c29aa60e893d7b1a0ed": "Other hurdles are",
        "2211.03116_9c170490e0717b5997398dad9c3898a7": "in applying self-adaptation within the company (4 occurrences), and the",
        "2211.03116_c1c4ab4872b241ae07b0365da1b5d56a": "(each with 2 occurrences).",
        "2211.03116_8a271a75915293e25e3e779c14096337": "\\begin{table}[hbt]\n\\caption{Comments: Why not often reusing solutions\nwhen realising self-adaptive systems (Q3.7).}\n\\label{tab:codes_q3-7}\n\\begin{tabular}{p{3.6cm}lp{8.8cm}}\n\\hline\\noalign{\\smallskip}\nCategories/codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Reuse hurdles} & \\textbf{19} &  \\\\\nDifferent problems & 11 & ``In my case every self-tuning problem is different and prevents easy reuse.''; ``Our applications and application domains are very different and since we do research we actively look for new and different challenges.''\\\\\nLack of experience/maturity & 4 & ``I think lack of competence is a huge thing to overcome, though most of the organisations around us try to catch up '' \\\\\nSystem structure & 2 & ``The solutions were too coupled, too integrated and not enough modularized.''\\\\\nOrganisational concerns & 2 & ``We have to go through a legal department in order to reuse code from outside ... That poses a large problem. ''\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6": "How do you ensure that you can trust the self-adaptive solutions you build? (Q3.8)",
        "2211.03116_9670c5812cdb38b704a9454e3ec8530c": "Ninety-one of the 100 participants that worked with self-adaptation provided valid answers.",
        "2211.03116_118472070215bc786213079976644190": "The participants provided in total 152 instances of techniques for ensuring trust in the self-adaptive systems they build, i.e., on average 1.7 techniques per participant",
        "2211.03116_8273a65220485e55d0be988fb7f7bc5c": "We grouped the techniques in three categories:",
        "2211.03116_ecbded496a57acafa77a3c7c4f1a3ec9": "Testing and verification was mentioned 71 times with",
        "2211.03116_719679163ac48091bb2e80f94656bd47": "being the main technique occurring 58 times, followed by",
        "2211.03116_78c458980c024e1bb591b3c3aae72bd5": "occurring 10 times and verification (three times)",
        "2211.03116_36575f7f6f49da8b0617deb303d7969b": "Stakeholder-centred techniques were mentioned 45 times",
        "2211.03116_5930730d9360eafee6afcc2571d536bb": "In this category,",
        "2211.03116_b11522b4ce4d296734bab5b23ab81c1f": "(22 occurrences) and",
        "2211.03116_693b90b095826e22e6ecc563dbeff670": "(10 occurrences) were the main reported techniques",
        "2211.03116_76cd1ebb345ed0326a51e45ee78b875d": "Finally, online techniques were mentioned 36 times with",
        "2211.03116_012c1bd97d977c40f648a9fec161bf33": "as main reported technique (27 occurrences)",
        "2211.03116_e233431b31bdf1173a1dc6603322d8cd": "In contrast to an important focus of research in self-adaptation, (formal)",
        "2211.03116_b9f3721cac10ca923075ddc83fcbfbfb": "as a technique to ensure trust was only mentioned three times.",
        "2211.03116_1a58d9541581f52dbe7e2eafcf4de4e6": "\\begin{table*}[hbt]\n\\caption{Analysis of comments - Techniques for ensuring trust in self-adaptive solutions (Q3.8).}\n\\label{tab:codes_q3-8}\n\\begin{tabular}{p{3.6cm}lp{8.8cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Testing and verification}  & \\textbf{71} &  \\\\\n\nExtensive testing & 58 & ``We use extensive testing (unit, module, system)''; ``We have extensive testing on test k8s clusters, provisioned for these purposes. ''; ``We have countless amount of testing and verification code built as part of the OpenJDK to ensure the quality of the product is appropriate. ''\\\\\n\nBenchmarking & 10 & `As a lot of the self adaptation logic involves optimization opportunities, we also regularly run many benchmarks and immediately report regressions''; ``We do testing of the machine learing models, but we also have pilot factories where we test our methods and design to see if all station perform as itended.'' \\\\\n\nVerification & 3 & ``expert testing, supervision, verification when applicable''; ``Testing, but also some human verification as part of the Cloud Operations team.''\n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Stakeholder-centred techniques} & \\textbf{45} &  \\\\\n\nHuman supervision & 22 & ``Human supervision until confident.''; ``Extensive system testing and gradual release of human supervision levels upon system going live.'' \\\\\n\nRigorous design and development & 10 & ``''; ``virtual training to ensure operators understand and are comfortable with the conditions in which the safety system will engage.'' \\\\\n\nTrust in third-party software & 8 & ``for features like auto-scaling compute ... we use trusted vendors and deploy these features mainly for analytics use cases which are not business-critical.'' \\\\\n\nOperational constraints & 5 & ``the concrete actions that are taken by the system are defined by the user. so there is never a surprise. the system only decides if and when to apply these actions.''; ``Our autotuning algorithms never fail for particular (exactly specified) set of systems. If the system fulfils these assumptions, it works always.'' \n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Online techniques} & \\textbf{36} &  \\\\\n\nRuntime monitoring and alerting & 27 & ``In cases where an existing system is not being replaced but rather new capability is being added, results will be tracked over time to ensure accuracy.''; ``we have deployed some alert to track the high-level properties of the system.'' \\\\\n\nContinuous testing during operation & 6 & ``there is gradual canary testing in the real production system. ''; ``Automated test scripts, automated \"synthetic transactions\" in production, model performance validation'' \\\\\n\nMitigation strategies & 3 & ``This automation can provide alter with all the steps and rollback automatically if there is any issue. '' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_c60e4a3f3d4f9450e76b846ee3380cbc": "Resource usage and system load are the main types of monitoring metrics used in practice",
        "2211.03116_9cf86e3ebc06039ae616574ea7702ac3": "These metrics are primarily tracked by sensors in the environment and the system.",
        "2211.03116_0f70ccb50c9df141d6687dbf89474774": "Practitioners use various mechanisms for analysis in realising self-adaptation, with data analysis methods and comparison to thresholds as main mechanisms.",
        "2211.03116_d875c6cca2dfa017224d33232b6ec7b3": "A wide range of mechanisms are used to enact self-adaptation in industrial systems with auto-scaling and reconfiguration as top mechanisms.",
        "2211.03116_80461d879f6c62bc3c4af07195c6a604": "Practitioners extensively rely on tools such as Kubernetes and AWS to support the realisation of different functions of self-adaptation.",
        "2211.03116_0e565a373952593a3e5cdf1834a3c76c": "Industrial systems apply a mix of semi and fully automated adaptation.",
        "2211.03116_6a426fb7ed9509008a05e4c1e7b76f2d": "A majority of practitioners reuse solutions when applying self-adaptation, mainly in the form of code, design artifacts, and specifications.",
        "2211.03116_528b6efef89cf3b9640555aad48c9cd9": "Ensuring trust in industrial self-adaptive systems is mainly achieved through extensive testing, runtime monitoring and alerting, and human supervision.",
        "2211.03116_18faa3e74775e23d0a9612dcc958f22c": "RQ4: Difficulties, Problem Support, and Opportunities",
        "2211.03116_812de806f5277831f304de073ded508b": "Did you encounter particular difficulties when engineering or maintaining self-adaptive systems you worked with? (Q4.1)",
        "2211.03116_581dbfb3ac7fed2209aa3c457ac4224c": "Forty-one of 100 participants report that they sometimes face difficulties with applying self-adaptation",
        "2211.03116_6bf1e569213b007945ba1c9bd29c0ced": "Thirty encounter difficulties frequently or very frequently, while 17 rarely or very rarely have difficulties",
        "2211.03116_22cb74a60b2b38943d25e3248fe15138": "Four participants reported to have always problems, while eight reported that they never face difficulties.",
        "2211.03116_b89405ca9e422ffcfba5b5a5b90db55d": "\\begin{table}[hbt]\n\\centering\n\\caption{Did you encounter difficulties when engineering or maintaining self-adaptive systems? (Q4.1)}\n\\label{tab:q4-1}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\nAnswer & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nNever & 8 \\\\\nVery Rarely & 12 \\\\\nRarely & 5 \\\\\nSometimes & 41 \\\\\nFrequently & 24 \\\\\nVery Frequently & 6 \\\\\nAlways & 4 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_5d5cb0cd0f2123e0c0d6cdb698be9621": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.7\\columnwidth]{Q4.1-fig.pdf}\n\\vspace{-10pt}%%%\n\\caption{Did you encounter difficulties when engineering or maintaining self-adaptive systems? (Q4.1)}\n\\vspace{-10pt}%%%\n\\label{fig:q4-1}\n\\end{figure}",
        "2211.03116_cfe0d786e2168056e0e021ac99d156c5": "Please give one or two examples of the difficulties that you encountered when engineering or maintaining self-adaptive systems. (Q4.2)",
        "2211.03116_45baeacbc273754f4e931cd8b1721646": "Seventy-four participants reported in total 140 difficulties, i.e., on average 1.9 difficulties per participant",
        "2211.03116_b4261d6b2aaf78eea1103c70a29ad8e7": "summarises the findings.",
        "2211.03116_a825c1505d63920423ecb832a384c273": "\\begin{table*}[hbt]\n\\caption{Analysis of comments -- Difficulties with engineering or maintaining self-adaptive systems (Q4.2)}\n\\label{tab:codes_q4-2}\n\\begin{tabular}{p{3.6cm}lp{8.8cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Design issues} &  \\textbf{43} &  \\\\\n\nReliable/optimal design & 26 & ``With high availability requiremets, the chance something fails somewhere sometime is close to a 100\\%. The systems needs to be designed to still provide service despite erroneouse behavior or failing parts in the system.''; ``the main challenge is to design adaptation function with respect to computation context'' \n%- e.g., selecting right trade-off between shutting down instance or keeping it running longer time since boot of instance can be time-consuming.'' \n\\\\\n\nDesign complexity & 17 & ``Complexity in defining the adaptation rules. Conditions are not always obvious.''; ``Self-adaptiveness or resilience have to be taken into consideration at each stage of the \n%software production and operation \n... workflow. This is really a challenge as more often than not these are concepts that are completely obscure to the average programmer/devop mind.'' \n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Lifecycle issues} & \\textbf{42} &  \\\\\n\nTuning/debugging & 19 & ``Debugging the root cause of a scaling failure might be time-consuming: also, in some cases the problem might be outside of your control (e.g. temporary lack of EC2 Spot capacity in AWS)'' \\\\\n\nLimitations tools/methods & 13 & ``The metrics available are not always fully transparent and built with auto-scaling in mind''; ``IAM permissions are hard to deal with when configuring these self-adaptive systems. Usually, the permission to scale or to notify is not properly configured.''\\\\\n\nSystem/environment evolution & 10 & ``If the functionality is not designed in from the beginning then it is a huge amount of work to implement later.''; ``System architecture over lifetime (nee features to be added...)''\n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Runtime issues} & \\textbf{30} &  \\\\\n\nRuntime uncertainty & 17 & ``Many self-adaptive systems are based on unproven heuristics. Therefore, they usually do not work in many cases.''; ``It is hard to guess how much can the environment affect the system. ... \n%Usually, we develop the system on one or a limited set of units. \nIt is hard to extend the parameters to cover whole production.'' \\\\\n\nData collection/evaluation & 7 & ``Gathering quantitative data samples to evaluate the performance is very complicated.''; ``sensors gives wrong reading values'' \\\\\n\nResources required & 3 & ``Sometimes it doesn't react fast enough. It also takes computation resources for this self-adaptive software, and the compute resources use increases with the number of incoming requests.'' \\\\\n\nDelayed/missing runtime changes & 3 & ``Autoscaling is often too slow or triggered too late.''; ``Notifications are delayed or missed'' \n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{People and process issues} & \\textbf{19} &  \\\\\n\nSkills/experience & 14 & ``Every self-adapt system must be tuned up which is sometimes tricky and needs high skilled engineers.''; ``The Kubernetes/Openshift cloud and centralized log storage ... require experienced administration staff and vast knowledge of many networking concepts (... DNS, NAT).'' \\\\\n\nProcess and management & 9 & ``We are not yet very experienced ... the main challenges were to convince the central IT department this was the way to go, then to design the system, and obviously to master the technology itself.'' \\\\\n\nAutomation & 1 & ``often automation is not trusted enough by humans. humans want to stay in the loop.'' \\\\\n\n\n\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_9d524215fe69f8f8661d27dc1e5a5e5f": "We identified four categories of difficulties:",
        "2211.03116_5f4efa3e2e1da34f10744256c12db608": "Most frequently reported difficulties, 43 in total, relate to the design of self-adaptation, in particular",
        "2211.03116_904f8a3921420be219030fab8e8b7782": "(26 occurrences) and",
        "2211.03116_0fce2225ecbb24425445a29549f30734": "(17 occurrences)",
        "2211.03116_899b79860f28c7aee4003c13a31fdaa0": "Life cycle issues were reported 42 times, in particular",
        "2211.03116_b6625b9c3b4b0bfa36c2173a2bd5a25c": "(19 occurrences) and",
        "2211.03116_2c515803b13d4fda3acfa1f095578053": "(13 occurrences)",
        "2211.03116_f229e2ce0f050e17b7236963da8b54b1": "Difficulties with runtime aspects of self-adaptive systems was reported 30 times with",
        "2211.03116_400f594c73128edc6e6207e0cc3bf72d": "mentioned 17 times, and difficulties related to people and process occurred 25 times with",
        "2211.03116_41230186f181617e263f06c19645d18d": "occurring 14 times.",
        "2211.03116_ae4790d843bbcdfa05a33447720d9e22": "Did you face any risks when engineering self-adaptive systems? (Q4.3)",
        "2211.03116_68c7109dffb5368f2aaadaee8fbdcfe9": "Thirty-four of 100 participants report that they sometimes face risks when engineering self-adaptive systems",
        "2211.03116_e7241d5da6efe4ec0b720a77271be27e": "Eighteen report that they frequently to always encounter risks, while 48 rarely to never face risks.",
        "2211.03116_671e414b9d4fe459d1ac8fbccae0ed96": "\\begin{table}[hbt]\n\\centering\n\\caption{Did you face any risks when engineering self-adaptive systems? (Q4.3) -- 100 answers}\n\\label{tab:q4-3}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\nAnswer & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nNever & 18 \\\\\nVery Rarely & 20 \\\\\nRarely & 10 \\\\\nSometimes & 34 \\\\\nFrequently & 11 \\\\\nVery Frequently & 2 \\\\\nAlways & 5 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_b863cfdcfd8165ae3346b091a0b34dc9": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.7\\columnwidth]{Q4.3-fig.pdf}\n\\caption{Did you face any risks when engineering self-adaptive systems? (Q4.3) -- 100 answers}\n\\label{fig:q4-3}\n\\end{figure}",
        "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682": "Briefly describe one or two risks that you faced when engineering self-adaptive systems. (Q4.4)",
        "2211.03116_5406b3e873ac872a4bf72d24afe0bd1f": "The participants provided a total of 60 responses containing 66 instances of risks faced when engineering self-adaptive systems",
        "2211.03116_230b98c69dd450259e6faf014216fa3b": "On average, the participants reported 1.3 risks.",
        "2211.03116_2521d7d3daceb5f5950e102ba0a3939f": "Out of the 60 valid answers, 11 were marked as unclear or not applicable",
        "2211.03116_7b7e317e6097933690071fba79f3a42b": "We identified four categories of risks:",
        "2211.03116_29c397fc03082051e9e833d5d0ce680f": "Most frequently mentioned risks, 20 in total, relate to faults, in particular",
        "2211.03116_6a1a12deac4a5ed52bb8286fe694ac04": "(7 occurrences),",
        "2211.03116_f9d439e9e6da72c561437c38b34ee7ba": "(4 occurrences each), and",
        "2211.03116_4ff43013c374180cee9587d609489a00": "(2 occurrences)",
        "2211.03116_18e909e666a4b503c5f751d8d99e92fc": "Difficulties with development/operation relate to",
        "2211.03116_0495fe86311a75bc36944fe8beaa4600": "(6 occurrences), and",
        "2211.03116_00c5f1f168e2db83b57b84b71cdd86fd": "(4 occurrences each)",
        "2211.03116_f8ef106ea5b4f90a2d8b0364957c9a7e": "Participants mentioned also the risk of having several qualities impacted;",
        "2211.03116_4240a386ebdbd6cfa5d6c8fc29532263": "with 5 occurrences the most frequent, followed by",
        "2211.03116_7f8c3d88c20ff94089e56cd1b179b4df": "with 4 occurrences each",
        "2211.03116_8b5a0258281fbd89e4cd8da9b8e1c550": "Finally, negative impact on the business in terms of",
        "2211.03116_02b220572ecea8086d615c72521d20a4": "(5 occurrences) and",
        "2211.03116_8791637edc00c5ec1c17daaead86eef3": "(4 occurrences) are also reported as important risks when applying self-adaptation.",
        "2211.03116_bc29ae1edc120400673f6cee3387f8d3": "\\begin{table*}[hbt]\n\\caption{Analysis of comments I -- Risks faced when engineering self-adaptive systems (Q4.4).}\n\\label{tab:codes_q4-4.I}\n\\begin{tabular}{p{3.6cm}lp{8.8cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Faults} & \\textbf{20} &  \\\\\n\nIncorrect functionality & 7 & ``Automation can lead to unexpected values''; ``The process might be OOM killed if the self-adaptive system doesn't function correctly (i.e. bugs).'' \\\\\nWrong results & 4 & ``incorrect results''; ``Wrong decisions based on faulty models'' \\\\\nMisconfiguration & 4 & ``Tuning autoscaling settings can be problematic resulting in unexpected results.''; ``Wrong threshold levels may lead to unwanted responses. '' \\\\\nNetwork failure & 2 & ``Giving control to software that can change production environments can cause network failure.'' \\\\\nOther & 3 & ``data loss''; ``[...] heuristics that work well on some applications, do not always perform the best for all applications.'' \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Difficulties with development/operation} & \\textbf{16} &  \\\\\n\nDifficult to manage environment uncertainty & 6 & ``We face a risk of underestimating environment variability.''; ``Legacy monitoring solutions don't cope well with environments that scale back.''; ``Risk may be encountered if the incoming event stream is completely unpredictable and have huge spike differences in data for a considerable period of timr'' \\\\\nDifficult to test & 4 & ``if the executed actions that will be done by the self-adopting system are not tested before, it might introduce some risks''; ``It is also difficult to do reliable performance testing in non-production environments.'' \\\\\nDifficult to build & 4 & ``implementing and designing self-adaptive systems may initially seem to take longer time  hence the risk of not being allowed to implement it as good as it can be done''; ``Costs of building own (self-hosted) environment [...]'' \\\\\nOther & 2 & ``life updates (no downtime)''; ``There is always a lingering concern of quis custodiet ipsos custodes - or 'who watches the watchmen'.'' \\\\\n \n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_b20998da0eb2326120ff448c074e9c75": "\\begin{table*}[hbt]\n\\caption{Analysis of comments II -- Risks faced when engineering self-adaptive systems (Q4.4).}\n\\label{tab:codes_q4-4.II}\n\\begin{tabular}{p{3.6cm}lp{8.8cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Impact on qualities} & \\textbf{16} &  \\\\\n\nPerformance degradation & 5 & ``[...] risk of degrading the performance instead of improving it, and degrading the user experience as a result.''; ``Performance impact on the running system when applying auto-scaling (e.g. scaling down)''; ``sometimes a sequence of perfectly acceptable self-adaptive automatic actions can lead to outages worse than the root cause'' \\\\\nReduced availability & 4 & ``If the system did not behave properly this could result in an outage [...]''; ``Availability of the system during the auto-scaling rules being applied''\\\\\nSafety and security threats & 4 & ``If a system is self-adaptive, how can we secure that it is safe during production (some parts can be powered for self test during assembly and we need to know it is safe)? If we use machine learning on a self-adaptive system, how do we secure safety? \n''; ``There is a risk of misconfiguration that can lead to lost nodes and applications, security exposures etc. There are also security risks involved with the base building components, such as docker images from untrusted sources [...]'' \\\\\nExtra resource consumption & 2 & ``Risk of all resources being eaten up by a self-adaptive process.''; ``[...] it may use up too many unnecessary hardware and software resources'' \\\\\nReliability issues & 1 & ``Reliability issues in case of non-converging oscillations or plain wrong output due to prolonged failures in the metrics collection pipelines or simply wrong algorithms'' \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Impact on business} & \\textbf{14} &  \\\\\n\nIncreased cost & 5 & ``Regarding autoscaling, the main issue was to fail and so increasing the infra cost of the users due to bugs in the system.''; ``Lost control over system size. This also impacted the approx. total cost agreed with the customer.'' \\\\\nLosing trust and control & 4 & ``Trust. Because flexible manufacturing systems have some kind of autonomous behavior with tasks that have been done manually, our clients are initially very sceptial and to not trust the systems initally''; ``risk of losing (manual) control of the system for the sake of automation'' \\\\\nHarder to understand/fix & 3 & ``the whole system becomes more complex, hence fewer people understand all details of its behaviour.''; ``More difficult troubleshooting for a self-adapting, distributed system.'' \\\\\nNot useful & 2 & ``The self-adaptive system might not perform better than the baseline when dealing with dynamic shapes, as the cost model might not be generic enough to predict the performance.'' \\\\\n \n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_0ed1248facd92ad130324096aeb35989": "How did you mitigate the risks that you faced? (Q4.5)",
        "2211.03116_3f9e69703d7a2a3f0e0502eb60d51fa6": "The participants provided 51 responses containing 66 instances of risk mitigating techniques when engineering self-adaptive systems, i.e., on average 1.3 techniques per participant.",
        "2211.03116_fe6aee9dede7f54bb74710947e5a8abb": "Out of the 100 valid answers, 13 were marked as unclear or not applicable",
        "2211.03116_1bccb366a251bbadc7b886b20eb48f40": "The other participants mentioned a variety of risk mitigation mechanisms, which we grouped into three categories.",
        "2211.03116_9a5d3d986aff7e63b8d1a14aaeac2fa3": "are the largest category with 25 occurrences, followed by",
        "2211.03116_bb4f4573ba74707510e2b17e661a3fff": "with 18 and 9 occurrences each",
        "2211.03116_59617e90c21eb9e4ad369bc8adcfbfed": "Within stakeholder-centred techniques,",
        "2211.03116_6bee988f9023d2ba920c281614fe95f2": "(8 occurrences),",
        "2211.03116_51f9dd27542ef48a30c03c2fb3f36d42": "(4 occurrences), and",
        "2211.03116_4122623175562cbe2df4f55ddaea9f6f": "(4 occurrences) are the most popular risk mitigation techniques.",
        "2211.03116_7e3d8ff33021df1de838cd029f5cd12b": "with 15 occurrences is the mostly mentioned offline technique, while",
        "2211.03116_74fdb4b8ea3f35f8159413461045e310": "with 6 occurrences is the mostly mentioned online technique to mitigate risks.",
        "2211.03116_41ba391bdd2c155eb5e267cdd39942a9": "\\begin{table*}[hbt]\n\\caption{Analysis of comments -- Techniques to mitigate risks when engineering self-adaptive systems (Q4.5).}\n\\label{tab:codes_q4-5}\n\\begin{tabular}{p{3.6cm}lp{8.8cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Stakeholder-centered techniques} & \\textbf{25} &  \\\\\n\nRigorous design and development & 8 & ``careful engineering so that there are open doors for manual intervention, when necessary, without lost of system availability nor hindering the automation mechanisms''; ``We try to have design sessions [...] and possibly enhance the design in the early phases of development''; ``Engineering analysis, testing, controlled deployment, ...'' \\\\\n \nCode review & 4 & ``As always, planning, design reviews, code reviews, testing on several levels, monitoring the production.''; ``Each incident is taken into consideration and rules are always reviewed. '' \\\\\n \nHuman supervision & 4 & ``The responsibility was left to a human operator.''; ``Mainly by performing tests and human supervision (monitoring resource utilization)'' \\\\\n  \nOutsource & 3 & ``Outsource the cloud operation to a specialized provider (RedHat, AWS) where possible. In other cases, customers had to hire experienced administrators/go through extensive period of testing to gain the necessary experience.'' \\\\\n\nOther (post mortem analysis, hiring experts, work in pairs, documentation) & 6 & ``When we hit a problem years after the fact, we perform a detailed post-mortem and try to think about other possible failures we may have missed.''; ``We hired (multiple) external consultancy firms to tap into their experience in deploying such a system.''; ``Work in pairs,\nDocument architectural decisions'' \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Offline techniques} & \\textbf{18} &  \\\\\n\nExtensive testing & 15 & ``test each action in isolation before it is provided to the system''; ``Automated and human testing. In addition for complex algorithms, we run parallel, correlated analysis.''; ``With automated and manual testing while injecting non-determinism to the test suite''; ``Extensive testing at the customers factory and fine tuning of the models.'' \\\\\n \nSet operational boundaries & 2 & ``Defined max-amount of resources a system functionality/component is allowed to consume.''; ``Thresholds and some manual monitoring'' \\\\\n \nEncryption  & 1 & ``State of the art encryption, encryption, and encryption.'' \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Online techniques} & \\textbf{9} &  \\\\\n\nRuntime monitoring and analysis & 6 & ``Alerts tracking high-level properties that can give us some assurance that the system is working fine.''; ``Monitor / review the automated actions.'' \\\\\n \nRoll-out/roll-back strategies & 2 & ``Slow roll - only send the new system traffic in small increments (10\\%, 20\\%, ...) until production baselines are established for load, actual latency, etc.  This helped us determine what the MIN and MAX pod settings should be as well as VM heap sizes.''; ``Manual roll back to previous stable state of user profiles.'' \\\\\n \nRun in non-business critical hours & 1 & ``We run our processes during the night, when there is less chance of interference with business critical (customer facing) systems.'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_7a37b43e91d7cd1dc529ea7521326591": "Have you faced or seen any problems of self-adaptation for which you would appreciate support from researchers (Q4.6)",
        "2211.03116_89eaf14f22f934ad829cc14d8bef536b": "summarises the findings for Q4.6",
        "2211.03116_da9f0f2ba063abdf9247b1a8b02a9165": "Thirty-three of 166 participants (17.9",
        "2211.03116_ac66add410fcc2ed7c2586fc51cc6dad": ") frequently to always experience problems with self-adaptation for which they would appreciate support from researchers, while 43 participants (23.4",
        "2211.03116_a56d8c24b031a731ae6bd7cc3012ba0a": ") sometimes face such problems",
        "2211.03116_dcecf1a4e7597a8c88feaee605a75d5d": "On the other hand, 108 of the participants (58.7",
        "2211.03116_f70e8d55f2c31e80d6e4ccf26c93268e": ") never to rarely experience problems for which they would appreciate support from researchers",
        "2211.03116_ed3ed980d0d0ffb971bee377c3615c67": "In summary, almost half of the participants believe that they would benefit from support of researchers to address some of the problems they face with engineering self-adaptive systems.",
        "2211.03116_4e85968a3aa1a78bec8e3ce75accba79": "\\begin{table}[hbt]\n\\centering\n\\caption{Have you faced or seen any problems of self-adaptation for which you would appreciate support from researchers? (Q4.6)}\\vspace{-5pt}\n\\label{tab:q4-6}\n\\begin{tabular}{ll}\n\\hline\\noalign{\\smallskip}\nAnswer & Quantitative \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nNever & 51 (27\\%)\\\\\nVery Rarely & 43 (26\\%)\\\\\nRarely & 8 (5\\%)\\\\\nSometimes & 38 (23\\%)\\\\\nFrequently & 21 (13\\%)\\\\\nVery Frequently & 6 (4\\%)\\\\\nAlways & 5 (3\\%)\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\\vspace{-5pt}\n\n\\end{table}",
        "2211.03116_5b5858e9ae58ac3db54010851c02a980": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.7\\columnwidth]{Q4.6-fig.pdf}\n\\vspace{-10pt}%%%\n\\caption{Have you faced or seen any problems of self-adaptation for which you would appreciate support from researchers? (Q4.6)}\n\\vspace{-10pt}%%%\n\\label{fig:q4-6}\n\\end{figure}",
        "2211.03116_6e531135b338fad33543d17be078b57a": "For which problems of self-adaptation would you appreciate support from researchers? Please briefly explain one or two such problems (Q4.7)",
        "2211.03116_b38a42a622923f78465b412e6d8ef1ac": "Sixty-five participants described in total 113 problems for which they would appreciate support from researchers",
        "2211.03116_dabce867963a1600e390591d2d222d14": "summarise the findings.",
        "2211.03116_af06e314c414d383ec2741e7c4824399": "We grouped the problems in four categories:",
        "2211.03116_f9df54f88a7d787b85f44ed6c520af85": "Forty-eight of the reported problems (42.5",
        "2211.03116_6b09b37158ceee0bf463cc94b50ced65": "of the reported problems for which practitioners would appreciate support from researchers) relate to the engineering of self-adaptive systems",
        "2211.03116_82e553615b42db1fd6e4ca43470a7ff5": "The main problems in this category relate to",
        "2211.03116_29033133733f6552fac45782dc41184d": "(16 occurrences) and the",
        "2211.03116_a2b01fe2ca93a4e24d42fd2f06479186": "of self-adaptation (10 occurrences)",
        "2211.03116_00e0840730ccbf6748e4bb3fff3a0119": "Adoption refers to problems within a company with introducing self-adaptation, which can be related to technical aspects, expertise, or organisational aspect",
        "2211.03116_e8e05850234fa3ffdf0f440cc71a2726": "Twenty-five of the reported problems (22.1",
        "2211.03116_504433bf1bee406c87cd4ec7d8aef916": "of all reported problems) relate to guarantees, in particular providing",
        "2211.03116_35cb26e23576ff581bbff6da2aea77c1": "(20 occurrences) and dealing with",
        "2211.03116_6f1d898d2b1259b3f3d91b2c16471745": "(five occurrences)",
        "2211.03116_f81450a270b387aff4c7a23b75ae7dc3": "Problems related to data were reported by 21 practitioners (18.6",
        "2211.03116_e9b3a3ee07c1579979e3e83200ff6059": ") and include",
        "2211.03116_444172abf3cd054e2d0a786b1c0526ac": "(both eight occurrences), and",
        "2211.03116_356531e877f92351b8dea9184a335942": "The remaining 19 problems (16.8",
        "2211.03116_cdf67440ef482e6c1eca6703a9535ca6": ") relate to user interaction, namely",
        "2211.03116_0a501b6c757a9fc5ddb7e8d353ef2095": "(nine times) and",
        "2211.03116_80afb3134ba89c39c2e327a64b62853a": "(seven times).",
        "2211.03116_44e1e932220a9889a69d6135813d9b6a": "\\begin{table*}[hbt]\n\\caption{Analysis of comments I -- Problems for which support of researchers would be appreciated (Q4.7)}\n\\label{tab:codes_q4-7.I}\n\\begin{tabular}{p{3.2cm}lp{9.2cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Engineering} & \\textbf{48} &  \\\\\n\nArchitecture \\& reuse & 16 & ``Best Practices for implementation and architectural design guidelines''; ``I'd love to see a taxonomy of self-adaptive techniques. Perhaps a set of techniques could be added to Kazman's Architecture Tactics checklist?'' \\\\\n\nAdoption & 10 & ``We lack interaction with development teams that are facing similar problems. We have a huge problem explaining this area to the management structure. ... they have basically no ability to lead due to lack of competence.''; ``new organisational structures and workflows that lead to the design of more self-adaptive and resilient platforms.'' \\\\\n\nPlatforms \\& frameworks & 4 & ``to my knowledge there is no framework on what is 'safe' or not safe to be automatically executed by a self-adaptation system.''; ``To provide a platform for capturing the domain knowledge i.e. extensible ... to manage the managed systems what kind ... KPIs can be captured, and how they are related.''  \\\\\n\nTools & 4 & ``Outlier detection ... is well understood but existing commercial tools are usually pretty weak and custom code is required to optimize''; ``One of the main problems is to get tools that can profile the running systems under certain loads.'' \\\\\n\nTesting \\& debugging & 4 & ``Assurance of the behavior of highly dynamic systems is still the big hurdle. Test budgets and schedules do not grow with system complexity.''; ``a pre-production cloud test environment to try them first.''  \\\\\n\nAdvanced features & 10 & ``Coordinate multiple, potentially conflicting, objectives - in changing environment ... reacting too quickly [is] often sub-optimal''; ``research on network protocols, these should include some level of self-awareness and should automatically provide common network self-adaptation features.''; ``How a feedback loop can be designed in a way that you later can adapt to changes''  \n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Guarantees} & \\textbf{25} &  \\\\\n\nTrustworthiness & 20 & ``Formal verification of the algoritmic behaviour of the overall system (correctness)''; ``validate my algorithms''; ``Safety protocols for Machine learnign in self-adapting systems''; ``What are the mechanisms should be integrated into self-adapting system to identify malicious input?'' \\\\\nUnknowns & 5 & ``We normally capture this using some form of process based models, but these struggle with thin[g]s like unknowns.''; ``not just anomaly detection, but actually responding appropriately to the anomalies (what is appropriate?).''  \n\\\\\n\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_d3c05edee0b18305e69bcc9ecd4ee7db": "\\begin{table*}[hbt]\n\\caption{Analysis of comments II -- -- Problems for which support of researchers would be appreciated (Q4.7).}\n\\label{tab:codes_q4-7.II}\n\\begin{tabular}{p{2.7cm}lp{9.7cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Data} & \\textbf{21} &  \\\\\n\nData governance & 8 & ``Data alignment and ... its integration''; ``getting data from application behaviour helps a lot in analyzing how application performance can be further improved.''; ``Adaptive AI systems to manage huge document contents'' \\\\\n\nData access & 8 & ``Support for data science as to extract correct cause relationships vs apparently correlations''; ``For example, how much data is shared across threads, how many objects are thread-local, how much performance is lost due to locality issues''  \\\\\n\nMachine learning & 5 & ``if the data/metrics can be structured and labelled in some way (i.e. scored), then perhaps it should be possible to apply ML to help identify opportunities and figure out automatically how to respond.''; ``How to use machine learning to solve the self-adaptation problems and demonstrate its performance bound'' \n\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{User interaction} & \\textbf{19} &  \\\\\n\nAutomation & 9 & ``volume of data gets to large for people to process. People get to be the bottleneck for throughput''; ``Automatic synthesis of predictive and or reconfiguration models.''; ``Approaches whereby systems of reasonable scale can monitor and fix themselves as necessary without human intervention.''\\\\\n\nUser experience & 7 & ``most of the problems that we faced are related to help the customer to understand the benefits of self-adaptative systems.''; ``Autoscaling should become commodity products ... As users, the complexity should be abstracted away'' \\\\\n\nUser involvement & 3 & ``User response can also be used for adaption (E.G. if a user constantly overrides the managed systems settings there managing system should 'learn' from the user and adapt the control algorithm for that specific user)'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_72d23e74521291c742180a3b646b1ffb": "In your organisation or in industry in general, do you see application opportunities for self-adaptation that are currently not exploited? (Q4.8)",
        "2211.03116_d7a346414be1090d266e62cac4dacd6f": "Of the 184 participants, 101 (54.4",
        "2211.03116_69430798cac68a684b74a8a591a17fde": ") highlight new opportunities for applying self-adaptation, while 83 do not report any",
        "2211.03116_96c722e57eb610abb62b2bfa66c212f9": "The number of participants within these two groups is almost equally split among participants who have worked with concrete self-adaptive systems and those who have not (see Q0.1) (in particular, 58 participants that worked with self-adaptive systems report opportunities, while 42 do not).",
        "2211.03116_d5f680abb6b746207f975894f8f74a65": "Please describe or give examples of the application opportunities for self-adaptation that are currently not exploited (Q4.9)",
        "2211.03116_eeabcae2eb99ff2bbb4e36f35f6d5caa": "Eighty-five participants described in total 147 unexploited opportunities for applying self-adaptation, i.e., an average of 1.7 opportunities per participant.",
        "2211.03116_ec957c1a29d67a810b9dee9b6c70b59a": "\\begin{table*}[hbt]\n\\caption{Analysis of comments I -- Opportunities for self-adaptation that are not exploited yet (Q4.9)}\n\\label{tab:codes_q4-9.I}\n\\begin{tabular}{p{3cm}lp{9.4cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{System activities} & \\textbf{72} &  \\\\\n\n Autonomous operation & 37 & ``E.g manufacturing production line with visual inspection operators who remove defects, ... the production line can further be adapted based on the defect rate/type''; ``Self adaption could have a lot of benefits in building automation systems, like smart heating and lighting systems that takes peoples habits into consideration.''; ``making the system adaptive to adjust and act instantly based on the data without waiting would be beneficial and efficient.'' \\\\\n \nData management \\& machine learning & 26 & ``Methods to automatically handle changes in the machine learning models and to efficiently deploy them to the edge. There is still lots of manual fine tuning that delays a timely new release.''; ``The query optimizer of database (i.e. MySQL) could utilize self-adaptation technic.'' \\\\\n \n Autoscaling & 9 & ``The \"managed service\", which is a stateful service/ data store, is provisioned for the peak capacity, which means resources are idle most of the time. If we can build reliable and efficient system that can automatically scale stateful services based on the demand, we can reduce the cost.''; ``Our microservices do not dynamically scale'' \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{System properties} & \\textbf{47} &  \\\\\n\nQuality improvement & 26 & ``Based on the alarm certain counter actions could be initiated in order to deal with the faulty behaviour and reach a stable system state.''; ``Congestion prognosis''; ``fault tolerance''; ``Power consumption''; ``resource optimization''; ``There are many opportunities to split up [current monolithic systems] and then make them scalable such that outages are more contained. E.g. screens on trains.'' \\\\\n\nSecurity improvement & 10 & ``Security of e.g., mobile devices that adapts based on locally identified threats as well as knowledge of risks in the environment.''; ``Automating changes in Security levels based on threat levels''; ``Detecting in-vehicle threats, detecting a system being compromised''; ``react to attack patterns'' \\\\\n\nCost effectiveness & 8 & ``IT cost reduction (e.g. software asset mgmt)''; ``The question really is: How do you do these things on the cheap (with non Silicon Valley billion dollar funding) and in contexts where mistakes might be extremely critical?'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_ed594d35f7842e51371527a9b7869085": "\\begin{table*}[hbt]\n\\caption{Analysis of comments II -- Opportunities for self-adaptation that are not exploited yet (Q4.9).}\n\\label{tab:codes_q4-9.II}\n\\begin{tabular}{p{3.1cm}lp{9.4cm}}\n\\hline\\noalign{\\smallskip}\nCategories and codes & \\# & Example quotes\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\n\\textbf{Engineering activities} & \\textbf{21} &  \\\\\n\nMaintenance \\& reuse & 15 & ``self-adapting CI/CD infrastructure based on demand''; ``Preventive maintenance''; ``Carriers are eager to get rid of human factors to improve operation and maintenance capabilities and network quality. Therefore the ICT field pays much attention to self-adaption systems.''; ``Software provisioning and automatic updates'' \\\\\n\nPatterns \\& libraries & 6 & ``Developing a comprehensive library of algorithms on top of the industrial monitoring systems which can be applied to analysis portion of the chain in order to drive correct self-adaptation actions would benefit the self-adaptation adoption.''; ``Cross-cloud self-adaptation''; ``patterns to provide solutions to common problems'' \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textbf{Human involvement} & \\textbf{7} &  \\\\\n\nPersonalization & 4 & `` it would be interesting to adapt the player experience itself based on the player, mostly to better challenge them''; ``Healtcare decision making systems witch are changing outcomes and advices basd on patient status.'' \\\\\n\nHuman-machine interaction & 3 & ``I consider that the biggest opportunities are found within the Human Machine Interaction or Building Machine Interaction. There will be a future in which talking to a device that can modify the environment (e.g. a robot but not a phone) will be as natural as talking to a person, or seeing a machine interacting with another machine (e.g. robot taking the elevator)'' \\\\\n\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table*}",
        "2211.03116_116c5340923091ff8b39a7d63d3580a5": "We grouped the opportunities in four categories:",
        "2211.03116_2a25cf7f67f38466b2189c9fe5f23099": "Seventy-two of the reported opportunities (i.e., 49",
        "2211.03116_df0a6e729130a913ba7c6c4d79f9e223": "of all) are related to system activity",
        "2211.03116_6355ec8455528974634acfb0cb1f0348": "The opportunities in this category relate to the",
        "2211.03116_ff435ad6ff6202a715ce2dcd1845bd80": "behaviour of self-adaptive systems (37 occurrences),",
        "2211.03116_e6c708fe9f52228656889db8eb47fca2": "(26 occurrences), and",
        "2211.03116_2a1dd4be2aaa59667a2f23e63529249f": "(nine occurrences)",
        "2211.03116_a060deab53b429a4c5268d4041f1eedf": "Forty-seven opportunities (32",
        "2211.03116_59fac2508c56d690d539737d73f71668": ") are related to system properties",
        "2211.03116_4fb366b4fa13d883b53e6f2795e7249b": "In this category, the opportunities are related to",
        "2211.03116_3675728585a8e678c361f154d799b66e": "(26 occurrences),",
        "2211.03116_852df645b68bf91e21ab051aad538aac": "(10 occurrences), and",
        "2211.03116_a29ff5252ae7b011c9ad2f875976d515": "(eight occurrences)",
        "2211.03116_42b7b5fe80c12a29ec5b10fcc4841219": "Twenty-one of the reported opportunities (14.3",
        "2211.03116_884b50706657b3b08d66e3bb70907687": ") relate to engineering activities, in particular",
        "2211.03116_1689e12bd897e87fd2a31d49c76f9b71": "(15 occurrences), and",
        "2211.03116_69c42d77c09f8d8e3bfa670a0a99177d": "(six occurrences)",
        "2211.03116_43d1f5140de9f507fa270401da7cea4d": "Finally, seven opportunities (4.8",
        "2211.03116_52f9d2aa428fb593428ea092617d1dda": ") relate to human involvement, in particular",
        "2211.03116_afee9f30a686793f562c4a4b1360bfd1": "(four occurrences) and",
        "2211.03116_3879c1ec04e9367b14fc99bc9c08d9b7": "(three occurrences).",
        "2211.03116_57b805c86c61333816cd62be7925777c": "\\begin{table}[h!]\n\\centering\n\\caption{Application opportunities for self-adaptation that are currently not exploited (Q4.9) -- labels based on sector}\n\\label{tab:q4-9a}\n\\begin{tabular}{ll}\n\\hline\\noalign{\\smallskip}\nSector & Count \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nCross-sector & 36 (55\\%)\\\\\nCloud \\& Microservices & 11 (17\\%)\\\\\nTelco & 7 (11\\%)\\\\\nCPS & 6 (9\\%)\\\\\nTransportation & 3 (5\\%)\\\\\nOther & 3 (5\\%)\\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_e0af22efe9220f55aec82f3e9c67356a": "A majority of participants face difficulties when engineering or maintaining self-adaptive systems, mainly with reliable/optimal design, design complexity, and tuning/debugging.",
        "2211.03116_5aab4045259a44ff0cf57d1211ce9bc9": "About half of the participants encounter risks when using self-adaptation",
        "2211.03116_3f2037bdb744d1a6c119623d851388be": "The main risks relate to incorrect functionality and difficulty to manage environment uncertainty, as well as degraded performance and increased cost.",
        "2211.03116_83ff7bfe5eee68862d4392b7f3716930": "About half of the practitioners report that they would appreciate support from researchers to deal with problems they face, in particular problems related to the engineering of self-adaptive systems, guarantees, and management of data.",
        "2211.03116_035f622101a8cd2f880ff1f307b1e60c": "About half of the participants see future opportunities for applying self-adaptation, in particular in relation to autonomous operation, data management and machine learning.",
        "2211.03116_880e4be2c2478164fa55ef152bb56522": "Confidence",
        "2211.03116_832177bbd6e953e5b9480167dae688a5": "shows the answers about how confident participants were in general about the answers they gave when answering the survey questions",
        "2211.03116_3ba2774ec258d5255d17f1e38ad00c80": "The results show that almost all participants have confidence in the answers they provided to the survey questions",
        "2211.03116_a376aca69745a17bafb49639e2a999b1": "The numbers for all participants and those that have worked with self-adaptation are similar.",
        "2211.03116_d89241c67733be01f5a8f125ca0d90c0": "\\begin{table}[hbt]\n\\centering\n\\caption{Confidence in answers.}\n\\label{tab:q5-1}\n\\begin{tabular}{llc}\n\\hline\\noalign{\\smallskip}\nLevel of confidence & All (of 184) & With self-adaptation (of 100) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nVery confident & 24 (13.0\\%) & 16 \\\\\nConfident & 61 (33.2\\%) & 32 \\\\\nSufficiently confident & 52 (28.3\\%) & 28 \\\\\nNeutral & 23 (12.5\\%) & 9 \\\\\nSomewhat unconfident & 12 (6.5\\%) & 5\\\\\nNot confident & 3 (1.6\\%) & 2 \\\\\nNot confident at all & 0 (0.0\\%) & 0 \\\\\nNo answer & 9 (4.9\\%) & 8 \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_178b09b1119d7a2807ecf3b0496daa9c": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=0.85\\columnwidth]{Q5.1-fig.pdf}\n\\vspace{-10pt}%%%\n\\caption{Confidence in answers.}\n\\vspace{-10pt}%%%\n\\label{fig:q5-1}\n\\end{figure}",
        "2211.03116_eed9474fd944d045ff056d20004acaa3": "Discussion",
        "2211.03116_d855ef79fc6d7f1320ec10266b4b9e62": "We start the discussion with highlighting a number of observations that we derived from the data analysis",
        "2211.03116_1b3ef5ae7afbd47e24150aa310c97cfb": "Then we perform a number of additional analysis based on cross analyses of selected data of the answers of different questions",
        "2211.03116_791a765b62174313dc841e01e04a0cbb": "With this cross analyses we aim to gain further insights into three topics of interest: benefits of applying self-adaptation in practice, difficulties and risks with engineering self-adaptation in practice, and research support to address problems in practice.",
        "2211.03116_263df4303fc8e2f27499caefad0c6f25": "Observations",
        "2211.03116_b36896c28321a8c9e2e6a8e415422072": "The problems addressed by industry are in general similar to those studied by academics",
        "2211.03116_40eccbaa96e55592dc2666288f0cd660": "Yet, one particular difference is the lack of emphasis of practitioners on the use of self-adaptation to mitigate uncertainties, which has been a key focus in research",
        "2211.03116_66ec4ba08233396b08dfdf93766a2911": "\\cite{garlan2010seu,Relax2010Whittle,esfahani2013usa,10.1145-3487921}",
        "2211.03116_96a8068815b02bc6ca8f4b6d4fde97b5": "A possible explanation is that practitioners avoid the term uncertainty that may be perceived as",
        "2211.03116_e971f11eeda01ccb7460b9bb7d098e7b": "doubt,",
        "2211.03116_b582fd8999e61320ffe2aac1d6ceaafc": "not clearly defined,",
        "2211.03116_9c542dacd13e5ed703a330d72d5f72e1": "not under control.",
        "2211.03116_c241c2369b007d66e6a4ee7b3f35b66f": "Instead, they refer to uncertainty indirectly by using a different vocabulary, such as",
        "2211.03116_4134887c7ed5af1f28b56dd90989b6d6": "conditions are not always obvious",
        "2211.03116_f9f808ce3749093a071160dd8dd81036": "available metrics are not always fully transparent.",
        "2211.03116_b12f0c8fff68a14eec66e370ce1f2e94": "While practitioners apply self-adaptation to deal with a variety of problems, changes in business goals are less frequently solved by using self-adaptation",
        "2211.03116_5763d2e8cce2d691be35aed647fe814b": "One possible explanation may be that business goals are usually about higher-level requirements, while the focus of self-adaptation is often targeting",
        "2211.03116_9b17762a21c303df1ffcefe0b6c05979": "lower level",
        "2211.03116_bf021d296bf1ac0f488f0b7513a4762c": "technical problems",
        "2211.03116_fed42728cf85a27260412d0aeda51037": "In addition, there is also the challenge of the mapping between business goal and technical/system metrics, which touches the line or work on dynamic software product lines",
        "2211.03116_85d29203cb4bf10523515c5ab5c790f2": "\\cite{4488260}",
        "2211.03116_cad640a07b3953bb0aefa6d2073ea420": "Yet, another explanation may be that self-adaptation has not yet been fully utilised in industry to deal with bigger system changes",
        "2211.03116_779c268361b252e625dc12c2896cfb59": "We hypothesise that the latter is the case, but further study is needed to obtain deeper insight",
        "2211.03116_9df4e63d2413b92fa2fe71ae8ca96324": "The four classic management tasks of self-adaptation studied by researchers (self-healing, self-optimising, self-protecting, and self-configuring) are also relevant to practitioners",
        "2211.03116_ace4f1d7a83a7ab9a05fe20a5d82ea23": "Yet, differently from academics, practitioners also emphasise the importance of improving user satisfaction, reducing costs, and mitigating risks",
        "2211.03116_eb2ef3d87f55696411af681b16d3de6c": "Practitioners make extensive use of tools and infrastructures to realise the different functions of self-adaptation",
        "2211.03116_967f37a5c2ac5883c9f509b7862c7f61": "This points to the need for more emphasis on tools and supporting infrastructure in research",
        "2211.03116_bcbd2f1eb39f2dd608500e2849b3f557": "Related to that is the need for reusing solutions, for instance in the form of references architectures and patterns",
        "2211.03116_894b82310824c5f9cc533c4a31bf6035": "While some research efforts have been taken in these directions, these issues deserve more attention",
        "2211.03116_b9e1857c77c8f0787987adc8684a7a19": "An interesting step in this direction is the development of industry relevant artifacts as outlined in",
        "2211.03116_d46a240383ad68cd9e65724bb82ef96b": "\\cite{3561846.3561852}",
        "2211.03116_b75f17dc9f647874f1e82d83594b29dd": "Self-adaption in software-intensive systems is often not completely automated",
        "2211.03116_637d327dd9ab25e98fc3aa4c29715328": "Humans remain involved in adaptation, either to provide parts of functions or just to supervise the system",
        "2211.03116_88a00d554c069b27d0cc88dded19337c": "On the one hand, for some companies this is the first step towards further automation; on the other hand, practitioners often express the need for involving humans to ensure trust by overseeing the system and take action when something unexpected happens",
        "2211.03116_d0f410f52483c19d58a9c5783b16d89a": "As such, we expect the role of humans in self-adaptation to remain important also for future industry relevant research in self-adaptation",
        "2211.03116_2c8694708e994f0a5232ecc4e01c1c78": "It is remarkable that more than 50",
        "2211.03116_03f1bcbc5d3e7175b7faf9fac404c9c1": "of the participants report that they face at least sometimes risks with applying self-adaptation",
        "2211.03116_4199c95a81d55d2a9d8be2a0ad488668": "At the same time, about half of the practitioners express that they would appreciate support from researchers to deal with the problems they face",
        "2211.03116_d1cba5824d29539fe625d2d4263a6465": "This suggests that the engineering of efficient and trustworthy self-adaptive systems is a challenge in practice and that practitioners believe that support from research could benefit them to deal with these challenges",
        "2211.03116_11717f610839567caa4ef6221ee227c3": "This opens opportunities for joint efforts between industry and academics.",
        "2211.03116_dd67f3f8e8803bde43b75ff6751d4421": "Benefits of Applying Self-Adaptation in Practice",
        "2211.03116_6e5e1da5075e90af16543bd9741288a8": "When we crosscheck adaptation problems (Q1.1) versus kind of systems (Q0.2), we observe that most adaptation problems are applied to all kind of systems, while each adaptation problem is applied in one or two champion kind of systems",
        "2211.03116_46b6feebb0ea4fc97f3e255265e02c10": "The three most frequently addressed adaptation problems are applied by all kind of systems",
        "2211.03116_52de6d682ef8d8f2bf7a347452f94d65": "Specifically, the problem",
        "2211.03116_ee978ca51f57696cc9467db3503e4f19": "to optimise system performance",
        "2211.03116_5a91049962cc1dddc29211d9411eadaf": "is applied to all kinds of systems except transportation where",
        "2211.03116_78d8f18ff24725fe77c002c23dfff1a7": "to detect and resolve errors",
        "2211.03116_7c466ddfa124cd7334278aeb3f07dec4": "is the main adaptation problem (six occurrences), finances where",
        "2211.03116_4155924864f1ce33679321bb8370e1dc": "to deal with changes in the environment",
        "2211.03116_295ee8e9017f4a625cf8a9dd3c77d225": "is the main problem (five occurrences), and manufacturing where",
        "2211.03116_0a72497f39a2d4e34c31983797559888": "to automate tasks",
        "2211.03116_d75141d89b823f351c9426c0b95b0831": "is the main problem (seven occurrences)",
        "2211.03116_4c19b0a6347dcafe26488a9670c75ae9": "summarises the top occurrences, i.e., types of adaptation problems solved (top occurrences) versus the kind of system for which that adaptation problem is applied (top kind of systems).",
        "2211.03116_b6ea3f88f810c76434c4b81a7dc128a0": "\\begin{table}[hbt]\n\\centering\n\\caption{Cross analysis adaptation problem solved (Q1.1) versus kind of systems (Q0.2)}\n\\label{tab:q1.1-q0.2}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\n\\textbf{Adaptation problem (top occurrences/total)} & \\textbf{Top kind of system} \\\\\n\\noalign{\\smallskip}\\hline \\noalign{\\smallskip\\smallskip}\nTo optimise system performance (12/78) & Embedded/cyber-physical/IoT \\\\\nTo automate tasks (10/61) & Cloud \\\\\nTo deal with changes in the environment (9/60) & Embedded/cyber-physical/IoT \\\\\nTo detect and resolve errors (8/46) & Web/mobile\\\\\nTo configure/reconfigure a system (8/51) & Web/mobile and Cloud\\\\\nTo detect and protect a system against threats (6/46) & Web/mobile\\\\ \nTo deal with changes in business goals (5/15) & ICT communication and networks \\\\ \n%Others (3) & ICT communication and networks and manufacturing \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_183dd3e949590d8b96ccebabab54b296": "We now look at the problems for which self-adaptation is applied (Q1.1) versus the benefits of using self-adaptation (Q1.2)",
        "2211.03116_d964813d1fefd12cb8f436fe892d6065": "shows the contingency matrix",
        "2211.03116_27274e623d00c9ed0474f543c0611a99": "The results show that",
        "2211.03116_e8c8bfdfa5e59eeacb685f67f3b7b7f7": "improving user satisfaction",
        "2211.03116_cde4b9b5487eeaa384ebb319c669408d": "reducing costs",
        "2211.03116_34143229f5842e0b9a1715e8b666e974": "are by far the most frequently perceived benefits across all types of problems solved with self-adaptation",
        "2211.03116_c32c5457bad2eea8791587441a1d40ad": "In particular, these two benefits are mentioned approximately 70",
        "2211.03116_cfd8f1cd035df16732d5332e6adb90af": "(+/- 4",
        "2211.03116_739f08ec9ba85cb91df1fc1b41a49135": ") on average across all problems, while",
        "2211.03116_e2ed315f8a0c04771527fd8d3066ce12": "mitigating risks",
        "2211.03116_2605e8db35ee93d19ac05af2874da18f": "penning up new application opportunities",
        "2211.03116_7299bf0c06909e4fbf7da626c0ee5e37": "are respectively mentioned 53",
        "2211.03116_c768a9deb6037bcf13730ef3b7b80352": "(+/- 11",
        "2211.03116_cff306d8b8630bbca4b366f6366fa021": ") and 28",
        "2211.03116_46114024892d77206aaaf4aec8e05fd0": "(+/- 5",
        "2211.03116_1fa6e43fd60ff5baecb531eb71a71786": ") on average across all problems solved with self-adaptation.",
        "2211.03116_2df9d59599f41c24512df3488e5f46d5": "\\begin{table}[hbt]\n\\centering\n\\caption{Contingency matrix adaptation problem (Q1.1) versus benefits (Q1.2)}\n\\label{tab:contingency_q1-1_q1-2}\n\\begin{tabular}{lcccc}\n\\hline\\noalign{\\smallskip}\nProblem/Benefit & Improve user satisfaction & Reduce costs & Mitigate risks & New opportunities\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nAutomate tasks         & 42 & 45 & 34 & 15 \\\\\nEnvironment changes    & 43 & 44 & 28 & 17 \\\\\nOptimise performance   & 12 & 10 &  6 &  5 \\\\ \nChanges business goals & 55 & 55 & 35 & 17 \\\\ \nHandle errors          & 34 & 32 & 27 & 12 \\\\ \nProtect system         & 22 & 23 & 24 & 11 \\\\ \n(Re-)configure system  & 35 & 36 & 26 & 16 \\\\ \n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_f1e687d97f598b73b847211d0b45eb87": "Finally, we look at the potential benefits of reuse using the data of the kind of software systems built by organisations (Q0.2) versus reuse when applying self-adaptation (Q3.5-3.7)",
        "2211.03116_4b40f033a7a6810fb89bb635e3111eed": "The top domains where solutions are frequently reused are data management with 11 occurrences and embedded/cyber-physical/IoT systems with seven occurrences",
        "2211.03116_a6d79265583c1cd23bdd6e4663075dc9": "Manufacturing is the top domain where practitioners very frequently reuse solutions with seven occurrences",
        "2211.03116_47af2b28511fe66aa8f8601ea164500b": "The most frequent type of reused artifact is module with 11 occurrences, with embedded/cyber-physical/IoT as the top domain with four occurrences used for monitoring/analytics/control",
        "2211.03116_3dc44dfb55e3de3fe3ce84a6e60170e0": "Overall, there is no specific artifact that is more reused than other, and no domain that clearly reused more or less artifacts",
        "2211.03116_52b785899e70d365737b67c7f664a8f7": "Only five participants mention the reuse of patterns when engineering solutions for self-adaptation.",
        "2211.03116_31c6d20f956017569ea3117332d50253": "Optimising performance and dealing with changes in the environment are the main reported problems solved using self-adaptation in the domain of embedded/cyber-physical/IoT",
        "2211.03116_ece6f89564ae58ece339e1b96ade3891": "Not surprisingly, self-adaptation in the cloud is primarily used to automate tasks and reconfigure the system.",
        "2211.03116_17fb242aca55990360d07991c8884584": "Reuse of self-adaptation solutions is mostly applied in the domains of manufacturing, data management, and embedded/cyber-physical/IoT systems",
        "2211.03116_e70bc8af966f370b6989824abe3732c7": "The main artifact of reuse is system module.",
        "2211.03116_a86e2714c03cd04c6cd88651fc769d41": "Difficulties and Risks of Applying Self-Adaptation in Practice",
        "2211.03116_8bae344e0a39c7a6d9867a5c5be791aa": "Large and small/medium organisations (Q0.3) are equally concerned about difficulties with design (Q4.1-4.2)",
        "2211.03116_0c5b1e1cbdb8e4179b9800387597d20a": "Both types of companies are also concerned about tool support, but in different ways: difficulties with debugging is more important for large organisations, while limitations of tools and methods more important for small/medium organisations",
        "2211.03116_f970f415d5baef07348a38bb8727a8bf": "When comparing large companies (>100) and small/medium companies (<100) (Q0.3), we observe no major difference in the reported frequency of encountered risks (Q4.3-4.4)",
        "2211.03116_d94129ffa31897547884356b6b5ca4d6": "The only relevant difference is that larger companies mention faults twice as much as small/medium ones; 14 occurrences for 30 large companies versus six for 70 small/medium companies",
        "2211.03116_4d0dd197d752e526907b4aac962c7fd7": "To crosscheck size of companies (Q0.3) versus mechanisms used to realise self-adaptation (Q3.1-3.3), we performed a dedicated coding distinguishing mechanisms that rely on tools/infrastructure versus custom mechanisms.",
        "2211.03116_f1e2ef3235aebb282f8db3f6d973e78e": "The data summary shown in Table",
        "2211.03116_8e047c9343080de0165b6d6c3a809884": "indicates that smaller/medium companies (<100) rely on tools and infrastructure to provide support for self-adaptation mechanisms, while in large companies (>100) custom solutions are more prevalent",
        "2211.03116_26c819e86d33ff755e1f9e71d47a8766": "Zooming into the data of mechanisms for the different stages of self-adaptation shows that almost all companies that apply self-adaptation have mechanisms in place for monitoring, but not necessarily for analysis and change, regardless of company size, but the differences are small",
        "2211.03116_d737f87f4c4fc8161b758675d72c4cc8": "This suggests a progression from monitoring to analysis to change.",
        "2211.03116_743766289ada7d6e50a8546852036eb7": "\\begin{table}[hbt]\n\\centering\n\\caption{Contingency matrix size of companies (Q0.3) versus self-adaptation mechanisms (Q3.1-3.3)}\n\\label{tab:contingency_q0-3_q3-1_q3-3}\n\\begin{tabular}{lcc}\n\\hline\\noalign{\\smallskip}\nSize company & Relying on tools/infrastructure & Custom mechanisms\\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n1-10     & 5 (56\\%) & 4 (44\\%) \\\\\n11-20    & 3 (27\\%) & 8 (73\\%) \\\\\n21-50    & 5 (36\\%) & 9 (64\\%) \\\\ \n51-100   & 4 (40\\%) & 6 (60\\%) \\\\ \n$> 100$  & 7 (13\\%) & 47 (87\\%) \\\\ \n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_0bb4330ff9c39d16d87f75181987865f": "Cross analysis of subject of adaptation (Q2.1) versus difficulties and risks (Q4.1-4.2) shows that the reported difficulties and risks are similarly distributed across subjects of adaptation",
        "2211.03116_5080b07d95bbe2aa2534879dbc5a321d": "Most frequently reported difficulties are design issues and people and process issues at system level (both 11 instances)",
        "2211.03116_ff9075ae23ad4c90a3a9a0bd88935f77": "Most frequently reported risks are difficulties development/operation and impact on business also at system level (six and five occurrences, respectively).",
        "2211.03116_dc56b1d3a7dfcb7ff94f49b1f5730d26": "The main difficulties concern the design of self-adaptation and people and processes at system level, while the main risks relate to development/operation and impact on business, also at system level",
        "2211.03116_2d175bcb9384bb26ebb5f0063bae5124": "Large companies face higher risks related to faults when applying self-adaptation",
        "2211.03116_3b21246f68e3d435785fbf7953af2cbf": "Difficulties with design is important for all, yet, debugging is more important for large companies, while small/medium companies are more concerned about limitations of tools and methods.",
        "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a": "Research Support to Address Problems in Practice",
        "2211.03116_7ee0878121b281413bee5c0f1b5d8be3": "shows the main results of the cross analysis of the data of the concrete self-adaptive systems built by the participants (Q2.1) and the problems for which practitioners would appreciate, sometimes to always, support from researchers (Q4.6).",
        "2211.03116_d36235ff8ba495add7b7853ab8c6ec8b": "\\begin{table}[hbt]\n\\centering\n\\caption{Cross analysis concrete self-adaptive systems (Q2.1) built vs support from researchers (Q4.6)}\n\\label{tab:q2.1-q4.6}\n\\begin{tabular}{lc}\n\\hline\\noalign{\\smallskip}\n\\textbf{Characteristic system} & \\textbf{Support from researchers} \\\\\n\\noalign{\\smallskip}\\hline \\noalign{\\smallskip\\smallskip}\n\\textit{Subject of adaptation} &  \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nSystem & 12 (26.7\\%) \\\\\nModule & 9 (20.0\\%) \\\\\nApplication layer & 9 (17.8\\%) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textit{Type of adaptation} & \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nAuto-tuning & 16 (36.4\\%) \\\\\nAuto-scaling & 13 (29.5\\%) \\\\\nMonitor/analysis & 9 (20.5\\%) \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\n\\textit{Trigger of adaptation} &  \\\\\n\\noalign{\\smallskip}\\hline\\noalign{\\smallskip}\nSystem properties & 11 (31.4\\%) \\\\\nEnvironment properties & 8 (22.9\\%) \\\\\nSystem load & 6 (17.1\\%) \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_6a2ca61bc5cd80d87f87e4a18ec092f1": "\\begin{table}[hbt]\n\\centering\n\\caption{Cross analysis concrete self-adaptive systems (Q2.1) built vs support from researchers (Q4.6)}\n\\label{tab:q2.1-q4.6}\n\\begin{tabular}{lc|lc|lc}\n\\hline\\noalign{\\smallskip}\n\\textit{Subject adaptation} &  Support & \\textit{Type adaptation} & Support & \\textit{Trigger adaptation} & Support \\\\\n\\hline\\noalign{\\smallskip}\nSystem & 12 (26.7\\%) & Auto-tuning & 16 (36.4\\%) & System properties & 11 (31.4\\%) \\\\\nModule & 9 (20.0\\%) & Auto-scaling & 13 (29.5\\%) & Environment properties & 8 (22.9\\%) \\\\\nApplication layer & 9 (17.8\\%) & Monitor/analysis & 9 (20.5\\%) & System load & 6 (17.1\\%) \\\\\n\\noalign{\\smallskip}\\hline\n\\end{tabular}\n\\end{table}",
        "2211.03116_1323c140f48ff54c67488392f47c988e": "The analysis shows that system, module and application layer make a total of 64.4",
        "2211.03116_88a81bbc8e99be7f9653bd3d9537614d": "of the problems for which practitioners would appreciate support from researchers",
        "2211.03116_183dda6939faf988146734c3718a5ded": "In terms of type of adaptation, 84.6",
        "2211.03116_a11fd0b302024f0449a7442e7bc6d157": "of the problems for which practitioners would appreciate support from researchers concern auto-tuning, auto-scaling, and monitoring and analysis",
        "2211.03116_3c79c459ac811312ff4ec5556c477efd": "Finally, 74.1",
        "2211.03116_cc21841375aee4f535f4048ee1297cc5": "of the problems for which support would be appreciated concern adaptation triggered by system properties, environment properties, and system load",
        "2211.03116_fc1703a4033ae012088bef13515abfc4": "When crosschecking the kind of software systems built by the practitioners (Q0.2) versus the problems for which they would appreciate at least sometimes support from researchers (Q4.6), we found that except for one kind of system, support from researchers would be appreciated across all kinds of systems built by the practitioners",
        "2211.03116_366c90479bfb21d59f161006b747187e": "For e-commerce none of the seven participants expressed interest in regular support from researchers (four of them would very rarely appreciate support)",
        "2211.03116_b23a9576b6600a67073f7ba10f91d84f": "On the other hand, eight out of 11 (72.2",
        "2211.03116_1152260274bc8f29d075304e50be4974": ") participants that work in the domain of ICT communication and networks would regularly appreciate support to address their problems",
        "2211.03116_736a32db7edf3df082f12e1610f59820": "The numbers for the other domains range from 22.9",
        "2211.03116_93165b694598df6a917bb2c97ae89e06": "to 56.3",
        "2211.03116_887e9af4dfe2a213547a2ba33e5bf698": "A majority of practitioners would appreciate support from researchers",
        "2211.03116_c6eb65852c6f4fca471ff6740a4f4137": "These problems concern self-adaptation applied at system level, a module of the system, or the application layer",
        "2211.03116_b8d5b4ceaf0c433302b804ae42141835": "The main problems relate to auto-tuning, auto-scaling, and monitoring and analysis",
        "2211.03116_c0d4da2e224aa25bd4074e7c3d8898c4": "Triggers of adaptation concern dealing with system and environment properties, and system load",
        "2211.03116_1a04b165149cd523be0116206cc61d74": "The problems crosscut different kinds of systems, but particularly ICT communication and networks.",
        "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2": "Threats to Validity",
        "2211.03116_c8729dd35150d4d133e0940c3a8d775f": "We discuss validity threats of our study using the guidelines described in",
        "2211.03116_c8966b6cc1997ecc4c76ae772ee0942d": "\\cite{Wohlin2012}",
        "2211.03116_0cf657b779c169b3e7c6b3f98a026a52": "We look at construct validity that refers to the extent to which we obtained the right measure and whether we defined the right scope for the study goal, external validity that refers to the extent to which the findings can be generalized, and reliability that refers to the extent to which we can ensure that our results are the same if our study is done again.",
        "2211.03116_979e87c66e63427730c9d7219c3ac238": "Construct Validity",
        "2211.03116_7e7f1a46419992d696c6a36d7056052b": "The survey starts from the assumption that practitioners are sufficiently familiar with the basic concepts of self-adaptation",
        "2211.03116_6a3874e91f37d540472ce5c7408110d3": "We used the term self-adaptation to formulate questions about systems (or parts) that are equipped with a feedback loop",
        "2211.03116_3a71cd479e19cced2bf1367737868686": "Hence, most questions required basic knowledge of the concept of self-adaptation",
        "2211.03116_162052f1932ec0224c38b1dcdf077754": "Analysis of the results makes it clear that practitioners have a basic understanding these concepts",
        "2211.03116_22ee44a75b4269579c6add2403a5d509": "Yet, we used several measures to reduce possible misinterpretations",
        "2211.03116_73ef82d82fd5b1c2c3720596ffe4f3df": "We introduced the notion of self-adaptation at the start of the survey using a standard model with a feedback loop that we illustrated with typical examples",
        "2211.03116_4aa7a5588f5801d7b13f753abeaaa70a": "We elicited feedback for several participants on this description and the questions during a pilot",
        "2211.03116_678a206688b057e8038b4e185b1764cc": "This feedback enabled us to enhance the description and clarify some of the questions",
        "2211.03116_461bbedf87110a6e79816847345db2be": "In addition, we selected participants with sufficient experience from a variety of domains",
        "2211.03116_8d514d6cb9e532eccceb75076dce1570": "The confidence in the answers (Q5.1) confirms that the participants believed that their answers were trustworthy.",
        "2211.03116_7068e31cc210f87158158ef0b6b3895f": "External Validity",
        "2211.03116_95fb38efe10bc02435fd03f1051079e1": "A potential threat to validity may be the generalisation of the study results",
        "2211.03116_d6418d4308bf4efa732a469ff902ddac": "Core to this threat is the selection of the sample of the target population",
        "2211.03116_297438c882c03c98810f7ff7adfc6f5f": "If this population may not have been representative, the study results may be imprecise and hence not generalisable",
        "2211.03116_0dd016e48830a45fdb3d153fd640be82": "Since we used a non-probabilistic sampling method, there is a potential risk that the sample used to conduct the survey is biased and not representative of the target population",
        "2211.03116_eada4916be79fd73158cd11ed2f50451": "To mitigate the validity threat we mainly reached out to practitioners from our networks with industry",
        "2211.03116_f6d1e03a44c89a25ba0eae5f6a67ffac": "To ensure that participants have the required experience, we included questions asking about personal experience with engineering self-adaptive systems in practice",
        "2211.03116_f4d72e5b796aa509b4707176d944d3fd": "The results of the demographics of our sample show that the participants were active practitioners with sufficient expertise in various roles across companies of different sizes",
        "2211.03116_9a03b9b24925a45560915d8f8f58aeb5": "In addition, we worked in total with eight teams from different areas that contacted practitioners from all over the world",
        "2211.03116_d70be10b7f197b0abcebc47c73b96fad": "This ensured a well-balanced population on a global scale",
        "2211.03116_13a317fae9d7feabf214f71cceb95ffa": "Because several of the researchers involved in this study are active in the field of engineering self-adaptive systems, the practitioners invited from our networks may have been biased and inclined to apply self-adaptation more often",
        "2211.03116_90d938a08cf603b720687826537bec96": "To anticipate this threat, we did not particularly focus on practitioners that we have worked within projects, but rather invited practitioners in various software engineering roles that are active across a wide range of domains.",
        "2211.03116_820b8f74ad843d1574106ec4cadfc07e": "Reliability",
        "2211.03116_f149642b8fa0eadd277d0b3e8e6a8ff9": "Data analysis, in particular qualitative analysis (coding of answers with free text), are creative tasks that are to some extent subjective",
        "2211.03116_19b26238ba08dae510a199cd2227d137": "Performing these tasks may be influenced by the experience (and even opinions) of the coders",
        "2211.03116_f68ca1fb43a96967929d4f284de03005": "To mitigate a potential interpretation bias, we followed a thorough coding scheme",
        "2211.03116_77712e00cbb382f95cd733f684debf1c": "The coding tasks were distributed among teams of two authors (one team of three)",
        "2211.03116_f1e75cfd151c254bf4d656a3f02f4ca2": "The authors of each team performed coding of the data independently and discussed where needed until an agreement was reached",
        "2211.03116_2e299e347e745ac713e1df601a3700dd": "All coding tasks were then distributed again among two authors",
        "2211.03116_8795f7555faba267adcda73ca737a081": "These authors repeated the coding independently from the initial coding",
        "2211.03116_3fe670948e1e0122681f540b05222892": "The results were then compared with the initial coding by these two authors",
        "2211.03116_28d80570cd392d418317ffc4905dcc7a": "Any discrepancies were discussed among the two authors until consensus was reached",
        "2211.03116_cdc13eb864bd706b2d10b43debba3d54": "The coding was finally crosschecked with the authors that did the original coding to reach consensus",
        "2211.03116_c86d6ba4373dde0e006949ff0855509b": "Finally, all material of the survey, including the raw data and the coding are publicly available.",
        "2211.03116_d03ae3c704b5cc2a576d22faaeb10171": "In this category, we look at the following cross analyses:",
        "2211.03116_2867483a7ef49e4194d4c095550d0186": "Kind of software systems (Q0.2) versus problems for which self-adaptation is applied (Q1.1)",
        "2211.03116_f4fd42f40fb9d36f3f783ad1020343df": "Problems for which self-adaptation is applied (Q1.1) versus benefits of self-adaptation (Q1.2)",
        "2211.03116_4aa0465acc5dbeb1f52db38f8518952f": "Multiplicity of adaptation goals (Q1.1 and Q2.1)",
        "2211.03116_cc2dd620d89b22ab42d85eb972343e92": "Kind of software systems (Q0.2) versus versus mechanisms used to realise self-adaptation (Q3.1-3.3)",
        "2211.03116_c1ae9fe819eb2679a53585aabb16dbbd": "Size of companies (Q0.3) versus mechanisms used to realise self-adaptation (Q3.1-3.3)",
        "2211.03116_f9440e136301836ee84a2dd86ef84f79": "Kind of software systems build by organisations (Q0.2) versus reuse (Q3.5-3.7)",
        "2211.03116_b219d3257999ebcf07d6ee6b06b27a6d": "Difficulties, Risks, and Trust",
        "2211.03116_2667387bd0377d26bd69804d16a9d572": "Size of companies (Q0.3) versus difficulties (Q4.1-4.2) and risks (Q4.3-4.4)",
        "2211.03116_a2ee515f7099f79dcb6574c7b6c52f40": "Subject of adaptation (Q2.1) versus difficulties (Q4.1-4.2) and risks (Q4.3-4.4)",
        "2211.03116_edcc40154d13f608fa62751615167a29": "Mechanisms to realise self-adaptation (Q3.1-3.3) versus difficulties (Q4.1-4.2) and risks (Q4.3-4.4)",
        "2211.03116_0feb3fc618a88e86e9bbb177b97fb119": "Difficulties (Q4.1-4.2) versus risks (Q4.3-4.4)",
        "2211.03116_d3b053d43d5cd79d3ce6be4acf6d70fd": "Difficulties (Q4.1-4.2) versus trust (Q3.7-3.8)",
        "2211.03116_cbdf5962b610be26ed566a4efcc58232": "Risks (Q4.3-4) versus trust (Q3.7-3.8)",
        "2211.03116_d06f70149d5b0f3e6b130a050a7bd733": "Research Support",
        "2211.03116_36011a7c22b08b81ee4f4e29c9564f43": "Kind of software systems (Q0.2) versus problems support researchers (Q4.6)",
        "2211.03116_44deb7463e5caa2d0135de72ed513f8b": "Types of adaptation (Q2.1) versus problems support researchers (Q4.6)",
        "2211.03116_7ae287f5b1c1113fc78cf45e5d47b3f2": "ALLOCATES Ilias Gerostathopoulos, Patricia Lago: E1, E2, D1, D2 Nadeem Abbas, Jesper Andersson: E3, E4, D3, D4 Stefan Biffl, Angelika Musil, Juergen Musil: E5, E6, Tomas Bures, Premek Brada: E3, E4, D5, D6 Matthias Galster, Patros Panos: E1, E2, D5, D6 Amleto Di Salle, Patrizio Pelliccione: D1, D2, R1, R2 Grace Lewis, Marin Litoiu: E5, E6, D3, D4",
        "2211.03116_b651e8a99c4375feb982b7c2cad376e9": "Conclusions",
        "2211.03116_b18900a4aa70612ac2a597d9599f2a67": "In this paper, we studied the application of self-adaptation in industry",
        "2211.03116_86f470d7543443d6d3fe74966ae05d34": "To that end, we conducted a questionnaire-based survey with practitioners from all over the world",
        "2211.03116_7480abb0fca5c5368e1ac37cf4bf38e8": "We received valid responses from 184 participants, 100 of them with experience in engineering self-adaptive systems",
        "2211.03116_a0085d3592957f2dfdc12c5bcbc641a5": "By analysing the data, we contributed an empirically grounded overview of state-of-the-practice in the application of self-adaptation",
        "2211.03116_ee38a75319bd82c59ac9ae4f21ce26eb": "A selection of key observations includes: i) self-adaptation is extensively applied in industry across a wide variety of domains, ii) the dominating types of adaptations applied in industry are auto-scaling, auto-tuning, and monitoring/analysis, iii) practitioners rely extensively on tools and infrastructure to realise the different functions of self-adaptation, iv) human supervision is important to ensure trust in industrial self-adaptive systems, v) about half of the participants encounter risks with applying self-adaptation, vi) on the other hand, about half of the practitioners would appreciate support from researchers to deal with problems they face",
        "2211.03116_ec47b19f43b66e30c76e8023712580f0": "summarises the main findings.",
        "2211.03116_ac702401c0dba1cc01fd8772a5be6c8e": "\\begin{figure}[h]\n\\centering\n\\includegraphics[width=1.0\\columnwidth]{figures/summary-sas-in-industry.pdf}\n\\caption{Summary of the main findings of the survey}\n\\label{fig:summary}\n\\end{figure}",
        "2211.03116_8d084adb44026bd7e722e8c0a65cf179": "The results offer insights for researchers that enable them to compare the focus their of their current research with industrial needs",
        "2211.03116_ff15b2a09f49224d22d643382e27f185": "A selection of related key insights includes: i) different from academics that study adaptation for mitigating uncertainty of classic maintenance tasks (self-*), practitioners also emphasise the importance of improving user satisfaction, reducing costs, and mitigating risks, ii) practitioners (in particular those of small and medium sized companies) rely on tools and infrastructure to realise self-adaptation, iii) ensuring trust in industrial self-adaptive systems is mainly achieved through extensive testing, runtime monitoring and alerting, and human supervision, iv) risks with self-adaptation in practice relate mainly to incorrect functionality, difficulty to manage environment uncertainty, degraded performance and increased cost",
        "2211.03116_60f78069d392a8dc88b1a3949cc6b7b9": "The results also offer insights for practitioners to assess the level of their current practice in applying self-adaptation",
        "2211.03116_c08498d7e4ddd3d5b7be4cdc1afbbb0e": "A selection of related key insights includes: i) practitioners broadly confirm that the use of self-adaptation improves robustness and performance while reducing costs and required resources, and improves user experience while reducing the burden of engineers, ii) a wide range of mechanisms are used to enact self-adaptation in industrial systems, iii) tools and infrastructure, such as auto-scaling and container-orchestration platforms are available and commonly used to support the realisation of self-adaptation in practice, iv) important challenges when engineering self-adaptation in practice are reliable/optimal design, design complexity, and tuning/debugging, v) there is a relevant match between industrial practice in realising self-adaptation and the body of work performed by the research community of self-adaption",
        "2211.03116_8c1272c3777173b7a7c41761ba9c866c": "The survey results provide prospects for applying self-adaptation in practice and opportunities for industry-research collaborations in this area",
        "2211.03116_4e5ff0a9f20e54d71169905f3980bc9e": "The prospects include: i) realising full autonomous operation, ii) exploiting machine learning, iii) improving quality and security, and iv) applying self-adaptation for maintenance",
        "2211.03116_ae2a09d1203451d24a2e08fda731e343": "Key opportunities for industry-research collaborations are in: i) consolidating best practices (architecture, patterns, and reuse), ii) modelling paths for the adoption of self-adaptation in industry, iii) supporting advanced features to realise self-adaptation such as dealing with the evolution of self-adaptive systems, iv) rigorous methods for ensuring trustworthiness of self-adaptive systems, v) governance of data, and vi) moving the human in the loop (performing adaptation functions) to the human on the loop (overseeing the system to ensure trust)",
        "2211.03116_990e74ff7ed6f296aa90decc7e7aa045": "We hope that the results of this survey will propel industry-relevant research in the field of self-adaptive systems and enhance the application of self-adaptation in practice, paving the way for self-adaptation to reach full maturity as a discipline.",
        "2211.03116_c456d303c96b18e4358f63d40ec631ad": "*Acknowledgement",
        "2211.03116_c85bf8648c0fefd1ab98eb68051f5766": "We would like to thank the participants of our study and the reviewers of the survey protocol."
    },
    "hierarchy": {
        "1": {
            "2211.03116_b799728037c1c785fc229c226aa2f89c": "2211.03116_f6ff846601e0317251f55a692af687b1",
            "2211.03116_35dba5d75538a9bbe0b4da4422759a0e": "2211.03116_f6ff846601e0317251f55a692af687b1",
            "2211.03116_e353dbe42c8654f33588d4da0b517469": "2211.03116_f6ff846601e0317251f55a692af687b1",
            "2211.03116_11573de01bf8a390bd42d1f7272bd269": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_5666b6c97307e29a255ba13ea216bcf7": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_2a5783ed8b626f9c5975217ef9e22a97": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_0e05648b732e3d9de7ce0025d8174fd4": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_aef8f3eb23a6a2d759671e41bc9bed4c": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_68065f8e23b8f3a12f54b5e13d671b7e": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_2d96ad7ef5061d568127deb4859a17e0": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_86889e673250563237dee1ac46b3bb3b": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_db36d59dbd46c2226c47f5fb77326a16": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_0b79795d3efc95b9976c7c5b933afce2": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_28e250eb2a9ad49e4e7167ca4f306439": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_21d8b46fb7ff04835e7cc2ca9760fe85": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_d93be64620ceec2e3b67d5f44326cb39": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_4fd7132dd0514558df522241de6014bf": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_6cd98eeed9e623c71d3a0a207c65d58d": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_f8171d836feea72b00c5c7ecde0ea51d": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_f1d2614e58e81deb3de1a11e364fb2f7": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_b8b600537497ed3e80e7bc5b95d11bb3": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_bdfb6e9b9bec9a3bd3557aec28a3c9f8": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_72877664622c85eb299c8d24cdec467c": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_2316c33796e15217027249ec06559390": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_e1531685b7a37f3308f7e48e7d19a587": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_18e6c9850d6914d1a0df47d442844016": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_f6b48884cbf8f9be895a669e1b6e133a": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_42dfd22aefe92256b08339cb8cbf9687": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_ef61ab18ebab151da76de7043823b9e7": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_477bf4be811458266f889a025f05687d": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_fe0a3e0c48977edccb59eb448c65de6d": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_22d7458906d165dc44c5b7205458b863": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_05fced9b8bdcc83c050c3697cde2319d": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_fe3b68a8a734767e3604bb0cc55426af": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_12f47da3866435076aecc74d2e3abc4f": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_0569e35b5265a0d44669432647352203": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_355188005c5a07c1dec9c0c40152e034": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_ec4767f6d9a5b0ed43dab3a543a88e6f": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_4ad941476a1b7aa2d8428d213a9abdfe": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_95afa94f0e78edf2ab3c714ad33c3596": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_ec539f2e1c5e3d7b0295a082d9e5bc87": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_6494727263339959063f528e52f497c0": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_c444d656ed7c6b31a1053243842eca0b": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_fc9b45668fb18b74071097c75ec4e37c": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_28b25e712b0d04970a7374b5c3a21952": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_b9f53d7d17a38a3e73e76f983526892c": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_192fcc457c201193a7e6bac49953feec": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_2763c841e037284d942a08d91cf85471": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_8b84dd6ddf24f615a1c272af865787cb": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_1e8b00d782f3d03cf2b1d6873c6eeeaa": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_90604c1849f93b2dea3997f0c2c498fa": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_77af6ad83ffe332cd6576217be5f8015": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_a986b7d0b94db2446b4d8ee03da06a98": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_281e500324a7a72edc097c935366aa6c": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_354294b3ccb73f935bb80a6c94e4cea5": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_f57487d255ce9c962884d394ae513fc7": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_b9c35872efe979c11ba30a280cdddfea": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_fe88f185252ac0bfcf5a762638d49aaa": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_6d088eed54fc084150057ac1fb71a49e": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_ae8c585de05e47d23e3da03257bf42e2": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_5b7ae3ae39f7689a73d62d3ac43cb7c5": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_76d6936b1083270adf0ef120eb04c0af": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_1d20734c58b2dbfaa7d3dbc8e86d034a": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_57bc624e47c46f96565bd2935dc7518e": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_3b7ade8ce6d1d51a21ba646fdadca3f1": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_6e9011363eb1858e2f251d7ed41bdeda": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_9cfb8090d645eaeb5a86c5f6655d372b": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_58d7302a895acb051900513e9dc4fdd9": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_d1d8848467bf58808816f092c36b7f4f": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_a5644e423f785ce4d6c736eb567da752": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_cd2ad40d908b084911e3fd85f5f2c1f8": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_e90b9d33e5a814f92247f065bf59513e": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_bb1cc79893aaa7491ae58d0fdcc8c339": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_580e7218980e56b549c39c9c383e368d": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_602e030a5c5eb469e8c54a4436e7d0e9": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_505df07444b8735d559542e07e89698c": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_0bbb041e33d3a0be6024e4425517252a": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_a2c50777385b5ae14dcbe16e10b149bf": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_ee818997d4cc384c2b0b7b725f5d96f7": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_98c029bab5ff8d3b19e400636f82ca56": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_2965ffbeab0411bf985f6fdc21661122": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_afb020f00fcfabbb0d7c7fa29a789280": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_ceac9b3a7921930a2939e55c969035d7": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_95a410a0b3984cf11c9cb914ffc5be18": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_27072f628c2e6b88edde78f30208fbca": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_a6af288971ddc7588e0c17f4708a4cf1": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_52e2190d090946294a5bfd572754cb9a": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_25ab6cb495305f02e2871ed70242e3d2": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_f8186a31710c0c08876ebf41cc9f55f2": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_d41e074bae3fb94081d7340222b9dc34": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_8d189b794496e11e6e6fb1db3913169e": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_1df40fbff642f66e6b9fdf331d0af5fd": "2211.03116_afb020f00fcfabbb0d7c7fa29a789280",
            "2211.03116_7d74f3b92b19da5e606d737d339a9679": "2211.03116_7bade40785d1f5c1dbec8c0414eaac9a",
            "2211.03116_bf5ffb5cdfec8a6b39ca603ae8029ad5": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_2f47b4fb96e2b45bdb2985b3af21cbbe": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_dffc03bd6f84cbc8daec89c1b66bae2a": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_7a11db51f65ba5257d418bde529430e6": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_2722d70cc981ad2caec468e3569ef35f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a3adaf1bf271be70bc2ccaff9cb1c6c4": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_8209906d53afa74b68252e1e5ef79df3": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_fc87b0258e6a407b5221c748f9541017": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_35621a89add8eab865a3ce783ed5d5d6": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_1ff6b16abf004bd227d495385d2d2c55": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_bf698e084de95a6973a9d865cf8aa00b": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_3d17ef3af19fd2d3b31b468cc8a3b5d7": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_46532266eb6bd754fef6856a2c79f987": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_433d67d83998d1a94ddd92e6bc6c7c6c": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_4b30fa94e9adc20d8f54c10be5cbfbf0": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_f22486234080234d0b9cbb9fb0476656": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5a2524aaba8fd7f2cd29019cfd6372f6": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_04dadb45baa9c2f3b77843f0a3f58c00": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_c5617d3205621e38cba62069e02601c2": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_1641549f67cf47554a2fa77b6e6832a1": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_42f0e35141dc1ffd3ede92fe93694d1d": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_25b2287b04e57f100739429f6b04547f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_acced341a0d141789a522783fa98a056": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_905c9fadd3c3ba3f2c0190eb4ead6644": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_78543599eb26310dffe631f999bd79e0": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5058f1af8388633f609cadb75a75dc9d": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_11b68aa7470bd84b12d6607fddc26d27": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0c60d5b32faece0e90bf26304561d152": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5c90701afecf89fff4544e9da0b1ca6f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_37eb025c522b75f6e3cf624e01684432": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_61c25c2bfdc6a3b0713bc51b9da57840": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_01d42f48d9d85437d93f8923605c6e4d": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_29baf0a0adf1402130b27bf49114a5f3": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_40b810108bfdb244969987c47db46d57": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_2c5d46c8647bb2bc67e5fe5630da7798": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_4486c4a6e5f8fcbb80f2e8dbd7ec5d0e": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_aff0989ecdfce972aebd368b4bdd8da0": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_4504e115ba62f77bb8bc8f44070e9b41": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_e527bdacb0db0edd81d6dc284f57d91b": "2211.03116_4504e115ba62f77bb8bc8f44070e9b41",
            "2211.03116_d9be6ca3f0073ea2f268716ba4342f62": "2211.03116_4504e115ba62f77bb8bc8f44070e9b41",
            "2211.03116_a8f65dd93445b90d34246cc201862695": "2211.03116_4504e115ba62f77bb8bc8f44070e9b41",
            "2211.03116_4a122607680e96bd07f5cbb7c1982534": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_cda4b08bfc0204dbf03b85ca3ddb554a": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0105cea4c18c08997332ca3dd0bdbfb8": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a522cdf748464f32040796b81d29fc42": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_6bc9228ed5f7e8fb76e4f5f9cfceeaa9": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_26d0a42f7729e4321a6cbe0c990eeadf": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_ba2da4fa054b42e18a6b2c6121d430ea": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f": "2211.03116_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03116_2e2d69a7178955d1c78950920f27785d": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_1bd78ccb3159e353366e2824f0ef47bb": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_d2c24d59e0baff4d0155fbdf62590867": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_faf9531f93ded226d30210c7b09ddc8a": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_c762eaecf975d0e42c7629a87d1d169f": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_a759d5b1a7969bc5508607767154a9e8": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_1c8865005d77bf339c151bddcc1f75d8": "2211.03116_606b51cc1c9d0b4af394419a22f2ff1f",
            "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_128a8b41e6be654e78c96e41de1e9e39": "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b",
            "2211.03116_541c64f840f64e087929bfd091f00f55": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_ea548b51ac4531246be85d61606575a7": "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b",
            "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce": "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b",
            "2211.03116_84522cc681651c06e56eff9bb97ea3e4": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_df77e31905c23d844a9356d1692b2fc7": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_4f532f11da55b276d224e05de403909a": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_03684e31fb5b27415ef50dbde9615010": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_d50162a9db0930e95b07c9df681677fc": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_b6d7cf9269a8a15dc209a9aef36d8ed1": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_640d5a80ad2250b7fa171f0bf8f599e8": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_9324857e7793a3016d3b4095a5145e80": "2211.03116_57206607fcf59746fe62d1d1c3a9d0ce",
            "2211.03116_8a01e310f9e2228d2a753f04eb47c312": "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b",
            "2211.03116_935039bd55926e6ea89800fce25ddc97": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_fae9e564278ed1f6d14862813c9cae8c": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_4bca476802b0b7632f03c76733332b6b": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_257a54fe95896716b20e7078a629e7f4": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_fa3e0ffd446dd220b5bee3fe329c8c98": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_729a5f764731d37ad571e1c9ffa3a9a0": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_aeb9dc4eec8736d48764010a13dc98f0": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_694f254b730d46291694c6bc878b5733": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_7f11be890de36955b36bf4e01d656f44": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_cda6fb9c44d4f4c749a283ce1e3895c8": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_67a42c76da6fa3c913c06100f08aff5c": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_f97fef819f89632f048844ae13b10322": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_3f8cc8b95df0ce577ac0acf86fe81dad": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_5f1e4b440d128b7da0696bbb39fe47dd": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_338f5c0d496c355891e0ac1aff7203d1": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_39e663d84ec7021201ecef2cea132f32": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_d8c70bbf6e0bb81eaef3b3b10aaef7dc": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_4541d43a0df4cb20517f9f85788bdcd5": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_91791d9acfab3396bb8d5d9d9336a365": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_3f7f0233f909727ea8252fb24df5868c": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_a7a327cd75f17a8d95df867f16c605a5": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_c0a55d14230ab1c4c233cabfebcefbfb": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_22497900298374b5b5244be6f93d2a4f": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_2943a325e91636494b06402c79bfcf78": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_3fbc47062d4ba1be3eaf64fb67602d0f": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_6fad98098213b276b036514d42449ecf": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_dd69f840de8d4c40d2206f636f8724d6": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_eb325ae53f6e55224f790c6bfc28aea7": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_acb34a561422b2a9a0281782faa41b1d": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_0244280b34d5151045e0c201fa9b4816": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_ffb552c166489117b70a9eb5480bb5fa": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_9371d7a2e3ae86a00aab4771e39d255d": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_9e76bbca0e1afcabebfc092ff71886b9": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_e34a728b74b75faf3d11045eb37d3aa1": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_e3c401910b4e846c600106e0f54d51ca": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_478e8b88ba6e2af39aa872754b29cd38": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_dff1cdc7684710777f497c020ab372d7": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_53c4f3b4d435ce9cc01cd3cf17f44806": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_4e602ff5f827daef61de4fa1d9e8c077": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_6eedd38cf2c8486eaa7fb23a6068bca1": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_32f70504912f4495ed4fa3c88246a107": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_9b76b722e6a22cf713622b815dd53a04": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_3c9bbcc6a710203e0bfc893b2cdc0d4d": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_3a210ea55590946f36cbb834ea0ea4f0": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_1860d75ad8434f077f5f7729ad42b887": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_2ea23c11384a9af8cceaa0b85f2e0d4a": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_2651185d34d384d00cf1017d093a5b7f": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_c79bc6dfc1e541cb7b69665b068084d2": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_991446b5062940197653c9e6fb35484b": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_1150d552769155044e5d9f2e713553c5": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_381e9d0bb15dbc7bc15e3da5c84273f7": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_9be6f36acb04ffd449925044303cf71e": "2211.03116_8a01e310f9e2228d2a753f04eb47c312",
            "2211.03116_323d6a1348df47d3174f578e1eff00eb": "2211.03116_3d6a4e87fb6f85b69ab33bea0f835f8b",
            "2211.03116_01fc9f1a1b8d9a7f6c91e8a3547881e4": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_a3f29047d706567e5bf07cf2661334ab": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_9db05e1117cd9433875dd3f00bddb994": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_1c89f7e50493ef113b93d7d5da9e7bb0": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_e01b34f47ddb3728a9fc2d9b43677958": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_995712d2bac2412a997f1665d9391480": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_d26f48ae9c1f9ff56c48ad8e531ed963": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_f410c47495523d7a73c630eec74f1291": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_89742f76fd2c3912da9d9477f4e763e9": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_94d7abc706b81a3667ad01556ada9bab": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_4cf89614f028fdf3990df4b2931e9556": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_d12c58dd87a860f22345ad4918d26e61": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_18b466a262a4f85f9dc9320dcb439d06": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_a758dbb271975f94b66819f6f4cfe412": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_1d832d14cea94a099012da78db2bc410": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_41687a7c038e7f54ac1444a9745125d7": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_18d8fcf0319201b17aa1d243c67aa511": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_ad3391d79c54c380b45ed8d5e05861f1": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_334252ac8dcedffe068be50c0f777b6e": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_d2826781a7d5735555b215a7606a6b26": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_179d7d0d29bf685e0f18065db98405db": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_fcf2822d81515b5905e57a18535a8837": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_68eec46437c384d8dad18d5464ebc35c": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_2df999f7cc4d968af5004e2b379654cd": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_962b77f1bec7dd116fa9f581e8711fd3": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_e41ee2734bd4234c628bdf6dde0928d9": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_26ff6184d5d08477035fb47f696f748b": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_88ddaa915b856a911097e513e74859ac": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_ad88adbdac50799a3bc8c02b217c6f76": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_7a32333ff8605ec668a651d845ab11a3": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_0f841f01f3645307bdb24fde42b3ea7a": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_72a0be2806a30f53d9c0cbfba6b76db4": "2211.03116_323d6a1348df47d3174f578e1eff00eb",
            "2211.03116_fd69c5cf902969e6fb71d043085ddee6": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_27571e5f33e0d3700aa1bb218ad08e71": "2211.03116_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03116_aa6bac568639f744386a483dbbbb0cab": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_7418974a3abb3c41c5d001c9cdc042af": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_0a2ed9047e5bafedc798458470705f3e": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_eaf1dd8dfa3390252f1ca286629951b9": "2211.03116_0a2ed9047e5bafedc798458470705f3e",
            "2211.03116_3e31324191c91f35ae1b52dba9c2170b": "2211.03116_0a2ed9047e5bafedc798458470705f3e",
            "2211.03116_ea34a9aacfe331886e927c86bfea8a5f": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_460fe70794d3801c3b0f5f6e64fbb152": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_e29d65b9fed4dc4be622bbc6b6a8f844": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_255bff050fe5417305d97c6baa3d4b3c": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_77a3c1689d60a7a7bb7cf5dff2ef5262": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_f9b5dfcd7b8a7d0ad235428144eaa74f": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_f6c29d45716c56e64735376991fde4fe": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_43a977b3008988a3526a8b1a2b198864": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_8ee35e3d1efe2cd41f03df8e884593ba": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_46aefbc0e4c7d2fa576d7bfd584ef790": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_666df2f48cd16f38212c093999248769": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_488cb6928a5f64178c2a46edb1979cb9": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_f2723b83c2aafa6983a0701a74715c5a": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_ff1cb1c60c9f5ab90ec3dc0f81430149": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_70b072efc492029a33a567dcc5fa18c8": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_7d948e1f4dd831e78777575def4f41f4": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_93c6d71f12ae70bcdd79fb194468686a": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_c2366059cf32931cfc22ac16ee63dc2a": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_dd80d51029ae18d1a5e5f38e137315eb": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_caec758d0b77b4c87f32c9b6a1d4e61e": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_5d60f76153e23febedae8a343fbb6cbc": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_4edb63a20b563058fc3fc43aef8e56ef": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_d720dc83baa3886589fdd1e2e85933ae": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_dbabe2f82d465e9a4b72d8b84ec5b7d4": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_cce62a8c7241facab9017abf66d381af": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_ce96ce64475d88003b81a20710c10f5e": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_8a40db0d67bdbe5bb0ad6a8c0cc446a4": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_87147ebfadf5c00e0d193a3803d3f93c": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_993ae58197d980f57dc570deb391d8d9": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_99d4a49301bdf09d875d5c0e99a03dbd": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_761533a3292279f6b8e560c7a3dd6506": "2211.03116_ea34a9aacfe331886e927c86bfea8a5f",
            "2211.03116_3201bda4968dcc98b9006123a5a25f01": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_608a7b99975f80b9e4802b2c2a453541": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_5fd984b0114e0cd5e7891888e30d15c0": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_44495a42106872aa9a065c4f2e157d64": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_5255c60934c7e542df0a1e03e9f54ead": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_6a2ceefdac169b9c357e61769eb7e9d7": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_100defb45b302bd23ae2af93a9d008dc": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_50e94a1aa57b823f98a901d01de4e338": "2211.03116_3201bda4968dcc98b9006123a5a25f01",
            "2211.03116_28007869a6f177a4c6145d99a7d1ec3e": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_5686666f285a1b88442c5f87258c1746": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_1e63f59f45e99ac8c997e8330bb1205e": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_45e82afb601ca6ff424124f8b2f7fbb8": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_1098fa7bdda55baa81f2e6ddb413fc52": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_87fdc9efbab296bea4b4e6a241d626e6": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_97e4e2d8ec66f3dfade6d23baf19fc85": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_a4b61edcca927970cf14a9f554e7526f": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_421de78c51f7d57671b367e425179e01": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_2828889d7efbb0f8688d02cd68b2c185": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_03034feaec6ac3a3ec68551eb2d54a82": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_821ceb1e53359a216a7058a1ca1036ed": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_d08b44ae70c7ba2877c79ab4dc497303": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_f92b39e6f84f0b8927070226fa794ad9": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_f8c7112dce3dd66555550e8370761b1b": "2211.03116_28007869a6f177a4c6145d99a7d1ec3e",
            "2211.03116_56744c5f5bcb735eadf31cf4157c7315": "2211.03116_27571e5f33e0d3700aa1bb218ad08e71",
            "2211.03116_8638944292577f278df11b558ed472b1": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_1e852e25f667d6102a2417e36d7fab67": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_69aa870fdf9addb53c897996547d7a98": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_f44cefb0b31400162b17fc97ba2ddc49": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_c49eb459ee19a55b26f0d29661b14dda": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_ffea9b7e88b0e0881008bc074816bdde": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_6c14d8fb93b6bfa2f4983753387935a0": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_f376e58e6dde20d27beb47e910c0a0c1": "2211.03116_56744c5f5bcb735eadf31cf4157c7315",
            "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7": "2211.03116_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03116_506688c22094ce65f9d63e4b81944916": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_d9e2678b382a3584038c61f13423baa5": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_9ac41c2ce8f4dec7a0b4ba39eb6df90c": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_93cba07454f06a4a960172bbd6e2a435": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_7d0764e33fbd4594d52248c7defc8633": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_eeaca4748931d1c3e74d99f11658b5d6": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_9d980abc6424acf866a20bd31ae2ace9": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_e214c30db99d8beabf87e41e8394a4d1": "2211.03116_eeaca4748931d1c3e74d99f11658b5d6",
            "2211.03116_b9c5b1bca54291976fdcc01ffad131a0": "2211.03116_eeaca4748931d1c3e74d99f11658b5d6",
            "2211.03116_53d39e4af17ea5ff04e4cc7092b7044e": "2211.03116_eeaca4748931d1c3e74d99f11658b5d6",
            "2211.03116_3a0988950c8314b9b9d4b7306bf9371c": "2211.03116_eeaca4748931d1c3e74d99f11658b5d6",
            "2211.03116_912892261fc3209b50eabc9b4b57e31d": "2211.03116_eeaca4748931d1c3e74d99f11658b5d6",
            "2211.03116_c41d00d3c15531ee0a4fc045897272fc": "2211.03116_eeaca4748931d1c3e74d99f11658b5d6",
            "2211.03116_3b3559efb171b34fe55b2b87275d8b0b": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_a6391668bcf329da880f7ebe78035339": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_48023f3641d97ea4c2afc78f51a8dacb": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_c3ffcb1f61a116064dd14d28ca093a30": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_46e3673effebc8d529a8639161110bf0": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_4cd3e0959cde0442a56e6104e4a41b6a": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_d1bc2b9adb0fd285fb55054d29961ad7": "2211.03116_3b3559efb171b34fe55b2b87275d8b0b",
            "2211.03116_73dddbf2a3f91103007671565ef899c3": "2211.03116_ac6ab2a522cbdcce10f6c956c4c268d7",
            "2211.03116_3ed2712934ea2cd07fe87ffe7f8b41d4": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_295f68a8274e6d5f9fe2342c0a06b461": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_4b9997ad9e8f7b5c0b00a2d4eeeefb55": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_0958cf795a5dd4ab8f9f7f169d0ce186": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_45e73637a82d4ab4512583570d41fbe0": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_3532f05abac8314260eb10b58a3a6807": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_c4b39647f8e97a433ff7ac0f5d2afebf": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_947d296aacc1e228c9b1ac6f79b84c0e": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_bd71c5d6427be06d6621479c997a63ee": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_78f8cc7eee05dc2ed816b0478c67b524": "2211.03116_73dddbf2a3f91103007671565ef899c3",
            "2211.03116_7bade40785d1f5c1dbec8c0414eaac9a": "2211.03116_d06f70149d5b0f3e6b130a050a7bd733",
            "2211.03116_60a9fd2182284da45537e5539022df29": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a9f02dfa5971cea6b6ce3a4cdc86f2eb": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_bf5b841b7415d86eee2fbde3e64d17df": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_48c96b8d6ad45d3b0a2793ba3e67ab00": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0d60f2ec599457b296928b8366e401b1": "2211.03116_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03116_41f9ad5af9823e71410328c358602c50": "2211.03116_0d60f2ec599457b296928b8366e401b1",
            "2211.03116_514ae45756e2e917a3107dbacb15cd55": "2211.03116_41f9ad5af9823e71410328c358602c50",
            "2211.03116_651ae5789ab776f2fcaf80b5e62801dc": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_be5d5d37542d75f93a87094459f76678": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_159a38bb0582aa5c65571d2248c70dca": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_6abfc2f3c52ab1e3b79c0abd9d53656b": "2211.03116_41f9ad5af9823e71410328c358602c50",
            "2211.03116_c0cb5f0fcf239ab3d9c1fcd31fff1efc": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_8a0e2b549d223aba55a866c38d1c9275": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_de0bf74dc3b2b029d7aec6e7eff0f8f0": "2211.03116_41f9ad5af9823e71410328c358602c50",
            "2211.03116_606946baf4864d642705789565f2afae": "2211.03116_41f9ad5af9823e71410328c358602c50",
            "2211.03116_57a24dc06cd7e45b07d7ed24283f9ca3": "2211.03116_41f9ad5af9823e71410328c358602c50",
            "2211.03116_9f69166552fe6e8a893625228dcdfb49": "2211.03116_41f9ad5af9823e71410328c358602c50",
            "2211.03116_4c1ef618c7ed2f8b59e52e1eb6253d14": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_ebf55d30f7961d09dbe54c244240bed4": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_2c0fd23a190e54ee964a8923f7d4ca09": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_22d9f7f92ed110272a01c614f0f04128": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_ddf49929e9c9c99f13f224162947105f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_539b78eabe019b8e652ac51631cdd850": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_9106d92b7bc977c35b1f5384e6147ff2": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_58ef8fafb44486016cb421badd874d2b": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_d1506ccde40ed119bb08e01a72de4340": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_ba5de27760fcf35dd1c605f3aacece26": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_6eee9898d5ffef4f29232c42dbc7792a": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5febb344d7b8a0177c6bc2bf4945c717": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5a259605066b8eb5f8bdfe9d696b61a7": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_79b59b138557331e311753a4f4d1a3e2": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_da544805812101212c31fe69c7004f82": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_c7f208b762ea79e3615dbb9bfc766eb2": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_acc5c74d90d03dc48bced20ed87a44c1": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_7b72739c8babc579f5bb407f3ecf2e27": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_9be96ca42755dd5a3ded7546015ddd9c": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a681b58b874e8057f3ac09d69d712d33": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a7aef7759798cfe2f3053a7aa7fcff23": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_014d3b0c2199edcfce49f801534931ca": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_7780c3622e091fbe86cd6caeaf43d50f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_92aad4ab3d6e37fb73150842e313546e": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_98adfd300f55f67e0b90dc1fceab475f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_1d32553a76addf20e86d01f27d89bf05": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_f402225bd45ec1d5e0f44ebe0469cd84": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5a10611e0eace6fadb62769fe142fe60": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0eb4944725ea25ae686c7c08c0f4f594": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5fc7c5d5229c40d0e826d6f2a93d2742": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_e1a7b2a99ad87b696b26f48e5c313eaa": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_98f49b14badf4ba1addaa2006b36308d": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a48efea0bb6bd588ca82bedcac23ab44": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_57267fb2685be0591a0337f532c08194": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_75e20d539d2ed5ba872add2596fc437c": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_4382782700c88a590f38af5ebddb53ae": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_da764fa16f1cd4f9a925081cd6f4adc0": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_8419ceaf0f8a653fb987cd780f7a167b": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_48c9bc6b6766c20905b44accc58b21b5": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_51c45b795d5d18a3e4e0c37e8b20a141": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_5a94a4b5439aef7298166eaf3cfab653": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_454143a43d26df4ab78709e55f975957": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_f4b58a8512b792377e16d997b7181f9b": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_ff4071fda3b0402a24f1800cc878c161": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_d341e083b8169aba7c030ec2b0106657": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_ad2f8a45952594d5ec7cc07595b1e2b2": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_6b6d3f8cb0fb0e68699c38b5b3a8ba82": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_fd2ce9e963cec834a233f8089758e89d": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_280997025feb74dd9af3dd16d025ac4c": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_2d464df6e82552b6b8ff0069032acc47": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_531a789b2a8c373b3d3c42108cc58970": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_69655dbe39e93730d5f1b8692dc648dc": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_c53f9af4002dc7af10b0da1c50781319": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_21f00580a82449f36ef32ea163202f68": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_cc67736361f33f3674c420481d534726": "2211.03116_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03116_543e2e89d9ba27de98b55e054512def4": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_155b1e0b084eb54ee19262fa02e44105": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_37f8a892f3084a13d90634a23a159549": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_9ca1d6cf557ac11d42296e2f30270b6e": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_4a2028eceac5e1f4d252ea13c71ecec6": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_c127f308dab4a04e831325faec68053e": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_db88a0257c220dbfdd2e40f6152d6a8d": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_f3ee6b5d7d0dd5094f80a78446ef2b41": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_c489ad6c50f2d4f810f4278bb969f1de": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_6e4ac029260b2294e8eab5b19cb37225": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_58127132cb6b4639e902227c186ef58d": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_10aa33cdf7d7fe7dce0c384fd20d06a0": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_33cf08a771e9805a9a9241e9d54477f2": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_b04b2070fcc3592b178f50ea65f22161": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_c99dbf17f41a6af2c1f391c01d7bd623": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_8cc304f5376a32160f028e2339eec813": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_2418e036e149d42d432a5968c102133a": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_18ccb9645940428e6b3c377997ac475a": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_874d58d0398071feb206053fc0a58b61": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_5656c816663a3fc322206d9b805f53bf": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_f7a5a23fa797176c3d0ece7b5e6944ef": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_2fe09f0cc04202a8485b874d63257549": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_46ccb2c7ae5a0afaabf106ba99edbb30": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_f68e52a4f606d1d712f1be12054c5582": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_7ae81ea19a77ce137aece8aa4a1991fe": "2211.03116_543e2e89d9ba27de98b55e054512def4",
            "2211.03116_a37e59162720c1dc8ae8299baae20cf3": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_816b4939bbcb2d86a31404c0e9fc567c": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_24170f8841ec8a1fedf2c5edc937ab62": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_9db0410a6addaef35858aad089e611e4": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_ec09ceedbd9ed3f4e7387b27c263d321": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_e81c4e4f2b7b93b481e13a8553c2ae1b": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_3fbdfdc056292c1a1a0a3de96e51b7e2": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_71a3630b55c3bb529444a28630caf13c": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_91808e128fee94a2ad01f6a449623d91": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_4b4c2bebc40548a6b75925df3faf4a04": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_0a5d2ba909adce9143f2f07e13bcd85d": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_2bde88920b0ea5a6f642494f40a52b23": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_587d4fd6ac25217d62ab401c06075e4f": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_0f11e4ef750308e4dc418961e631fb6c": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_3aba977ab28bf068489b0f1c711f465e": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_de019074dc247263ba29d5f3cf5e934e": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_0c756a788a5ffb5652dad8140fcf8172": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_43c60be3f63e1286c960a6c9f32c6b15": "2211.03116_a37e59162720c1dc8ae8299baae20cf3",
            "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_bd3b4a2af504156aa4a99947fe9418dd": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_e6153293f594a679ac53f75985f12d0e": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_d72166f8e59ffa8e2ed703e8f8d4689d": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_ebc55e99cde911beb0d0341ce9fede9c": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_5288ec02f07693b59db5451c0500240b": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_14526a4c3570ae6e0fcf525f33df8bdc": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_56595cdc8f34b4bc2ca2d7c890b14288": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_ba2ec4f0b1df570acb9f4276462e0c18": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_ec96e54b5ef46460aaa267f8373eedbc": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_da7ba542c8dd44cd1256808081eb0585": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_b04ae0d7ee85bc1f5e2f7811e608cc71": "2211.03116_f519cd9d2a5b435bb25b0854ab54ad91",
            "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_351f99f925b397b2ba9a962748583f3e": "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0",
            "2211.03116_3426c82a5daf58da29879eab5ba27146": "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0",
            "2211.03116_6d3cdbdcb9952c93854b2fbd13a8358a": "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0",
            "2211.03116_e8273e68444cd89938774024f7d99cf1": "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0",
            "2211.03116_e294cb39e98cb6586e9e8125159ea3d0": "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0",
            "2211.03116_cd49766e83683ee9ee72d67401086c98": "2211.03116_30a63334e097a20bf0b1bc3990a2e2f0",
            "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_ac1a4a919fc36337093f136ba2918d36": "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4",
            "2211.03116_9f18c47056915a2574d9b3b94e927d35": "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4",
            "2211.03116_10cb3319e64064109e715b8b49faefbf": "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4",
            "2211.03116_2fb9b0c335008141b2f1713c7840acea": "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4",
            "2211.03116_425aa8f092982c1c239a7bcfccc24108": "2211.03116_94c0317c0dc6b3ba3d45da3ee47af0a4",
            "2211.03116_3dd4a319b4b94243ae477d06da4483eb": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_cf52fe996a987120a396d05d59048e28": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_8a49370ccc62ad364ff217df223fda90": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_5ea944ade78c2c60cf23b4866dbea55a": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_c6ce8e7df3d0e9033cd54be29160af4f": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_57924eac5a5f54652b8c1ac0dcb1b72f": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_3c64cf03b835c669386a0d67f99bc040": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_3c24fe63898e7a18ad04b72abb71b921": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_3c6c6ae1c1dc451a3a658bf079a007d1": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_7df436e912b6615f0c32ce149abaf85a": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_aba18774b240680f938adeb999fec6e5": "2211.03116_3dd4a319b4b94243ae477d06da4483eb",
            "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_43507992707ef6c4eb1abc097085fea0": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_b65b07bd4a3e1bff11cad6ad25223eb5": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_31a4846751e21116ba6c911699b21310": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_34d5924036806ff8e69a5758b5847954": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_67c7d93e053a4e9f7b1370a548ffaa26": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_eaa96cb4b9ee16e953b38069c2bd8db0": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_2d8604cd88d42c29aa60e893d7b1a0ed": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_9c170490e0717b5997398dad9c3898a7": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_c1c4ab4872b241ae07b0365da1b5d56a": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_8a271a75915293e25e3e779c14096337": "2211.03116_b307ca75b54cb00ece9b3cdc84ae0e81",
            "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6": "2211.03116_cc67736361f33f3674c420481d534726",
            "2211.03116_9670c5812cdb38b704a9454e3ec8530c": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_118472070215bc786213079976644190": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_8273a65220485e55d0be988fb7f7bc5c": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_ecbded496a57acafa77a3c7c4f1a3ec9": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_719679163ac48091bb2e80f94656bd47": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_78c458980c024e1bb591b3c3aae72bd5": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_36575f7f6f49da8b0617deb303d7969b": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_5930730d9360eafee6afcc2571d536bb": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_b11522b4ce4d296734bab5b23ab81c1f": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_693b90b095826e22e6ecc563dbeff670": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_76cd1ebb345ed0326a51e45ee78b875d": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_012c1bd97d977c40f648a9fec161bf33": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_e233431b31bdf1173a1dc6603322d8cd": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_b9f3721cac10ca923075ddc83fcbfbfb": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_1a58d9541581f52dbe7e2eafcf4de4e6": "2211.03116_81e55e35fa47d41dab54ef5f3c07c7c6",
            "2211.03116_c60e4a3f3d4f9450e76b846ee3380cbc": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_9cf86e3ebc06039ae616574ea7702ac3": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0f70ccb50c9df141d6687dbf89474774": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_d875c6cca2dfa017224d33232b6ec7b3": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_80461d879f6c62bc3c4af07195c6a604": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0e565a373952593a3e5cdf1834a3c76c": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_6a426fb7ed9509008a05e4c1e7b76f2d": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_528b6efef89cf3b9640555aad48c9cd9": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_18faa3e74775e23d0a9612dcc958f22c": "2211.03116_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03116_812de806f5277831f304de073ded508b": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_581dbfb3ac7fed2209aa3c457ac4224c": "2211.03116_812de806f5277831f304de073ded508b",
            "2211.03116_6bf1e569213b007945ba1c9bd29c0ced": "2211.03116_812de806f5277831f304de073ded508b",
            "2211.03116_22cb74a60b2b38943d25e3248fe15138": "2211.03116_812de806f5277831f304de073ded508b",
            "2211.03116_b89405ca9e422ffcfba5b5a5b90db55d": "2211.03116_812de806f5277831f304de073ded508b",
            "2211.03116_5d5cb0cd0f2123e0c0d6cdb698be9621": "2211.03116_812de806f5277831f304de073ded508b",
            "2211.03116_cfe0d786e2168056e0e021ac99d156c5": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_45baeacbc273754f4e931cd8b1721646": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_b4261d6b2aaf78eea1103c70a29ad8e7": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_a825c1505d63920423ecb832a384c273": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_9d524215fe69f8f8661d27dc1e5a5e5f": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_5f4efa3e2e1da34f10744256c12db608": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_904f8a3921420be219030fab8e8b7782": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_0fce2225ecbb24425445a29549f30734": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_899b79860f28c7aee4003c13a31fdaa0": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_b6625b9c3b4b0bfa36c2173a2bd5a25c": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_2c515803b13d4fda3acfa1f095578053": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_f229e2ce0f050e17b7236963da8b54b1": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_400f594c73128edc6e6207e0cc3bf72d": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_41230186f181617e263f06c19645d18d": "2211.03116_cfe0d786e2168056e0e021ac99d156c5",
            "2211.03116_ae4790d843bbcdfa05a33447720d9e22": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_68c7109dffb5368f2aaadaee8fbdcfe9": "2211.03116_ae4790d843bbcdfa05a33447720d9e22",
            "2211.03116_e7241d5da6efe4ec0b720a77271be27e": "2211.03116_ae4790d843bbcdfa05a33447720d9e22",
            "2211.03116_671e414b9d4fe459d1ac8fbccae0ed96": "2211.03116_ae4790d843bbcdfa05a33447720d9e22",
            "2211.03116_b863cfdcfd8165ae3346b091a0b34dc9": "2211.03116_ae4790d843bbcdfa05a33447720d9e22",
            "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_5406b3e873ac872a4bf72d24afe0bd1f": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_230b98c69dd450259e6faf014216fa3b": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_2521d7d3daceb5f5950e102ba0a3939f": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_7b7e317e6097933690071fba79f3a42b": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_29c397fc03082051e9e833d5d0ce680f": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_6a1a12deac4a5ed52bb8286fe694ac04": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_f9d439e9e6da72c561437c38b34ee7ba": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_4ff43013c374180cee9587d609489a00": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_18e909e666a4b503c5f751d8d99e92fc": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_0495fe86311a75bc36944fe8beaa4600": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_00c5f1f168e2db83b57b84b71cdd86fd": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_f8ef106ea5b4f90a2d8b0364957c9a7e": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_4240a386ebdbd6cfa5d6c8fc29532263": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_7f8c3d88c20ff94089e56cd1b179b4df": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_8b5a0258281fbd89e4cd8da9b8e1c550": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_02b220572ecea8086d615c72521d20a4": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_8791637edc00c5ec1c17daaead86eef3": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_bc29ae1edc120400673f6cee3387f8d3": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_b20998da0eb2326120ff448c074e9c75": "2211.03116_dd2e166baab0d4a1a61421b4b3bc6682",
            "2211.03116_0ed1248facd92ad130324096aeb35989": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_3f9e69703d7a2a3f0e0502eb60d51fa6": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_fe6aee9dede7f54bb74710947e5a8abb": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_1bccb366a251bbadc7b886b20eb48f40": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_9a5d3d986aff7e63b8d1a14aaeac2fa3": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_bb4f4573ba74707510e2b17e661a3fff": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_59617e90c21eb9e4ad369bc8adcfbfed": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_6bee988f9023d2ba920c281614fe95f2": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_51f9dd27542ef48a30c03c2fb3f36d42": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_4122623175562cbe2df4f55ddaea9f6f": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_7e3d8ff33021df1de838cd029f5cd12b": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_74fdb4b8ea3f35f8159413461045e310": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_41ba391bdd2c155eb5e267cdd39942a9": "2211.03116_0ed1248facd92ad130324096aeb35989",
            "2211.03116_7a37b43e91d7cd1dc529ea7521326591": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_89eaf14f22f934ad829cc14d8bef536b": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_da9f0f2ba063abdf9247b1a8b02a9165": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_ac66add410fcc2ed7c2586fc51cc6dad": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_a56d8c24b031a731ae6bd7cc3012ba0a": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_dcecf1a4e7597a8c88feaee605a75d5d": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_f70e8d55f2c31e80d6e4ccf26c93268e": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_ed3ed980d0d0ffb971bee377c3615c67": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_4e85968a3aa1a78bec8e3ce75accba79": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_5b5858e9ae58ac3db54010851c02a980": "2211.03116_7a37b43e91d7cd1dc529ea7521326591",
            "2211.03116_6e531135b338fad33543d17be078b57a": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_b38a42a622923f78465b412e6d8ef1ac": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_dabce867963a1600e390591d2d222d14": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_af06e314c414d383ec2741e7c4824399": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_f9df54f88a7d787b85f44ed6c520af85": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_6b09b37158ceee0bf463cc94b50ced65": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_82e553615b42db1fd6e4ca43470a7ff5": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_29033133733f6552fac45782dc41184d": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_a2b01fe2ca93a4e24d42fd2f06479186": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_00e0840730ccbf6748e4bb3fff3a0119": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_e8e05850234fa3ffdf0f440cc71a2726": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_504433bf1bee406c87cd4ec7d8aef916": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_35cb26e23576ff581bbff6da2aea77c1": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_6f1d898d2b1259b3f3d91b2c16471745": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_f81450a270b387aff4c7a23b75ae7dc3": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_e9b3a3ee07c1579979e3e83200ff6059": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_444172abf3cd054e2d0a786b1c0526ac": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_356531e877f92351b8dea9184a335942": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_cdf67440ef482e6c1eca6703a9535ca6": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_0a501b6c757a9fc5ddb7e8d353ef2095": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_80afb3134ba89c39c2e327a64b62853a": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_44e1e932220a9889a69d6135813d9b6a": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_d3c05edee0b18305e69bcc9ecd4ee7db": "2211.03116_6e531135b338fad33543d17be078b57a",
            "2211.03116_72d23e74521291c742180a3b646b1ffb": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_d7a346414be1090d266e62cac4dacd6f": "2211.03116_72d23e74521291c742180a3b646b1ffb",
            "2211.03116_69430798cac68a684b74a8a591a17fde": "2211.03116_72d23e74521291c742180a3b646b1ffb",
            "2211.03116_96c722e57eb610abb62b2bfa66c212f9": "2211.03116_72d23e74521291c742180a3b646b1ffb",
            "2211.03116_d5f680abb6b746207f975894f8f74a65": "2211.03116_18faa3e74775e23d0a9612dcc958f22c",
            "2211.03116_eeabcae2eb99ff2bbb4e36f35f6d5caa": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_ec957c1a29d67a810b9dee9b6c70b59a": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_ed594d35f7842e51371527a9b7869085": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_116c5340923091ff8b39a7d63d3580a5": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_2a25cf7f67f38466b2189c9fe5f23099": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_df0a6e729130a913ba7c6c4d79f9e223": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_6355ec8455528974634acfb0cb1f0348": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_ff435ad6ff6202a715ce2dcd1845bd80": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_e6c708fe9f52228656889db8eb47fca2": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_2a1dd4be2aaa59667a2f23e63529249f": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_a060deab53b429a4c5268d4041f1eedf": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_59fac2508c56d690d539737d73f71668": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_4fb366b4fa13d883b53e6f2795e7249b": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_3675728585a8e678c361f154d799b66e": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_852df645b68bf91e21ab051aad538aac": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_a29ff5252ae7b011c9ad2f875976d515": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_42b7b5fe80c12a29ec5b10fcc4841219": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_884b50706657b3b08d66e3bb70907687": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_1689e12bd897e87fd2a31d49c76f9b71": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_69c42d77c09f8d8e3bfa670a0a99177d": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_43d1f5140de9f507fa270401da7cea4d": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_52f9d2aa428fb593428ea092617d1dda": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_afee9f30a686793f562c4a4b1360bfd1": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_3879c1ec04e9367b14fc99bc9c08d9b7": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_57b805c86c61333816cd62be7925777c": "2211.03116_d5f680abb6b746207f975894f8f74a65",
            "2211.03116_e0af22efe9220f55aec82f3e9c67356a": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_5aab4045259a44ff0cf57d1211ce9bc9": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_3f2037bdb744d1a6c119623d851388be": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_83ff7bfe5eee68862d4392b7f3716930": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_035f622101a8cd2f880ff1f307b1e60c": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_880e4be2c2478164fa55ef152bb56522": "2211.03116_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03116_832177bbd6e953e5b9480167dae688a5": "2211.03116_880e4be2c2478164fa55ef152bb56522",
            "2211.03116_3ba2774ec258d5255d17f1e38ad00c80": "2211.03116_880e4be2c2478164fa55ef152bb56522",
            "2211.03116_a376aca69745a17bafb49639e2a999b1": "2211.03116_880e4be2c2478164fa55ef152bb56522",
            "2211.03116_d89241c67733be01f5a8f125ca0d90c0": "2211.03116_880e4be2c2478164fa55ef152bb56522",
            "2211.03116_178b09b1119d7a2807ecf3b0496daa9c": "2211.03116_880e4be2c2478164fa55ef152bb56522",
            "2211.03116_eed9474fd944d045ff056d20004acaa3": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_d855ef79fc6d7f1320ec10266b4b9e62": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_1b3ef5ae7afbd47e24150aa310c97cfb": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_791a765b62174313dc841e01e04a0cbb": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_263df4303fc8e2f27499caefad0c6f25": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_b36896c28321a8c9e2e6a8e415422072": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_40eccbaa96e55592dc2666288f0cd660": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_66ec4ba08233396b08dfdf93766a2911": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_96a8068815b02bc6ca8f4b6d4fde97b5": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_e971f11eeda01ccb7460b9bb7d098e7b": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_b582fd8999e61320ffe2aac1d6ceaafc": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_9c542dacd13e5ed703a330d72d5f72e1": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_c241c2369b007d66e6a4ee7b3f35b66f": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_4134887c7ed5af1f28b56dd90989b6d6": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_f9f808ce3749093a071160dd8dd81036": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_b12f0c8fff68a14eec66e370ce1f2e94": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_5763d2e8cce2d691be35aed647fe814b": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_9b17762a21c303df1ffcefe0b6c05979": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_bf021d296bf1ac0f488f0b7513a4762c": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_fed42728cf85a27260412d0aeda51037": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_85d29203cb4bf10523515c5ab5c790f2": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_cad640a07b3953bb0aefa6d2073ea420": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_779c268361b252e625dc12c2896cfb59": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_9df4e63d2413b92fa2fe71ae8ca96324": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_ace4f1d7a83a7ab9a05fe20a5d82ea23": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_eb2ef3d87f55696411af681b16d3de6c": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_967f37a5c2ac5883c9f509b7862c7f61": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_bcbd2f1eb39f2dd608500e2849b3f557": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_894b82310824c5f9cc533c4a31bf6035": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_b9e1857c77c8f0787987adc8684a7a19": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_d46a240383ad68cd9e65724bb82ef96b": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_b75f17dc9f647874f1e82d83594b29dd": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_637d327dd9ab25e98fc3aa4c29715328": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_88a00d554c069b27d0cc88dded19337c": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_d0f410f52483c19d58a9c5783b16d89a": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_2c8694708e994f0a5232ecc4e01c1c78": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_03f1bcbc5d3e7175b7faf9fac404c9c1": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_4199c95a81d55d2a9d8be2a0ad488668": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_d1cba5824d29539fe625d2d4263a6465": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_11717f610839567caa4ef6221ee227c3": "2211.03116_263df4303fc8e2f27499caefad0c6f25",
            "2211.03116_dd67f3f8e8803bde43b75ff6751d4421": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_6e5e1da5075e90af16543bd9741288a8": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_46b6feebb0ea4fc97f3e255265e02c10": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_52de6d682ef8d8f2bf7a347452f94d65": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_ee978ca51f57696cc9467db3503e4f19": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_5a91049962cc1dddc29211d9411eadaf": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_78d8f18ff24725fe77c002c23dfff1a7": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_7c466ddfa124cd7334278aeb3f07dec4": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_4155924864f1ce33679321bb8370e1dc": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_295ee8e9017f4a625cf8a9dd3c77d225": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_0a72497f39a2d4e34c31983797559888": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_d75141d89b823f351c9426c0b95b0831": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_4c19b0a6347dcafe26488a9670c75ae9": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_b6ea3f88f810c76434c4b81a7dc128a0": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_183dd3e949590d8b96ccebabab54b296": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_d964813d1fefd12cb8f436fe892d6065": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_27274e623d00c9ed0474f543c0611a99": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_e8c8bfdfa5e59eeacb685f67f3b7b7f7": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_cde4b9b5487eeaa384ebb319c669408d": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_34143229f5842e0b9a1715e8b666e974": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_c32c5457bad2eea8791587441a1d40ad": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_cfd8f1cd035df16732d5332e6adb90af": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_739f08ec9ba85cb91df1fc1b41a49135": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_e2ed315f8a0c04771527fd8d3066ce12": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_2605e8db35ee93d19ac05af2874da18f": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_7299bf0c06909e4fbf7da626c0ee5e37": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_c768a9deb6037bcf13730ef3b7b80352": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_cff306d8b8630bbca4b366f6366fa021": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_46114024892d77206aaaf4aec8e05fd0": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_1fa6e43fd60ff5baecb531eb71a71786": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_2df9d59599f41c24512df3488e5f46d5": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_f1e687d97f598b73b847211d0b45eb87": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_4b40f033a7a6810fb89bb635e3111eed": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_a6d79265583c1cd23bdd6e4663075dc9": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_47af2b28511fe66aa8f8601ea164500b": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_3dc44dfb55e3de3fe3ce84a6e60170e0": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_52b785899e70d365737b67c7f664a8f7": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_31c6d20f956017569ea3117332d50253": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_ece6f89564ae58ece339e1b96ade3891": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_17fb242aca55990360d07991c8884584": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_e70bc8af966f370b6989824abe3732c7": "2211.03116_dd67f3f8e8803bde43b75ff6751d4421",
            "2211.03116_a86e2714c03cd04c6cd88651fc769d41": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_8bae344e0a39c7a6d9867a5c5be791aa": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_0c5b1e1cbdb8e4179b9800387597d20a": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_f970f415d5baef07348a38bb8727a8bf": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_d94129ffa31897547884356b6b5ca4d6": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_4d0dd197d752e526907b4aac962c7fd7": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_f1e2ef3235aebb282f8db3f6d973e78e": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_8e047c9343080de0165b6d6c3a809884": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_26c819e86d33ff755e1f9e71d47a8766": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_d737f87f4c4fc8161b758675d72c4cc8": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_743766289ada7d6e50a8546852036eb7": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_0bb4330ff9c39d16d87f75181987865f": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_5080b07d95bbe2aa2534879dbc5a321d": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_ff9075ae23ad4c90a3a9a0bd88935f77": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_dc56b1d3a7dfcb7ff94f49b1f5730d26": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_2d175bcb9384bb26ebb5f0063bae5124": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_3b21246f68e3d435785fbf7953af2cbf": "2211.03116_a86e2714c03cd04c6cd88651fc769d41",
            "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a": "2211.03116_eed9474fd944d045ff056d20004acaa3",
            "2211.03116_7ee0878121b281413bee5c0f1b5d8be3": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_d36235ff8ba495add7b7853ab8c6ec8b": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_6a2ca61bc5cd80d87f87e4a18ec092f1": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_1323c140f48ff54c67488392f47c988e": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_88a81bbc8e99be7f9653bd3d9537614d": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_183dda6939faf988146734c3718a5ded": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_a11fd0b302024f0449a7442e7bc6d157": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_3c79c459ac811312ff4ec5556c477efd": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_cc21841375aee4f535f4048ee1297cc5": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_fc1703a4033ae012088bef13515abfc4": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_366c90479bfb21d59f161006b747187e": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_b23a9576b6600a67073f7ba10f91d84f": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_1152260274bc8f29d075304e50be4974": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_736a32db7edf3df082f12e1610f59820": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_93165b694598df6a917bb2c97ae89e06": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_887e9af4dfe2a213547a2ba33e5bf698": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_c6eb65852c6f4fca471ff6740a4f4137": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_b8d5b4ceaf0c433302b804ae42141835": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_c0d4da2e224aa25bd4074e7c3d8898c4": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_1a04b165149cd523be0116206cc61d74": "2211.03116_50ee59dd6a1f6ad02b66113e8c38b38a",
            "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_c8729dd35150d4d133e0940c3a8d775f": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_c8966b6cc1997ecc4c76ae772ee0942d": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_0cf657b779c169b3e7c6b3f98a026a52": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_979e87c66e63427730c9d7219c3ac238": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_7e7f1a46419992d696c6a36d7056052b": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_6a3874e91f37d540472ce5c7408110d3": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_3a71cd479e19cced2bf1367737868686": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_162052f1932ec0224c38b1dcdf077754": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_22ee44a75b4269579c6add2403a5d509": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_73ef82d82fd5b1c2c3720596ffe4f3df": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_4aa7a5588f5801d7b13f753abeaaa70a": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_678a206688b057e8038b4e185b1764cc": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_461bbedf87110a6e79816847345db2be": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_8d514d6cb9e532eccceb75076dce1570": "2211.03116_979e87c66e63427730c9d7219c3ac238",
            "2211.03116_7068e31cc210f87158158ef0b6b3895f": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_95fb38efe10bc02435fd03f1051079e1": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_d6418d4308bf4efa732a469ff902ddac": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_297438c882c03c98810f7ff7adfc6f5f": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_0dd016e48830a45fdb3d153fd640be82": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_eada4916be79fd73158cd11ed2f50451": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_f6d1e03a44c89a25ba0eae5f6a67ffac": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_f4d72e5b796aa509b4707176d944d3fd": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_9a03b9b24925a45560915d8f8f58aeb5": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_d70be10b7f197b0abcebc47c73b96fad": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_13a317fae9d7feabf214f71cceb95ffa": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_90d938a08cf603b720687826537bec96": "2211.03116_7068e31cc210f87158158ef0b6b3895f",
            "2211.03116_820b8f74ad843d1574106ec4cadfc07e": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_f149642b8fa0eadd277d0b3e8e6a8ff9": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_19b26238ba08dae510a199cd2227d137": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_f68ca1fb43a96967929d4f284de03005": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_77712e00cbb382f95cd733f684debf1c": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_f1e75cfd151c254bf4d656a3f02f4ca2": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_2e299e347e745ac713e1df601a3700dd": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_8795f7555faba267adcda73ca737a081": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_3fe670948e1e0122681f540b05222892": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_28d80570cd392d418317ffc4905dcc7a": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_cdc13eb864bd706b2d10b43debba3d54": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_c86d6ba4373dde0e006949ff0855509b": "2211.03116_820b8f74ad843d1574106ec4cadfc07e",
            "2211.03116_d03ae3c704b5cc2a576d22faaeb10171": "2211.03116_d06f70149d5b0f3e6b130a050a7bd733",
            "2211.03116_2867483a7ef49e4194d4c095550d0186": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_f4fd42f40fb9d36f3f783ad1020343df": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_4aa0465acc5dbeb1f52db38f8518952f": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_cc2dd620d89b22ab42d85eb972343e92": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_c1ae9fe819eb2679a53585aabb16dbbd": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_f9440e136301836ee84a2dd86ef84f79": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_b219d3257999ebcf07d6ee6b06b27a6d": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_2667387bd0377d26bd69804d16a9d572": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_a2ee515f7099f79dcb6574c7b6c52f40": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_edcc40154d13f608fa62751615167a29": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_0feb3fc618a88e86e9bbb177b97fb119": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_d3b053d43d5cd79d3ce6be4acf6d70fd": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_cbdf5962b610be26ed566a4efcc58232": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_d06f70149d5b0f3e6b130a050a7bd733": "2211.03116_b91828645bac67b3c2b7fb114c3fd5d2",
            "2211.03116_36011a7c22b08b81ee4f4e29c9564f43": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_44deb7463e5caa2d0135de72ed513f8b": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_7ae287f5b1c1113fc78cf45e5d47b3f2": "2211.03116_7d74f3b92b19da5e606d737d339a9679",
            "2211.03116_b651e8a99c4375feb982b7c2cad376e9": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_b18900a4aa70612ac2a597d9599f2a67": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_86f470d7543443d6d3fe74966ae05d34": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_7480abb0fca5c5368e1ac37cf4bf38e8": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_a0085d3592957f2dfdc12c5bcbc641a5": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_ee38a75319bd82c59ac9ae4f21ce26eb": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_ec47b19f43b66e30c76e8023712580f0": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_ac702401c0dba1cc01fd8772a5be6c8e": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_8d084adb44026bd7e722e8c0a65cf179": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_ff15b2a09f49224d22d643382e27f185": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_60f78069d392a8dc88b1a3949cc6b7b9": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_c08498d7e4ddd3d5b7be4cdc1afbbb0e": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_8c1272c3777173b7a7c41761ba9c866c": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_4e5ff0a9f20e54d71169905f3980bc9e": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_ae2a09d1203451d24a2e08fda731e343": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_990e74ff7ed6f296aa90decc7e7aa045": "2211.03116_b651e8a99c4375feb982b7c2cad376e9",
            "2211.03116_c456d303c96b18e4358f63d40ec631ad": "2211.03116_e353dbe42c8654f33588d4da0b517469",
            "2211.03116_c85bf8648c0fefd1ab98eb68051f5766": "2211.03116_c456d303c96b18e4358f63d40ec631ad"
        }
    }
}