{
    "elements": {
        "2211.03149_428e7c60b664f5008fd0e35c6c9856c4": "Document Root 2211.03149",
        "2211.03149_f3bd149c3bb7de5b90d06bec6fea1fa1": "[Conference acronym 'XX]",
        "2211.03149_e353dbe42c8654f33588d4da0b517469": "Abstract",
        "2211.03149_6becf3bc1e086db713f0563ffafb159a": "To demonstrate the value of machine learning based smart health technologies, researchers have to deploy their solutions into complex real-world environments with real participants",
        "2211.03149_6b61dd4b98212bb6ebb4d768ad258684": "This gives rise to many, oftentimes unexpected, challenges for creating technology in a lab environment that will work when deployed in real home environments",
        "2211.03149_a28ee31c4cc86f1e6335cea134f65a06": "In other words, like more mature disciplines, we need solutions for what can be done at development time to increase success at deployment time",
        "2211.03149_43df5361aa822a905743f73b78a38df9": "To illustrate an approach and solutions, we use an example of an ongoing project that is a pipeline of voice based machine learning solutions that detects the anger and verbal conflicts of the participants",
        "2211.03149_1f12b97780cd8c0c81a53d0c1bc52bf5": "For anonymity, we call it the XYZ system",
        "2211.03149_6d164e49cb2abd23c892be6cb114a8e7": "XYZ is a smart health technology because by notifying the participants of their anger, it encourages the participants to better manage their emotions",
        "2211.03149_2e5a906330c74225acf50874e8526b78": "This is important because being able to recognize one's emotions is the first step to better managing one's anger",
        "2211.03149_4d1ff06d177eab6d4ac5251c528b464e": "XYZ was deployed in 6 homes for 4 months each and monitors the emotion of the caregiver of a dementia patient",
        "2211.03149_40b00e89a432e0f588c62995647616ee": "In this paper we demonstrate some of the necessary steps to be accomplished during the development stage to increase deployment time success, and show where continued work is still necessary",
        "2211.03149_b7e03030fe69906c1d2c27885e334e23": "Note that the complex environments arise both from the physical world and from complex human behavior.",
        "2211.03149_0fad25b8fb1bf316eba9f084f7a5ea9f": "<ccs2012> <concept> <concept_id>10002944.10011123.10010912</concept_id> <concept_desc>General and reference",
        "2211.03149_9f78c5a9c51ab57a6fe6167d72b8d625": "Empirical studies</concept_desc> <concept_significance>500</concept_significance> </concept> <concept> <concept_id>10002944.10011123.10011130</concept_id> <concept_desc>General and reference",
        "2211.03149_d5d31fd7feb337ede9af76b418926fda": "Evaluation</concept_desc> <concept_significance>500</concept_significance> </concept> </ccs2012>",
        "2211.03149_729f8ff38b50aeac7f5ba4ad4f6c0c21": "[500]",
        "2211.03149_0b79795d3efc95b9976c7c5b933afce2": "Introduction",
        "2211.03149_96407e4146d721ac08816207469c7c17": "Smart health research teams often develop novel machine learning technologies",
        "2211.03149_9a62a7c9f219699215fd7cffadf44074": "To prove the value of the technologies, the research teams have to deploy the solutions into a complex environment such as a smart home",
        "2211.03149_70f268310ad1fe7b13f96818ffffc811": "\\cite{bedon2020home, costin2009telemon, khan2017smart, gao2020monitoring}",
        "2211.03149_f492c23048ffde2ad611ca158b49a498": "However, the aforementioned works do not describe the problems related to the transition from the development stage to the deployment stage",
        "2211.03149_d73a5589701ba9c7c4947fad907de475": "In other words, during the development stage, the research teams try to develop their solution in an environment, usually a lab environment and/or a controlled home environment, which is less complex than the environment in which the technology is going to be deployed",
        "2211.03149_61f72a3c680dd4df68ac9cac3c1b236d": "It is well known that when new technology is actually deployed in real complex environments, issues previously unseen in the less complex environments are going to occur, especially for long-term deployments",
        "2211.03149_eff926391288d7c345d7ceb4719969a7": "This paper describes the XYZ System, a pipeline of voice-based machine learning solutions for in-home monitoring of the emotion and verbal conflict experienced by a caregiver of a dementia patient",
        "2211.03149_b03f6e0bca33dc5a6bb7dd77ced8395f": "XYZ is considered a smart home technology because it helps caregivers of dementia patients better manage their anger by notifying them when an anger or verbal conflict is detected",
        "2211.03149_9d5d749d687fcefb34f5329383ee2e02": "As Pena et al.",
        "2211.03149_ff10e3062b4ef45a82ecd105dd6f0092": "\\cite{pena2015integrating}",
        "2211.03149_1c5aa20afad447ad38eeb27b7ee9562e": "have discussed, one school of promoting emotion regulation is to permit the individuals from experiencing anger",
        "2211.03149_2adfbaf235b22f2bc665867764551b3f": "Since people can be bad at recognizing their own emotions",
        "2211.03149_4103347e1ca36426383910100b958c47": "\\cite{goerlich2018multifaceted}",
        "2211.03149_fd9485fd667b7c6e6482df6dee6f9688": ", a smart health technology that notifies them when an anger or verbal conflict arises is very important to their emotion regulation",
        "2211.03149_ef60fc45da8e9351496c1d3bdb58f5ab": "The goals of this paper are to (1) demonstrate solutions for what are needed at pre-deployment time to increase the success of voice-based classifiers once deployed, and (2) present lessons learned for environmental and behavioral complexities uncovered",
        "2211.03149_5058f1af8388633f609cadb75a75dc9d": ".",
        "2211.03149_460b5811ca540df898a8f5791a74d121": "The main challenges of integrating novel machine learning technology into complex environments are that both the physical environments and the participants' behaviors are complicated",
        "2211.03149_ec2414225f4af6515af730209fd04dcf": "For a smart health technology that uses voice for emotion detection",
        "2211.03149_76a62247c115ca97f9fce380beb6b732": "\\cite{gao2021emotion}",
        "2211.03149_8b1b426dae08bb57c122fd54ac6774b0": ", the environment is complicated because the solution needs to address the problems of acoustic signal's deterioration due to background noise such as birds chirping, room reverberation due to the signal bouncing off the surface of furniture, and deamplification as a result of the distance between the human speaker and the microphone",
        "2211.03149_312abdfeb21c9ef907a9b38a506e8404": "We call these environmental distortions acoustical realisms",
        "2211.03149_75c4c5cb8684a87d292368746cfd03c3": "Also, the television could be on and the voice from the television adds to the complexity of detecting the participants' emotions",
        "2211.03149_932cb934cd1150619448c454cd61a691": "Human behavior is very complicated, too",
        "2211.03149_18307568137a7106a4c1e6c8b7ff5d2e": "For example, people could be yelling across the room to ask each other what is for dinner",
        "2211.03149_d63bc1e5640e38ba9a785e0b9dfa145f": "They are not necessarily angry, but yelling itself is seen as an anger event by typical emotion detection technology",
        "2211.03149_138bc1609938a56e6455896b5dc5f03f": "Visitors are common and for privacy the caregiver may turn the system off and forget to turn it back on",
        "2211.03149_5a022b692ecc21336dcefb197fc0bff5": "The gist of our solutions at pre-deployment time to ensure maximizing the post-deployment success of the machine learning algorithms in the XYZ System is that we make sure to evaluate the algorithms on data samples that are most similar to the samples that the algorithms are about to encounter in the designated environment in which the algorithms are/will be deployed",
        "2211.03149_2a1705d715868e84a4f6316f37ab3e30": "Using the XYZ System as an example, the (acoustical) samples that the algorithms in the XYZ System are about to encounter in its designated environment (a participant's home) are voice samples that are environmentally distorted",
        "2211.03149_4824fcdeb3e9ad7075480ea46174195c": "It is worth-noting that some works, such as Chen et al.",
        "2211.03149_995f0042310d9b3d67279849af591f4d": "\\cite{chen2019arasid}",
        "2211.03149_bfa5c832480ba410a72b3bd64b170d5a": ", do consider the designated environment in which their algorithm is going to be deployed during the pre-deployment stage",
        "2211.03149_0bd26a56175b60375385569cfd9825ca": "However, they do not evaluate if their hypothesis that the algorithm",
        "2211.03149_0e254caf8bad34adf30091c19dcaddb9": "holds true",
        "2211.03149_0d3f75555409e4b65cd57b5b65e08b33": "Unlike works such as Chen et al.",
        "2211.03149_b0c70c88bf2db037621f5d5bb66b6938": ", we perform evaluations to show that after our rigorous pre-deployment time assessment of the algorithms to be deployed in the designated environment, our chosen algorithms indeed perform well during the post-deployment stage when they are being deployed in the designated environment (the home of a patient-caregiver dyad), which is one novelty of this paper",
        "2211.03149_b41ffd0650855d3c9cab3c6d573a04eb": "A more nuanced finding of this paper is that different acoustic components need to address different environmental realisms",
        "2211.03149_a0d539310a5f143ba04aa5deae18a440": "For example, the voice activity detection (VAD) model only needs to deal with non-speech background noise, reverberation, and deamplification, whereas the emotion detection model needs to also deal with background speech (such as those from the tv) because background speech could confound the classification of the emotion detection model which uses speech to determine the emotion in that speech",
        "2211.03149_4e690252b814e074d25df789f6746cf9": "The purpose of the XYZ System is that we want to help caregivers of dementia patients to manage their anger as well as the verbal conflict events that arise during care-giving",
        "2211.03149_cbf51c80867b35b9de952f11897393c3": "To achieve these goals, the XYZ System has three add-on components: the Cloud to which the audio clips are uploaded for safe keeping, the M2G monitoring component that notifies the developer(s) if the XYZ System crashes so the developer(s) can investigate the causes, and the Recommender System using EMA, which sends messages that are interventions or recommendations to help the caregivers manage their emotions and verbal conflict, if anger or verbal conflict are detected by the XYZ System",
        "2211.03149_8634a4364d355f8ccf2d146fbcc5cf07": "The entirety of the XYZ System and the three add-on components are referred to as the",
        "2211.03149_5dd14dcbd3b7d468ea03cdf76a9545cd": "(XYZ-Whole) System",
        "2211.03149_843d40ae62bb38274abd32346ac3dad9": "We also present some lessons learned on several aspects of",
        "2211.03149_34e667137a9c40e68a16b4a0a8cd4910": "Note that the focus of this paper is the XYZ System, not its add-on components, so we do not evaluate how effective the add-on components are at helping the caregiver manage their emotions and verbal conflicts that arise during care-giving",
        "2211.03149_505c7e0b72771373f04ab1ae9685dd21": "Nonetheless, given their essential role at helping the XYZ System achieve its goals, we have decided to include some discussion of the add-on components in the paper.",
        "2211.03149_5bf7a48ef9ae7f52a7dc04e2654aa47d": "The contributions of this paper are based on the in-home deployed XYZ-W system from",
        "2211.03149_cac6235e8f2889f915d2151afcf293f5": "This work was performed under an approved IRB",
        "2211.03149_6cfb7e2dacd3e8cc53c21b2830e74f70": "The main contributions are:",
        "2211.03149_a8f65dd93445b90d34246cc201862695": "List (itemize)",
        "2211.03149_7d74f3b92b19da5e606d737d339a9679": "Item",
        "2211.03149_2fb4f4c076e5231260e10fdd316ddeb0": "A pre-deployment approach for improving standard and novel acoustic technologies deployment time success.",
        "2211.03149_27ef7f0f05856c0b6e2550b1fdd9a68e": "A pre-deployment approach to make components in the deployed technology adaptable to they can be easily adjusted during the deployment time to satisfy the needs of the participants.",
        "2211.03149_c7acc2736c73467c087605269d7bb73e": "Developing a set of privacy mechanisms that are shown to help dyad recruitment and satisfy privacy concerns of actual users of the system.",
        "2211.03149_90d929d894c49ccfd2cefb5eee4c5f69": "Our post-deployment validation indicates that people are not always good at recognizing their own emotions, which reconfirms similar findings in the literature",
        "2211.03149_a7f204812a4ab08c2f566ec19b4abab8": "Related Works",
        "2211.03149_b7e8977a5368d94f458708a5693d8543": "In this related works section, we discuss existing smart home technologies as well as how human behavior affects the efficacy of smart technologies",
        "2211.03149_641548ce65546ae625d265a714a07523": "We also briefly talk about emotion detection and conflict detection using voice, since the XYZ system uses the voice of its participants to detect if they are angry and if they are in a verbal conflict.",
        "2211.03149_c6a50c360fa182ae652826ca53e54ea1": "Methodology for Deploying Smart Health Technologies",
        "2211.03149_055e213968694667190897c7b3d07ec5": "Zeadally et al.",
        "2211.03149_f7a7237be6426a53b250f73fd342a693": "\\cite{zeadally2019smart}",
        "2211.03149_ccb29382ad9e1ba496b3b1da0db8bb03": "argue that deploying smart health technologies can improve healthcare availability, cost, and access",
        "2211.03149_ae6fa5f4cf9cc5292cc34e9d96af4f80": "However, there have not been enough works for the methodology for deploying smart health technologies (usually in smart homes)",
        "2211.03149_28464c80630fe3b9c4cfa9c23e4fa39c": "Bellandi et al.",
        "2211.03149_1bd5519b48a6401d6f2aacbe620a58e0": "\\cite{bellandi2021design}",
        "2211.03149_96ea2dc1a0812eb70860256d86c81530": "is among the first works that propose a design methodology that matches smart health requirements",
        "2211.03149_83c7bbfba6ad0be3bd374fcb6d496678": "They argued that due to the rapidly aging world population, smart health technologies are about to playing an even more important role in caring for the aging population at homes",
        "2211.03149_7b553dffb33756cad24b1bc0199c0ce4": "They propose that the perspective of deploying those smart health technologies at homes should be user-centered",
        "2211.03149_0260cc1e7bc637aa842f7a13453a00f0": "To select a solution to be deployed, researchers need to perform domain analysis (surveying the state of the art), requirement gathering (stakeholder elicitation), requirement integration (determining the consistency of the requirements), and then finally solution selection.",
        "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6": "Human behavior that affects the efficacy of smart technologies",
        "2211.03149_be681c8b3db0878332f47682e446fcfb": "There has not been enough work on how human behavior affects the efficacy of smart technologies",
        "2211.03149_fa750b7f27d9a87f9ba97d1eaf5da46b": "A previous work",
        "2211.03149_97d8dfe5a8f5d72111e93a7d6c957933": "\\cite{yaghoubi2010factors}",
        "2211.03149_83ea1048c25caa3a726f7d3bcd4c10bf": "hypothesizes that the perceived usefulness directly contributes to the user's attitude towards the technology",
        "2211.03149_3797d3dd637161f2062f4402f25ea2aa": "Nikou et al.",
        "2211.03149_7121f21addf0f7857df5169159c14d54": "\\cite{nikou2019factors}",
        "2211.03149_7789b4e0bff323e305e3790573719e8b": "suggest that perceived innovation and cost directly contribute to if the user will adopt a smart technology",
        "2211.03149_18e09f206943055bd1d0719effaccfff": "Perri et al.",
        "2211.03149_11e0eb38ef85163b34d359561649765f": "\\cite{perri2020smart}",
        "2211.03149_b01f3bd054549fd8248e6e113fc3fb88": "point out that the attitude of the user directly affects the adoption of smart technologies, which we would like to extend to that their attitude directly affects the efficacy of smart technologies as shown by the observation of a user of our XYZ system: he was not very compliant and sometimes pulled out the wires to the laptop on which we ran our system",
        "2211.03149_511af8043f7d66af54c3b7d245e64106": "As a result, the computer was out-of-power and the system was unable to monitor the participant's emotion for a period.",
        "2211.03149_99975fe953f1aa9b4cf801fa116f810e": "Voice Activity Detection",
        "2211.03149_c2b10d5c465ad21982c3bbb82f8d9883": "There have been lots of work on voice activity detection (VAD) so we only discuss the recent advances in the field",
        "2211.03149_ed7567d90c2d4dd5338e4f5eac5b761c": "MarbleNet",
        "2211.03149_9f86b0c0fe82da2e8065f01a127544bd": "\\cite{jia2021marblenet}",
        "2211.03149_53b5cde6e952e6067baeb2d7f75153f2": "uses deep residual network consisting of blocks of 1-D time-channel separable convolution, able to achieve the state-of-the-art performance with the advantage that the number of their parameters is significantly smaller",
        "2211.03149_0d09f1102592e1e5ee3beade5cbdcd38": "The robustness of MarbleNet is also extensively studied to demonstrate that it is robust to real-world acoustical distortions",
        "2211.03149_67231162ba69eb6bc3e62936662f9c68": "Using teacher-student training, Dinkel et al.",
        "2211.03149_972f48574b82274ed65affc07f06b51d": "\\cite{dinkel2021voice}",
        "2211.03149_3d83f35322a5062920d1e6d92ec850a5": "also strive to train a model that is robust to real-world acoustic distortions",
        "2211.03149_1212865afe92b84493c2e2951ff2c889": "Dinkel et al. identify that traditional VAD algorithms are trained on data devoid of such acoustic distortions, and therefore their usage is limited to data without the acoustic distortions that are inevitable in the real world, rending them unable to perform well in real-world settings",
        "2211.03149_360bccc96d869ea64d8507f18a4b8762": "Other works on VAD include Wang et al.",
        "2211.03149_afd198218b3bdf1cfa750ad4bba098d0": "\\cite{wang2022cross}",
        "2211.03149_9699f4161d8baf8cb77d32556de331f7": "that uses a cross channel attention based model to achieve voice activity detection in the M2met challenge, Braun et al.",
        "2211.03149_3001b53df2f45419bfd6aed118cbe98e": "\\cite{braun2021training}",
        "2211.03149_d5177820c5a2f82ba3bad8f722b64752": "that is specifically concerned about dealing with the robustness issue of many state-of-the-art models",
        "2211.03149_9c4391f8772027760decb9ddf392f2fa": "What is worth-noting is that, some works developed for other purposes such as transcription, can be used as voice activity detection models",
        "2211.03149_d4cab91b3b8b916591aed9affe7cefa6": "For example, the Google speech Recognition (GSR), a transcription service, outputs the transcribed sentence from an audio clip if that audio clip is speech, and it will throw an exception is the audio clip is silence",
        "2211.03149_9914e956be512b43d841d20adc335f76": "It is worth noting that although works such as MarbleNet",
        "2211.03149_def65e449eaa5e1345d487f8c842bb31": "and Dinkel et al.",
        "2211.03149_fa9c556a295d17600cbf032cacf8fc54": "attempt to ensure that they work on datasets that account for realism to be encountered in real, designated environments in which the algorithms are to be deployed, they do not evaluate their post-deployment performances in the real, designated environments",
        "2211.03149_61bc75e4434240c5690e6316d88e5fa4": "Realisms that the VAD model deals with usually arise from background noise such as footsteps, and the VAD model needs to differentiate not only silence from human speech but also those background noises from speech",
        "2211.03149_68ea76bd67df967865008df720ab8ac7": "The realisms that the VAD model faces is simpler than the models that we discuss in the later sections, the speaker identification (SID) model, the emotion detection model, and the conflict detection model, which needs to deal with the tv sound as the speech from the tv could affect the classification performance of these models.",
        "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f": "Speaker Identification",
        "2211.03149_ba041df90364097ca781aa845f0ada2c": "Again, the works in the field of speaker identification (SID) are abundant, so we only discuss the recent advances in the field",
        "2211.03149_0fa791221683f01bccebddbb56191e4e": "Chen et al.",
        "2211.03149_cea3866e109cd52fd4c58107d003b03f": "\\cite{chen2021graph}",
        "2211.03149_2cf577d6a51a988af209bd9790dee44b": "introduce a graph-based speaker identification model that is reliant on speaker label inference",
        "2211.03149_5b4bad4bc35174eb11f336f837d5f698": "It is particularly concerned with the task of SID in household scenarios",
        "2211.03149_207649d9171f1b7bcd8549f0f4c41449": "WavLM",
        "2211.03149_4124afd7d781422c99a3c1d16a17b1ad": "\\cite{chen2022wavlm}",
        "2211.03149_b75d7ce3960f7b19b3ae946712f5f9ba": "recognizes that the speech content by by speakers contains multi-faceted information such as the identities of the speakers, the content of the speech, and paralinguistics",
        "2211.03149_3725aaa57535830f807fefe1db84e167": "WavLM is propsoed as a pre-trained model that can be used to be fine-tuned for the purpose of various speech recognition tasks such as speaker identification",
        "2211.03149_ae43cebc517155a542a1bdf22344a2b9": "Snyder et al.",
        "2211.03149_f6cc7caf3ef3f462d26c32c9c96777a4": "\\cite{snyder2018x}",
        "2211.03149_e36985b2fc742895f80d9537bc03d417": "proposes an xvector, the results of mapping variable-length spoken clips to fixed-dimensional embeddings",
        "2211.03149_eedf6b875d99beafa67a1de777fea88d": "Again, works such as Chen et al.",
        "2211.03149_c32ec3438833531188ba5d0b6f78b5f3": "evaluate their algorithms on datasets in which the realism to be encountered in real, designated environments in which the algorithms are to be deployed, but no post-deployment evaluation is presented in such works to show if their approaches to deal with the realism are successful",
        "2211.03149_d4c665091913d2f401fc1c23c3e5c99a": "Realisms that the SID model faces arise from background noise, especially the tv sounds",
        "2211.03149_83e739a7da0c6206196789b70b3738d4": "Note that the realisms that the SID model needs to deal with are more complex than the realisms that the VAD model needs to deal with, as voice from the tv could confound the model from correctly identifying the identity of the speaker in an audio clip",
        "2211.03149_86b7a6978be279a3f641dd9b5ffc7f0b": "In other words, the SID model needs to be able to deal with more complex background noise (more complex acoustical realisms) than the VAD model.",
        "2211.03149_b76b247889a9ea90211ec423d6161532": "Emotion Detection",
        "2211.03149_c75fef9c47c46a022b8c99151cdf5df7": "There have also been a lot of work",
        "2211.03149_256df5fb8b2b6d3beca6ebcd96b86ec0": "\\cite{ danisman2008emotion, emodbdeng2017universum, emodbwang2015speech, emodbalex2018utterance}",
        "2211.03149_acdd0c16c901f1725b2b77ce31cb4f23": "on using voice as a modality to classify emotions",
        "2211.03149_331c8b1c328410e1e8062945cb7081ef": "These use several datasets that have speech files with emotion labels",
        "2211.03149_e62ecba6ec7e16614506ed66fbb1ff68": "EMO-DB, a dataset of the German language",
        "2211.03149_f9c8e1de7acc915e183d6521814ab480": "\\cite{burkhardt2005database}",
        "2211.03149_d4cc482ae9b5dc6393c4e183aa1d8321": ", is a popular one for many works",
        "2211.03149_98379fcf1df04b89751dd25e2f44e510": "\\cite{emodbtriantafyllopoulos2019towards, dickerson2014resonate}",
        "2211.03149_12168dad6f6c524c9bd56b44ddaa02b5": "It consists of six emotion categories such as anger, sadness, and happiness performed by actors",
        "2211.03149_95c6bee5d6bdf947de5cda79b8411a01": "Another popular dataset is RAVDESS",
        "2211.03149_130f5df5da248d8484cb8aa308ca149d": "\\cite{livingstone2018ryerson}",
        "2211.03149_662fba80ced12bca3becb5cafff1ff43": "that consists not only of the emotional utterances, but also video footage of emotional speech",
        "2211.03149_7ed67ecbf76d4a22fe7d565ef6b60211": "CREMA-D",
        "2211.03149_99c180106a979f499a36fe35e0520f20": "\\cite{cao2014crema}",
        "2211.03149_5de04e3b0e9d09c0c7f35946757a3560": ", like RAVDESS, contains both audio and audio-video samples",
        "2211.03149_d23bf5e466a532bec03c7aadcd50058d": "Despite the variety in modalities, since some datasets like EMO-DB have only audio samples, and others like RAVDESS have both audio and video samples, the emotions that they have are largely in common",
        "2211.03149_1fcf4a2238549386fb710a499f3458a5": "The common emotion categories in the datasets are happiness, anger, sadness, and neutrality",
        "2211.03149_48e02e4c2ac4db7999ee6b259621b96f": "One common problem with the emotional utterance datasets is that they are often collected in controlled studio environments in which realisms expected in a real, designated environment do not exist",
        "2211.03149_f5b2ab85a6917c820892a3b6de3de214": "Algorithms trained on those samples are shown not to be robust when deployed in the real world",
        "2211.03149_b64a53d8eedd55ec42dafbece939a6c3": "There have been works that attempt to address environmental distortions such as reverberation, deamplification, and the background noise at pre-deployment time",
        "2211.03149_7be6e681b7cc4658e818f950e08b04a7": "\\cite{salekin2017distant, wijayasingha2021robustness, shchetinin2020deep, gao2021emotion}",
        "2211.03149_def6c1d6b73fbcadd59330f827d13e14": "However, they do not confirm at post-deployment stage if their strategies of addressing the realisms work",
        "2211.03149_1f621190263a9f5aaefaacb1e88f9b05": "The realisms that the emotion detection model needs to address, in addition to deamplification, reverberation, and common indoor background noise, are tv sounds",
        "2211.03149_590b5f60e789fb3eb5a031dfffbb5750": "An audio clip produced by a registered speaker could include background sounds that are from the tv, and the speech from the tv could confound the emotion detection model from making the correct prediction as the speech from the tv could be of a different emotion than the speech produced by the registered speakers.",
        "2211.03149_f6655941c8b7f1b64866c108d6780457": "Conflict Detection",
        "2211.03149_55dd2b1fdf10cf1ddd41562718dc8e5a": "There have been several attempts to detect verbal conflict using sound signals that a microphone picks up from the ambient environment",
        "2211.03149_026c89c143f20d27ddf4248bff7c9c34": "A work",
        "2211.03149_b805b19e03b33d83044810661e50d372": "\\cite{lefter2017aggression}",
        "2211.03149_ff6aeea40c797b1f680f4f724df3afa5": "creates verbal conflict between pairs of a student and an actor who act out conflict",
        "2211.03149_29214b65390f9f86fe66000eece45af5": "From the generated conflict episode, it is observed that overlapped speech is an important indicator of interpersonal conflict",
        "2211.03149_0d5c3d245730f83ab955749942ebf5cf": "However, they did not create a model of automatic conflict detection based on their conclusion",
        "2211.03149_32cacacc4e5fb943be8ca25e39b3d95f": "Based on the fact that repetition of parts of speech, such as syllables, phrases and words, is indicative of interpersonal conflict, another work",
        "2211.03149_979c84bebc6adc2a779b73e4cc1208b4": "\\cite{letcher2018automatic}",
        "2211.03149_b0ab18c1263411dac151629477563484": "develops a repetition detection model that uses the audio files collected by the on-body sensors of police officers to detect conflict",
        "2211.03149_537a1039d49cec23b4b62710b3c77095": "However, the interpersonal conflicts that police officers encounter during their jobs are not the same as every-day interpersonal conflicts that take place in households between arguing family members",
        "2211.03149_aef8e1bc3328f2da6edba3171685c35e": "The state-of-the-art modules on automatic conflict detection using speech",
        "2211.03149_f7a167b0777e6f7f182f635280d81b01": "\\cite{caraty2015detecting, grezes2013let}",
        "2211.03149_3375b5b9b3511c63bdc9d81ddea939a6": ", achieve satisfactory performance on their respective datasets, but their approaches are not evaluated to demonstrate if acoustic distortions of noise, distance, and reverberation affect the results",
        "2211.03149_b760f80c690cbcaaef2db0102d64cecc": "As a result, the automatic detection of every-day harmful interpersonal conflicts among people in home environments remains unsolved",
        "2211.03149_3102eccb07a9755e5fc5b3064914402f": "Again, in addition to the realisms such as reverberation, common indoor background noise, and deamplification, the conflict detection model, just as the emotion detection model, needs to deal with the realisms that are the tv sound: the characters on the tv might be in a verbal conflict (as the background sound for the participants whose conflict we want to monitor), which can confound the conflict detection model.",
        "2211.03149_309470075fde2121f75bbca582f83f76": "An Overview of the XYZ System",
        "2211.03149_97a53a96745767903ebf3c7d6493614d": "\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.5\\textwidth]{figures/acoustics.PNG}\n    \\caption{Overview of the XYZ system comprised of four main components: the voice activity detection (VAD) model, the speaker identification (SID) model, the emotion detection model, and the conflict detection model.}\n    \\label{fig:XYZ_acoustic}\n\\end{figure}",
        "2211.03149_c75fc82d6ee53376a60f387fe6d68fc7": "In this section, we describe the XYZ System, which includes the voice activity detection (VAD) algorithm, the speaker identification (SID) algorithm, the emotion detection algorithm, and the conflict detection algorithm",
        "2211.03149_f098283f33cc9ed6d0586e06f7241d99": "Three out of the four algorithms are off-the-shelf",
        "2211.03149_a273b00e1f798ee3afd8df85b7ad3272": "The VAD algorithm is Google's transcription services",
        "2211.03149_d6802760f2fc7110ef0766c0fb987d9c": "The SID algorithm is the WavLM algorithm developed by Microsoft",
        "2211.03149_829aa2e7b9ffa8febd175258495a37d3": "The emotion detection algorithm is developed by SpeechBrain",
        "2211.03149_f280bdbe7322ffca83d95fc53d1294fb": "\\cite{ravanelli2021speechbrain}",
        "2211.03149_9046faffdd2ff86937fb046208a99ba7": "We developed the conflict detection by ourselves, and the reference to the conflict detection paper is left blank to preserve our anonymity",
        "2211.03149_a317ad13e914c5bf03a6cb5c697cf988": "In later sections of this paper, we thoroughly tested the off-the-shelf algorithms to make sure that they meet our needs in the XYZ system",
        "2211.03149_5c9194b3ea3926c9db01846e557787d6": "We also argue in later sections that if there exist algorithms that can satisfy the needs of a system, there is no need to develop those algorithms again by the researchers themselves; time and resources can be spared to develop the algorithms that are needed by the system but not available as off-the-shelf ones (such as our conflict detection model)",
        "2211.03149_39052d399dc087d8c818f7225d2013de": "In other words, there is no need to reinvent the wheel",
        "2211.03149_3b05cc98a8c6ddfa8ea29bd2b53ac830": "In Figure",
        "2211.03149_1eb74e0901826942e8f59aba26a1a99f": ", the microphone placed in a central place in a room constantly listens to the ambient environment",
        "2211.03149_4afe39a84d346878f29c8f19f06307d2": "The audio stream is sliced into 5-second audio clips and send to the voice activity detection (VAD) model to decide if a given clip contains human voice",
        "2211.03149_4f15c58abbc5d7ec0670280d18785580": "The choice of each audio clip being 5-second is based on the observation from previous works that 5-second is long enough to be indicative of the speakers' emotions",
        "2211.03149_e0347d5f94098f8fd764c093ceec1b40": "The XYZ System discards those audio clips that are invalid; i.e., they contain no human voice",
        "2211.03149_13b3d1a027eecdd757dbb858d8cc7e03": "The valid audio clips are sent to the speaker identification (SID) model to detect if the audio clips contain the voice of registered speakers",
        "2211.03149_32e730af57fbde97b71d8979c93575f7": "If yes, they are sent to the emotion detection and conflict detection models, in parallel",
        "2211.03149_c8e2c6f540a5cbad43371ed74a18e647": "The two models each produce vectors in respect to if the speaker(s) in an audio clip is/are angry or is/are in a verbal conflict",
        "2211.03149_46b1fd1c2815312f161d7d73e7b85749": "Note that the purpose of this paper is to demonstrate the necessary steps to be accomplished during the development stage before deployment to increase deployment time success, and show where continued work is still necessary",
        "2211.03149_4ae1892aacce8440b926f5fbee714c8e": "The purpose of this paper is not about how novel the algorithms used in the XYZ System are, although we show that the algorithms are effective at doing their respective jobs and satisfying the research needs.",
        "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369": "The Add-on Components to the XYZ System",
        "2211.03149_6921c21521e737a22be05701a9b27e11": "\\begin{figure}\n    \\centering\n    \\includegraphics[width=0.5\\textwidth]{figures/XYZ-W_overview.png}\n    \\caption{Overview of the XYZ system with \\emph{add-on components}. The add-on components are the Recommender System, the Cloud, and the M2G (Monitor) system.}\n    \\label{fig:XYZ_w_overview}\n\\end{figure}",
        "2211.03149_5bdfc391343000e859af56ff87a104b7": "In this section, we describe three add-on components for the core XYZ system",
        "2211.03149_a3113c6e2697ce02bc64c2c94219105e": "Note that the efficacy and effectiveness of the add-on components are not included in this paper because the main focus of the paper is the XYZ system",
        "2211.03149_502f9d1bd1f9633d954fdf6feb7de517": "The add-on components exist to assist the XYZ system by storing the audio clips classified by the XYZ system (in the cloud), sending the identified anger to the caregiver for them for them to be more attentive to their own emotions, and notifying the developers when the XYZ system crashes",
        "2211.03149_2ed2a36150028b5cbd19f282374d1647": "In addition to those assistive functionalities, one of the add-ons, the Recommender System, recommends tips to the caregivers to help them manage their anger",
        "2211.03149_f0ae116c5744c2feda8b323c2a2cfa70": "The entirety of the XYZ system and its add-ons is referred to as the",
        "2211.03149_9343ce10374bea0e58d9d85440e8fd2d": "An overview of the XYZ-W system is described in Figure",
        "2211.03149_5573cd54f9dab9fc58967d9953cfa9cc": "One of the add-on components is the Recommender System with the EMA",
        "2211.03149_98276f45f1973a59e74cd41574f74728": "Recommender system uses reinforcement learning to decide if a conflict/anger management tip should be sent and what tip to send",
        "2211.03149_073298f48ba2c52dd2e90d002dcaa9ff": "The EMA is a smartphone app developed to send messages to the caregivers",
        "2211.03149_ee2aec818b5b834d9d0a2362887ad602": "Another add-on component, the Cloud keeps track of the raw acoustic signal files, the SID module's detection on the identity of the speaker, the emotion classification module's classification result, the conflict detection module's detection result, and the recommendations and user responses",
        "2211.03149_da87453eb65c756e94f2c67af0dbf60e": "The final add-on component is the M2G System",
        "2211.03149_9f6b9e9bbf341866e416c167d78aef74": "\\cite{ma2017m}",
        "2211.03149_bfd8a014df58e1371f1a60133731d5c5": "that monitors the other three components to make sure that they are alive",
        "2211.03149_4fb9bb887f55a894e18584ad86ac7866": "If one or more of the other three components crash, the M2G system restarts the component(s) and sends the developers an email to announce the crash so the developers can investigate the causes.",
        "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d": "Evaluations",
        "2211.03149_b2da100cf8ee9e9492a72f4291171b94": "Many speech processing works have collected or augmented datasets with real world sounds",
        "2211.03149_af295f0c5603b63476417cab18a7b47e": "Good solutions are usually then developed",
        "2211.03149_6d9cb77f80f08354f3c9e2625abbe969": "But, in many cases the resultant datasets have limited in-the-wild sounds so where they actually work is limited, and many times the solutions are not validated in-the-wild, but only on the datasets",
        "2211.03149_e4091f484104060f178c954d2be8b0e1": "Our pre-deployment strategies are to significantly increase the collected and augmented datasets to increase comprehensiveness of the situations which are modeled, and specialize the datasets to a specific speech module (if needed)",
        "2211.03149_6f87e0253611ddf3886715ce8f42c250": "In pre-deployment, we also choose a set of “best” solutions from the literature and using the comprehensive datasets, determine which ones work",
        "2211.03149_dd7c3d394b8b24e7d9f27e1c5135eb21": "If one or more off-the-shelf solution work, the best one is chosen",
        "2211.03149_28cc6709632b07634a7c46467f3a8574": "Below we show that often many off-the-shelf solutions do not work, but for many common speech tasks there are good solutions available, but it is necessary to verify that",
        "2211.03149_6b497c5aed3a7150fdcb0814cab52b60": "We don’t want to reinvent the wheel",
        "2211.03149_a6ffa00b8eb74b5dd26712de027ff51f": "Then, in post deployment we validate the resulting performance on real data, a step often not performed",
        "2211.03149_2063b507392402c0a9dff9458e4a2c64": "Speech processing is typically performed in a pipeline depending on the overall purpose",
        "2211.03149_69ec0b0d29c1879edfe6626b2e83baba": "In our system we need voice activity detection, speaker identification, emotion detection, and conflict detection",
        "2211.03149_e4bfc11b222bd3f452269138c021887a": "There are commonalities and unique aspects to each of these stages so the pre-deployments strategies must account for them",
        "2211.03149_42c343c46851a3b0d628ccb6c53f9e30": "We now consider each of these 4 stages in more detail",
        "2211.03149_c10c9ac50a2c9526f2015a73f5ca5f28": "Specifically, we briefly reiterate what the components are, why they are important, and demonstrate what we did at pre-deployment time to maximize the deployment time success based on post-deployment data (how we evaluated them at pre-deployment time)",
        "2211.03149_b45c59375b4987e7b1ca471da7d763c9": "In all cases the acoustic solutions had to address the real world complexities such as reverberation, deamplification, and the many types of noise found in real homes over long deployments",
        "2211.03149_6248790b541afc97582366f67cedd077": "The relative success of the acoustic solutions (at the post-deployment time) confirms our hypothesis that it is possible to perform comprehensive and realistic pre-deployment testing to increase post deployment success.",
        "2211.03149_282654775e57b9b14a5dff8d123bf619": "The VAD model filters silence and other sounds that are not produced by the human vocal tract",
        "2211.03149_8920618a9e08ebd153b014c33e10ea05": "Since the acoustic system is constantly listening to the environment, we do not want to activate the emotion and conflict classifiers when an input sound window contains no human speech",
        "2211.03149_5a1c816e82d007cfe28101720ae5ba15": "As a result, the VAD model is an important and necessary component in the XYZ System",
        "2211.03149_67130cfa604590e5a80d642f451fb1a1": "In this Section, we describe testing on the VAD model for the question: Is it possible to perform comprehensive and realistic pre-deployment testing to improve post-deployment success? Note that the acoustic realisms that the VAD model faces are deamplification, reverberation, and (non-speech) background noise, so in our pre-deployment stage assessment we seek to find a VAD solution that is robust against these three types of acoustical realisms.",
        "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd": "Pre-deployment Stage Assessment",
        "2211.03149_746ea368b78c9164bff587d1a0daf954": "During pre-deployment time, we first looked into several state-of-the-art VAD algorithms",
        "2211.03149_663249bf112d82e347cc71db45760300": "In particular, we studied the performance of a set of SOTA VAD algorithms on the Aurora-2 database",
        "2211.03149_ef218691bdcd1d0594bb5755905be191": "\\cite{hirsch2000aurora}",
        "2211.03149_ed64f357adcece910e6d55d4ac774c23": "The performance of the algorithms on the Aurora-2 database is a good indicator of how they might perform in the real world because Aurora-2's speech samples are mixed with noise collected from realistic settings such as streets, airports, and cars",
        "2211.03149_51c45b795d5d18a3e4e0c37e8b20a141": "Table",
        "2211.03149_f4ddb9783a549cf6ba6dcf40d7381a10": "is a list of existing SOTA VAD algorithms' accuracy scores on the testing set of Aurora-2",
        "2211.03149_19cdb018e88ec4f4d9cdfcad01f16bc4": "Unfortunately, as we can see, the highest-performing one is rVAD, which only achieves an accuracy score of 66.23",
        "2211.03149_420a8c8ac940f5597afa75af13e9bfac": ", which is far from being usable in the real world",
        "2211.03149_298422e68eb51950355892948e8f9491": "In other words, there exists solutions in the literature that do not work on datasets with deamplification, reverberation, and background noise",
        "2211.03149_9bece8891324f3761440d7bf9fd559bc": "It is good to discover that these solutions are not likely to work at post-deployment time, because this helps us filter out existing solutions so that we won't use those solutions.",
        "2211.03149_b11ae9fe8045f3b6cc7c4e357890d005": "\\begin{table}[]\n\\centering\n\\begin{tabular}{cc}\n\\toprule\nExisting SOTA VAD         & Accuracy  \\\\\n\\hline\nVQVAD       & 45.66\\%          \\\\\nSohn et al. & 31.21\\%          \\\\\nKaldi Energy VAD    & 11.72\\%       \\\\\nDSR AFE     & 40.07\\%           \\\\\nrVAD        & 66.23\\%           \\\\\n\\bottomrule\n\\\\\n\\end{tabular}\n\\caption{Evaluation of existing VAD algorithms on the Aurora-2 database. This Table is reported by Tan et al. \\cite{tan2020rvad}.}\n\\label{tab:eval_pre_vad}\n\\end{table}",
        "2211.03149_cc4c23e80f5ee1a4f5e9a52b76d2611e": "However, there was another algorithm, the Google Speech Recognition (GSR) algorithm, that had not been evaluated on a dataset that contained the three environmental distortions: reverberation, deamplification, and background noise",
        "2211.03149_48cf9ce8bbc0a76184b686c81f4a6e0c": "As a result, we next evaluated the Google Speech Recognition solution. we aimed to evaluate it in a comprehensive way to demonstrate that it would be robust against environmental distortions such as reverberation, deamplification, and background noise",
        "2211.03149_268cccda1a3e58e53188aae68cd28bab": "Again, this is to set up the necessary condition to prove our hypothesis that a solution, during the pre-deployment stage, must be able to deal with the unique challenges given the real, designated environment in which it will be deployed.",
        "2211.03149_cb5ff623355f7f979605268caf2e3ecc": "To do so, we collected a dataset that contains diverse environmental distortions: first, we collected the clean samples - samples that are not environmentally distorted, by having an individual talk next to the microphone for 5 minutes",
        "2211.03149_e5ca4be0338c766f601a75f4ec85902e": "The 5-minute clip was then sliced into 60 5-second segments, each of which is individually labeled as positive if it contained a human voice, or negative if it did not contain human voices",
        "2211.03149_e0aa646c759dc2a56ebd0c6335dad71a": "Note that the individual took long pauses intentionally to make sure that there were negative samples",
        "2211.03149_e6c8e97d5ad6764dec25c3cce535e062": "Second, we collected the audio clips that were deamplified and contained background noise",
        "2211.03149_d219435f4e08988dd1480c632888ba05": "To do so, we took copies of the clean samples",
        "2211.03149_9e0917a3ab2a5031af1ca3a0cb6a8799": "For each of the copies, we randomly deamplify them by m decibels (0 < m < 12) as per the practice of a previous work on emotion detection",
        "2211.03149_4fe78af9c74075e470a501cbc3e91df3": "Then, we randomly picked household sounds from the household ambience dataset",
        "2211.03149_c4e47a990df4e5f46607d29a8a2582ef": "\\cite{mesaros2016tut}",
        "2211.03149_a117a24a203844cb502d9a741507c3dd": "lists the events that occur in the dataset",
        "2211.03149_004a4113bc01222933c4913835317aca": "Note that each of the ambience sounds is greater than 5 seconds, so we randomly picked a segment from it that was 5-seconds long, and overlaid it with a deamplified clip",
        "2211.03149_6f7ee2a898c660a935581d0940eb58e7": "We repeated this process for all 60 deamplified clips",
        "2211.03149_2e766835749e54ad63669859d49172d0": "Third, we created the data for reverberated speech",
        "2211.03149_8bada236f33df551c1d81c4c0018cd4a": "To do so, we took another set of copies of the clean samples, and overlaid each of them with reverberation that was described by the combination of the three parameters: the wet/dry ratio",
        "2211.03149_89f2e0d2d24bcf44db73aab8fc03252c": "$r$",
        "2211.03149_063bca407a9476d23a54a5996565998b": ", diffusion",
        "2211.03149_2103f85b8b1477f430fc407cad462224": "$d$",
        "2211.03149_fc970aa29365734b247075095a2960b7": ", and decay factor",
        "2211.03149_190083ef7a1625fbc75f243cffb9c96d": "$f$",
        "2211.03149_5cf40fb0804a38b3f268caf94abbcced": "Finally, we created samples that are deamplified, noise-contaminated, and reverberated",
        "2211.03149_de72cae772e42dee5d3df20139c6420d": "To do so, we took a set of copies of the 60 deamplified and noise-contaminated samples, and overlaid them with the same reverberation effect as the samples that only contained reverberation effect and nothing more",
        "2211.03149_a01a17aed12ae4aaceb9b48a1f5bc686": "In the end, we have 60 clean samples, 60 deamplified and noise-contaminated samples, 60 reverberated samples, and 60 samples that had all three environmental distortions",
        "2211.03149_53369a5c76f3c9e2bac41d35d407d9a1": "As a result, we claim that we created a dataset that was comprehensive enough to account for all three kinds of environmental distortions.",
        "2211.03149_07e89554eedb2532a0361b75a363a7e0": "\\begin{table}\n    \\centering\n    \n    \\begin{tabular}{cc}\n    \\toprule\n    Event & Instances\\\\\n    \\midrule\n    (object) rustling & 60 \\\\\n    (object) snapping  & 57 \\\\\n    cupboard & 40 \\\\\n    cutlery & 76\\\\\n    dishes & 151\\\\\n    drawers & 51\\\\\n    glass jingling & 36 \\\\\n    object impact & 250 \\\\\n    people walking & 54 \\\\\n    washing dishes & 84 \\\\\n    water tap running & 47 \\\\\n    \\bottomrule\n\\end{tabular}\n\\caption{Events that are present in the background noise collected from real homes from the dataset \\cite{mesaros2016tut}. All of them are covered in the process of contaminating audio samples with background noise. Note that this list do not include sounds from the tv, which are very important to make sure the robustness of the emotion detection model and conflict detection model.}\n\\label{tab:homenoise}\n\\end{table}",
        "2211.03149_647492e211fe203e8178839136c2fdf2": "We evaluated GSR on the dataset that we just created.",
        "2211.03149_aa2dd34f306295b1f3a1b66fdc99fc03": ", correctly classifying 230 out of the 240 samples each of which accounted for the environmental distortions to a certain degree",
        "2211.03149_323f551c51df88b5ba2299967370a3c5": "The high performance led us to decide to deploy GSR as our VAD model since, during the pre-deployment stage assessment, it is shown to be robust against the challenges that it is about to encounter in the real, designated environment: reverberation, background noise, and deamplification.",
        "2211.03149_20240290611def07a26a5a9a7498a6d7": "Post-deployment Stage Assessment",
        "2211.03149_825effc875d4b39f833614ee4304d1b8": "Using post-deployment data on six completed dyads, we validate how well the chosen solution worked in practice",
        "2211.03149_6cd4a489f18a44fae6afc3a44cc8d358": "shows the evaluation results of the VAD model on the dyads",
        "2211.03149_30a15b6d3c782afa91ebf9d7fd147add": "We randomly select samples generated by each dyad during their deployment, and have human labelers label them if they are of human speech or not",
        "2211.03149_ac56854348bbf1f08195b7685debba5a": "We obtained 100 samples for all the dyads",
        "2211.03149_da2cae1eadd411da045ba173d80d3bc5": "The high performance of the VAD model indicates that this part of our system is highly effective at filtering out non-human speech samples such as background music (without lyrics) and footsteps",
        "2211.03149_a0cf3862574928e832f7e173a9c1cbe1": "It is noted that the VAD does not filter out TV sounds if there is human speech in the sounds, such the voices of actors or news anchors",
        "2211.03149_86f93f55ac5660647dd53af053b59bdb": "These unwanted sounds are filtered by the next model, SID",
        "2211.03149_944b2fea32bb74b23ef07ad61af96c26": "The VAD model achieves an accuracy score of 94.0",
        "2211.03149_a3e2bb13034b29f1b2c6d1832bf71ccf": "to 100",
        "2211.03149_83c8ced0911c0c9b208fabc304901789": "on the six dyads",
        "2211.03149_9d056a4e7459c156331bb2917810ba86": "The high performance on post-deployment data validates our choice of the Google Speech Recognition in the pre-deployment phase",
        "2211.03149_fffcf6ef362e6cb2bf10b396cb2dea56": "This implies that this VAD algorithm was originally made very robust to real world complexities",
        "2211.03149_9f38b97ac3140c4878cae54fd83381bf": "The high performance also indicates that, in order for the deployment to be successful, smart health groups using audio should perform pre-deployment tests with comprehensive real-world distortions",
        "2211.03149_6cfc9f0bbe795c46e74863964b79b3e2": "In addition, the high performance suggests that our hypothesis holds true - recall that our hypothesis is that, during the pre-deployment stage assessment, an about-to-be-deployed algorithm must be proven to overcome the challenges that are perceived to be present in the real, designated environment in order for it to perform well in said environment",
        "2211.03149_1e92991fc8145c8d26fd67c7145c29aa": "The high performance on post-deployment data also indicates that it is sometimes possible to perform comprehensive and realistic pre-deployment testing to improve VAD post-deployment success.",
        "2211.03149_eeb3ba88f7cee432c5c726a3780d3ca5": "\\begin{table}[]\n\\centering\n\\scalebox{0.9}{\n\\begin{tabular}{ccccccc}\n\\toprule\n          & Dyad 1  & Dyad 2  & Dyad 3 & Dyad 4 & Dyad 5 & Dyad 6\\\\\n\\hline\nGSR & 100\\%  & 100\\%   & 94.0\\%    & 95.0\\%  & 100\\%   & 98.0\\% \\\\\n\\bottomrule\n\\\\\n\\end{tabular}}\n\\caption{The evaluation results for the voice activity detection model on the dyads. The high accuracy scores achieved from the dyads indicate that the VAD algorithm (Google Speech Recognition) is highly effective at differentiating non-speech from human speech audio samples.}\n\\label{tab:eval_post_vad}\n\\end{table}",
        "2211.03149_4badaa51a089095989163574f112373d": "Speaker Identification (SID)",
        "2211.03149_3cabfd4f1c41c0996f8821e8e86ec4de": "The SID model determines the identity of a speaker",
        "2211.03149_b6bfcb6148ef8f410f985651c3b6db10": "The SID is a crucial part of the Acoustic System because we only want the voices of the caregiver and patient to be sent to the emotion and conflict detection models",
        "2211.03149_0a3f91f29c461aeb7f37fa7ad9b625fe": "However, in real deployments, voices from the TV and visitors must be filtered out",
        "2211.03149_d356247f675f570e7d733f80d68f5962": "In this Section, we test SID model to answer this question: is it possible to perform comprehensive and realistic pre-deployment testing to improve post-deployment success? Note that the acoustical realisms that the SID faces, in addition to (non-speech) background noise, reverberation, and deamplification, also include sounds from the tv such as the dialogues from tv characters, for the presence of another person's voice in an audio sample could confuse the speaker identification model.",
        "2211.03149_7ef6032c44b96d2bacb95c753f4cfd96": "During pre-deployment time, we investigated a state-of-the-art SID algorithm, the Google Speaker Identification API",
        "2211.03149_c0db8b75b21b5240639978bb71cd3ea1": "However, the API asks us to input the maximum number of speakers there can be in a clip",
        "2211.03149_a3f6c36a1c8088a4c0e75ed824389e95": "This is impractical because a dyad can have the TV on and there could be many people's voices from the TV, or there may be multiple visitors",
        "2211.03149_f7caf462f85fc5453ad6367bd4c33c9e": "It is good to discover that this solution is not likely to work at post-deployment time, because this helps us filter out existing solution(s)",
        "2211.03149_c923ef8086a07a710c70f01062aaba33": "Now we describe how we test to make sure the about-to-be-deployed SID algorithm developed by Microsoft",
        "2211.03149_e3aaf6939e6e1c0ec76739209d6cbec8": "is robust to environmental distortions such as reverberation, background noise, and deamplification",
        "2211.03149_c9891f56e2da41e6b13b6c8039e7e553": "Again, this is to verify our hypothesis that for an algorithm to be successful in the real, designated environment, it must be able to overcome the challenges present in the real, designated environment during the pre-deployment stage",
        "2211.03149_767c099557da4f5c2e607298891cd790": "In our case, the challenges are reverberation, deamplification, non-speech background noise and TV sounds",
        "2211.03149_9a50efdaf191947913badc34cde17a99": "Specifically, we have two persons, P1 and P2, each of whom spoke next to the microphone for 2.5 minutes",
        "2211.03149_1e2791fe05afb6fadd7c12b2a7d5f08f": "Then, for each of their voice files, we sliced it into 28 audio samples",
        "2211.03149_c41958dfb33bd2d269846f2b5aaa07f6": "Because these 56 (28",
        "2211.03149_bdbf342b57819773421273d508dba586": "$\\times$",
        "2211.03149_f3c8070816b6f1e6825c072618326035": "2) samples were collected when the speakers were right next to the microphone, they were considered clean speech, free of the three types of environmental distortions",
        "2211.03149_8674cfa6e1c38a7fcd128c90f7c67b05": "We needed to craft environmentally distorted samples out of the 56 clean samples to ensure that the testing samples accounted for both clean and environmentally distorted samples",
        "2211.03149_2a1fcfd0e3f5304649238a8784cf067e": "To do so, we copy each of the 56 clips and deamplify them by randomly choosing a real number between 0 and 12 decibels",
        "2211.03149_dfe03a4971b9c77bcc85cc96b033e792": "Then, we randomly chose a noise clip from Table",
        "2211.03149_d40436125c19cd3e54e0756fc731ccdc": "as well as TV sounds we recorded using a microphone, out of which we randomly chose a consecutive 5-second segment to be overlaid with one of the copies",
        "2211.03149_ee243f73d0392c1b4009c99ac89166b1": "This guaranteed samples that were deamplified and contaminated with noise, and the last step was to reverberate it",
        "2211.03149_991fbdc9fce3325d228fad11ea77d12b": "Again, the reverberation effect is described by the three parameters: the wet/dry ration",
        "2211.03149_e1daac032faa99e507bb45ebb02299de": ", as per the practice of a previous work",
        "2211.03149_fe78b8c4cf19601262718e2ef2066a55": "\\cite{salekin2017distant}",
        "2211.03149_bc1aebcec98428d5f25efbf0e2e36175": "When we reverberated a (noise-contaminated and deamplified) copy, the values of",
        "2211.03149_c0cb5f0fcf239ab3d9c1fcd31fff1efc": ",",
        "2211.03149_8a0e2b549d223aba55a866c38d1c9275": ", and",
        "2211.03149_42225db6e446515743bfe460f6f029da": "are randomly chosen",
        "2211.03149_6634c6e60f1e126e4b4aa2a48b1a391e": "In total, we had 112 samples, 56 of which belonged to P1 and the other 56 belonged to P2",
        "2211.03149_2abcd130151d440fe446d0008a2aedfe": "We fed the 112 samples to our SID model.",
        "2211.03149_6a0db4521bcc68b7db6211d9afacb2ef": "The high performance of the SID model led us to believe that it was reasonably robust to reverberation, deamplification, background noise, and TV sound.",
        "2211.03149_316fc942cd7726bdb443eba02a63030b": "To validate post-deployment success, from all audio samples that our speaker identification algorithm identifies to contain the voice of the caregiver or the patient, or both, we randomly chose 28 from the first dyad, 28 from the second dyad, and 28 from the third dyad, 100 from the fourth dyad, 80 from the fifth dyad, and 100 from the sixth dyad",
        "2211.03149_4c163453d0916d66d8f43598855c5752": "The results are reported in Table",
        "2211.03149_19091ad9a2b52cfd446736b954061a1f": "In the following sentences we describe how we obtain the f1 scores in Table",
        "2211.03149_606e763825c7fba9ae92d32b507d4783": "For a sample, if it only contains the voice of the caregiver, then it is labeled as belonging to the caregiver; it if only contains the voice of the patient, then it is labeled as belonging to the patient",
        "2211.03149_3d0d75b0200536d3f7da427be572f9d8": "If it contains voices from both the caregiver and patient, then it is labeled as belonging to both",
        "2211.03149_260f268e2e1eb4e5b46303f603f9ad5f": "Otherwise, it labeled as belonging to neither",
        "2211.03149_f0dbee7ae46a2cf4d41e02eb6d48793c": "With this labeling scheme, we obtain the positives and negatives of the caregiver's voice and the positives and negatives of the patient's voice",
        "2211.03149_1c1f0080eb8eb4ac81cf43a979532944": "The SID model can label a sample as belonging to the caregiver, belonging to the patient, or neither",
        "2211.03149_ae24074028e2165d7c55012435220ce5": "As a result, we obtain the results in Table",
        "2211.03149_98431d2350560eb7c4da6199d2a7444e": "in which we report the f1 scores to measure the performance of our SID model for both the caregiver and patient of each dyad",
        "2211.03149_2368610fad42f3446245258f7ea8dd26": "The SID model achieves an f1 score in the range of 93.1",
        "2211.03149_b813f860504089d5211744e6d5ce8c73": "to 97.4",
        "2211.03149_4b43af53a212eda7935ab7bbb0f4e78a": "for the caregivers and 91.6",
        "2211.03149_c2a0b3904e272da842585b1bdae8ed2c": "to 98.3",
        "2211.03149_eddede5a071c28179b74689b964c4947": "on the patients in the six dyads",
        "2211.03149_686c59ffc73254d28b9c16eaa7062862": "The high performance in Table",
        "2211.03149_c204623e2eb9b3bd682bee1be88e2d10": "indicates that our SID algorithm is effective at picking out the voices by the caregiver and the patient in each home in their real home environment",
        "2211.03149_01aa043b59cd4baa42e1025ac2dbb0df": "Given that the SID algorithm was specifically assessed to see if it could overcome the challenges (reverberation, deamplification, and background noise) present in the real, designated environment (homes), we have shown that for an algorithm to be successful in the real, designated environment, it must be able to overcome the challenges present in the real, designated environment during the pre-deployment stage",
        "2211.03149_1f0823b321a7f8a3c1533081f6948c29": "The high performance of the SID during the post-deployment time suggests that our way to perform comprehensive and realistic pre-deployment is effective at improving post-deployment SID success",
        "2211.03149_7600f068a232a7defd967fd58ca3022e": "Note that we only validate the SID solution on the voices of the caregiver and patient of each dyad, because at post-deployment time, the SID solution filtered out voice samples that belonged to neither",
        "2211.03149_eb6868a6fc42e8306785c4ab8f2389b0": "As a result, we only have samples that are labelled by the SID solution as either the caregiver or the patient",
        "2211.03149_49955719e22e93dc5e4add298189612d": "For samples that made through the SID solution, we have the performance reported in Table",
        "2211.03149_84d8298209171837bf0e668735a9ba23": "In Table",
        "2211.03149_2dd54038e9a330d736551a333e2d2f8d": "we report the f1 score of a model",
        "2211.03149_7c4bcf2faf13d3758c10a06337aaad91": "\\cite{lecun1995convolutional}",
        "2211.03149_20519dae101da70ca552516460c0c08a": "that we did not use because at pre-deployment time it achieves bad performance (an f1 score of 79.3",
        "2211.03149_5aaec86265a769aa8fc48aa2af0c6df2": "on P1 and an f1 score of 71.2",
        "2211.03149_cc025564c02ceb7d1818051cb3fcd2a8": "on P2)",
        "2211.03149_823197092fa7d296e722f937be9e9b56": "As we can see, this model also achieves bad performance on the post-deployment data",
        "2211.03149_4937166e0146e812659817c5b322a411": "This indicates that at pre-deployment time, the model that performs badly also performs badly at post-deployment time.",
        "2211.03149_d081c813920f8a4dc3806462be8cfbca": "\\begin{table}[]\n\\centering\n\\scalebox{0.9}{\n\\begin{tabular}{ccccccc}\n\\toprule\n          & Dyad 1  & Dyad 2  & Dyad 3 & Dyad 4 & Dyad 5 & Dyad 6\\\\\n\\hline\nCaregiver & 94.5\\%  & 97.4\\%    &  95.7\\%   & 93.1\\%    & 92.0\\%    & 89.2\\% \\\\\nPatient &   94.6\\%  & 95.9\\%    &  96.0\\%   & 94.6\\%    & 91.6\\%    & 98.3\\% \\\\\n\\bottomrule\n\\\\\n\\end{tabular}}\n\\caption{The evaluation results for the speaker identification model on the dyads. The results are the f1 scores.}\n\\label{tab:eval_sid}\n\\end{table}",
        "2211.03149_45497efe1d7302c3e651f042ff180b0c": "\\begin{table}[]\n\\centering\n\\scalebox{0.9}{\n\\begin{tabular}{ccccccc}\n\\toprule\n          & Dyad 1  & Dyad 2  & Dyad 3 & Dyad 4 & Dyad 5 & Dyad 6\\\\\n\\hline\nCaregiver &   57.1\\% & 71.4\\%    & 83.6\\%   & 52.6\\%    & 44.3\\%    & -\\\\\nPatient &   74.8\\%  & 75.9\\%    &  79.5\\%   & 77.7\\%    & 74.2\\%    & 97.0\\%\\\\\n\\bottomrule\n\\\\\n\\end{tabular}}\n\\caption{The post-deployment evaluation results for a speaker identification model that \\textbf{we did not use} because it achieved bad performance pre-deployment time. As we can observe, its performance on all dyads is bad at post-deployment time.}\n\\label{tab:eval_sid_other}\n\\end{table}",
        "2211.03149_168c0e0f22e82c8c5254c310f3a994cb": "The Emotion Detection Models",
        "2211.03149_505656031a90c51e88dd5e6c2d879906": "The emotion detection model detects the emotion of the speaker in a given audio clip",
        "2211.03149_8346dcfde1ae72af8d7029110b41fccc": "During the pre-deployment study, we looked into the state-of-the-art solutions for emotion detection",
        "2211.03149_23febda724478b32ed6eaae72327d4f5": "shows the performance of several existing state-of-the-art solutions using various datasets of emotional utterances",
        "2211.03149_c0f645528829bb8754745d446fbc85c2": "In this Section, we aim to test the emotion detection model: is it possible to perform comprehensive and realistic pre-deployment testing to improve post-deployment success?",
        "2211.03149_26ea971eb32eb0cb33936c0c7ee832a7": "\\begin{table}\n  \\begin{tabular}{ccccc}\n    \\toprule\n    Work & Dataset(s)  & Accuracy\\\\\n    \\midrule\n\n    Beard et al. \\cite{beard2018multi} & SAVEE, CREMA-D &  41.2\\% \\\\\n    VGG \\cite{simonyan2014very} & EMO-DB & 43.0\\% \\\\\n    Huang et al. \\cite{huang2018stochastic} & RAVDESS, SAVEE &  60.8\\% \\\\\n    Ghaleb et al. \\cite{ghaleb2019multimodal} & RAVDESS & 67.7\\%  \\\\\n    Ghaleb et al. \\cite{ghaleb2019multimodal} & CREMA-D & 74.0\\% \\\\\n    SpeechBrain \\cite{ravanelli2021speechbrain} & IEMOCAP & 78.7\\%\\\\ \n    \n  \\bottomrule\n\\end{tabular}\n\\caption{State-of-the-art emotion detection algorithms on different emotional speech datasets. This Table is adapted from a table in the work \\cite{gao2021emotion}. As we can see, the best performing state-of-the-art algorithm's accuracy is capped at 80\\%. Since SpeechBrain achieves the highest performance, we select it as our emotion detection model.}\n\\label{tab:sota_emotion_detection}\n\\end{table}",
        "2211.03149_757be0bc109e6151a0aa598cd0bcb708": "At first glance, Table",
        "2211.03149_e83528aaf29da9f4cf47a07eb30171b9": "suggests that 4 solutions are not viable, but that SpeechBrain",
        "2211.03149_d709273dfaa52df68b74429b74262784": "is the best candidate among all the state-of-the-art algorithms, given its high performance on the dataset IEMOCAP",
        "2211.03149_6ced65face999e4e780c73e30eaaef9d": "\\cite{busso2008iemocap}",
        "2211.03149_9fe99b50abe1a99dea006b32a9ee1598": "But is it capable of overcoming the challenges (reverberation, deamplification, and background noise) that are present in the real, designated environment (a dyad's home)? To answer that question, we need to look into the dataset IEMOCAP",
        "2211.03149_f40290cffe0846167ae9da65595c1198": ", on which it is evaluated",
        "2211.03149_0a241e60fa0c0d5430f48b278e6a2dbe": "If the dataset has accounted for the challenges, i.e. during the data collection and processing process, the audio samples are touched by the effects of the three challenges, then we conclude that the evaluation result yielded by SpeechBrain indicates that it had overcome the three challenges perceived to be present in the real, designated environment that is a dyad's home",
        "2211.03149_7b3ead98e308307f8ab3d6a1bdfed51f": "The dataset IEMOCAP",
        "2211.03149_bc177c99164f74d8fa677039ccd0de2b": "indicates that the audio clips are collected when there are furniture items in the room, instead of an empty acoustic studio, which suggests that the audio clips in IEMOCAP",
        "2211.03149_4a70b3a7b0c242dd90e789bc609ff5b6": "are touched by the effect of reverberation",
        "2211.03149_8596202df90ba1306110ab1c3fe03643": "The audio clips in IEMOCAP",
        "2211.03149_4015e9ce43edfb0668ddaa973ebc7e87": "are",
        "2211.03149_e83754f557c411f862a4f2898f1386d3": "collected where a speaker is right next to the microphone",
        "2211.03149_a8c1109c4326bc0e001a0a1d35c3905c": "This suggests that the audio clips in IEMOCAP",
        "2211.03149_98c6ef97b826cb7c46b941b47ffbdebb": "are touched by the effect of deamplification",
        "2211.03149_0f05d987be97329d4ce27adef87055cb": "Last but not least, IEMOCAP is not collected in a studio environment and there was no indication that the indoor background noise events such as footsteps were deliberately removed",
        "2211.03149_f7a81b96f7be1b7fc22328c326d94927": "Therefore, this suggests that the audio clips in IEMOCAP are touched by the effect of background noise",
        "2211.03149_0e988832bc6e3f69385b25a83e85f0d8": "Consequently, we conclude that IEMOCAP's audio samples on which SpeechBrain is evaluated on account for the challenges that are perceived to be present in the real, designated environment in which the emotion detection algorithm (SpeechBrain) is to be deployed",
        "2211.03149_61ff614aaae244ad546872623563f156": "Here, we set the stage to prove (once again) the hypothesis that for an algorithm to work well in the real, designated environment in which it is envisioned to be deployed, during pre-deployment stage, it must show that it is capable of handling the challenges that are perceived to arise in the real, designated environment",
        "2211.03149_12525497e50a4dd70d816d776b9bfcf9": "In the meantime, we have observed that algorithms such as Huang et al.",
        "2211.03149_e8be550ec928226cded7289a4bd8daf2": "\\cite{huang2018stochastic}",
        "2211.03149_e4c83dab716f0fa57d1cf2a0b867fb40": "are not likely to work sufficiently at post-deployment time",
        "2211.03149_483f62fe8ec4137c6d67776286d6a3a2": "It is good to discover that these solutions are not likely to work at post-deployment time, because this helps us filter out such existing solutions",
        "2211.03149_ca17b3879421ae3ef33d6d12cc18eaa5": "Note that none of the state-of-the-art approaches in Table",
        "2211.03149_61c7499bfeb80128dbccef24a05681f3": "include TV sounds as one of the acoustical realisms that they need to address",
        "2211.03149_474d02fb4879ec6194175fe882c856b6": "In the future, we plan to develop an emotion detection algorithm that takes TV sounds into consideration.",
        "2211.03149_c6c1d7420dbff034945ef8861cadc399": "In the following paragraphs we describe how we evaluate our emotion detection detection model post-deployment",
        "2211.03149_62c15ed86ccafa60e3b574cacdd25cea": "Out of the audio clips we collected from each dyad, we first select all samples that are classified by the emotion detection model and conflict detection model as anger speech",
        "2211.03149_c1fb6e15238c6daf22a5c316ce610e96": "Then, we randomly select the same number of audio clips from all the samples by that dyad that are not classified as anger speech",
        "2211.03149_a3e0fa219a558e585cd153eb0bdfaf49": "Each of the audio clips is",
        "2211.03149_4ac58ba6cd3055f007708237e8a12866": "based on the emotion in the clip by the labelers",
        "2211.03149_b07966d4476da2dabf462c454943f576": "describes our emotion detection model's performance on the labeled samples: For the 1st dyad, there are 233 samples",
        "2211.03149_0fd56432c12034f57ce00befe28b3dc5": "For the 2nd dyads, there are 392 samples",
        "2211.03149_b2c2dce96eb344f08f825a3b4408ebf3": "For the 3rd dyads, there are 281 samples",
        "2211.03149_bd7451f67db0f8654d8592e1a2e2b522": "For the 4th and 6th dyads, there are 100 samples each",
        "2211.03149_3e4fb5173e8ab30fe21875db0370fa5a": "For the 5th dyads, there are 80 samples",
        "2211.03149_37481a2b472d681697a24c7f08b05d7b": "During the post-deployment stage assessment, researchers should let third-party labellers label the data to obtain ground truth, instead of letting the participants do the labelling, because the participants are not necessarily good at discerning their own emotion (and if they are in a verbal conflict) if they are not trained",
        "2211.03149_c0520d33ad16f9d3a01d097a1286f3c0": "The XYZ system detects if a person is in a verbal conflict or is angry",
        "2211.03149_871b6df63025e2492eb91dcbc800d145": "Initially, we sought to validate our system's performance by survey questions using EMA, similar to many other studies",
        "2211.03149_788fe121c22b3a056cd5486782099df7": "However, we quickly found out that their responses did not always agree with the decision of the system",
        "2211.03149_03889a07ed0106f61329db2f3716d057": "Who was wrong: the caregiver or our machine learning solutions? There is existing literature",
        "2211.03149_c6d0626bc1e7461a948cc17b5626d481": "stating that people not trained to recognize their emotions are often bad at recognizing their own emotions",
        "2211.03149_79252b2985effeef6d4a3ee8266f0932": "To investigate, we employed 5 labellers who are approved by the IRB to listen to and label the saved clips of the participants' voices",
        "2211.03149_f2d593cc1077eeca327abe4806e4639d": "Their labelling suggests that in some cases, the labellers annotation did not agree with the participants' self reported emotional states",
        "2211.03149_0ed1dfba15bdff1644c658fcdefa8cf9": "This data supports the claim that people are often bad at recognizing their emotions",
        "2211.03149_545885cf758de900e56f474490254a6e": "We were able to verify the claim only because we planed, during pre-deployment time, to save all the raw data during the full deployment time",
        "2211.03149_09042ee97b62c5ea85090b88e29a88e6": "We found that post deployment labeling is better than EMA surveys and also supports determination of ground truth which, in turn, provides a better accuracy assessment of the acoustic classifiers",
        "2211.03149_84905c65cf1a640397783000cc68d2ea": "Determining ground truth from deployment time data is very important and often not done in many studies",
        "2211.03149_43da8f05e7d89e83fbf6d39b153843da": "The emotion detection model achieves an f1 score of 85.3",
        "2211.03149_cd69eefc03843f7210e0c316e2b2162f": "According to Table",
        "2211.03149_860fe445fa9cbc5c5028fae147627e81": ", the emotion detection algorithm (SpeechBrain)'s performances in all six homes are satisfactory, highly efficient at identifying the emotions in each clip in each of the six homes",
        "2211.03149_d9bb06c3fd4125ce2825d2228b3050fb": "The success of the emotion detection algorithm demonstrated by Table",
        "2211.03149_5597c64624ab1c32b1ca1de745a45b56": "proves our hypothesis: for an algorithm to be able to work satisfactorily post-deployment in a real, designated environment, it must demonstrate that it is able to overcome the challenges perceived to arise in that environment during pre-deployment time",
        "2211.03149_1fa11f0384ccab53c2a15a4a26e35a48": "The high performance of the emotion detection model at post-deployment time suggests that our way to perform comprehensive and realistic pre-deployment testing is effective at improving post-deployment success",
        "2211.03149_7e493aab1b20105a7a9974e115ca253b": "also includes the performance of VGG",
        "2211.03149_c9f444568c3490853a6ae33d3088c218": "\\cite{simonyan2014very}",
        "2211.03149_6f90c67343bfc4c64c6eea795b0bc225": "which yields bad results (an accuracy score of 43.0",
        "2211.03149_4bc8cdaba328a41a3452daab932e21f0": ") at pre-deployment time",
        "2211.03149_3b4987131488c5d9a39dad81c1c1c05c": "As we can see, the model that achieves bad performance at pre-deployment time also achieves bad performance (an average of an f1 score of 50.1",
        "2211.03149_ce96ce64475d88003b81a20710c10f5e": ").",
        "2211.03149_13ed8bdb6be85187a4a6ad32c6a07d2d": "\\begin{table}[]\n\\centering\n\\scalebox{0.85}{\n\\begin{tabular}{ccccccc}\n\\toprule\n          & Dyad 1  & Dyad 2  & Dyad 3  & Dyad 4 & Dyad 5 & Dyad 6\\\\\n\\hline\nSpeechBrain       & 88.8\\%  & 87.2\\%   & 91.8\\%    & 92.9\\% & 85.3\\%  & 97.4\\%   \\\\\nVGG         & 44.6\\%    & 65.4\\%     & 48.3 \\%  & 45.3\\% & 53.3\\% & 61.5\\%  \\\\\n\\bottomrule\n\\\\\n\\end{tabular}\n}\n\\caption{The post-deployment evaluation results for the emotion detection model (SpeechBrain) as well as the VGG model \\cite{simonyan2014very}, \\textbf{which we did not use} because at pre-deployment time it achieves bad performance with an accuracy score of 43.0\\%. As we can see, it also achieves bad performance on the post-deployment data. The measurement in this Table is f1 score.}\n\\label{tab:eval_emotion}\n\\end{table}",
        "2211.03149_6f6ddb2823d61d513229ded70dc4b2ad": "The Conflict Detection Model",
        "2211.03149_5e4c6b8785e7fc1b423107189451ce38": "For conflict detection, currently, there is no available conflict detection algorithm that is acoustics-based",
        "2211.03149_50b0aaf88bce7baa877554a31677a072": "Therefore, we developed our own conflict detection algorithm",
        "2211.03149_8451afb27bc70db298198742be93d269": "In this Section, we aim to test on the conflict detection model: is it possible to perform comprehensive and realistic pre-deployment testing to improve post-deployment success?",
        "2211.03149_be2915de0b2e9cf2c3ea0f030f5802de": "Here we briefly describe how the new algorithm we developed is trained and why the training process makes it specifically account for the (three) challenges that arise in the real, designated environment in which the algorithm is going to be deployed",
        "2211.03149_b7b1ae46def44ad1befe20aef897a6e5": "The training and testing samples are from 19 couples and each sample is labeled conflict if the content of the sample indicates that the couple are in a verbal conflict",
        "2211.03149_2a24279f7560f5ca65ae6807f0eb732b": "It is labeled non-conflict if the couple are not in a verbal conflict",
        "2211.03149_e0bc20fb8b4b332c9f09fd9e7498eb8d": "Since the samples are already collected from home-environments, de-amplification and reverberation are accounted for, but the samples are free of background noise",
        "2211.03149_2c166860cbc0e3c9c725106e85a2c086": "As a result, we mix each of the samples with background noise by randomly selecting a segment from a randomly chosen indoor background noise sample in Table",
        "2211.03149_8d6ce6aac9f4e4c70c3343043bbde499": "and overlaying that segment with each sample",
        "2211.03149_66c049ea8012399ab68ec222f5ff9b67": "Out of the samples, there are 3,072 in the training set and 1,009 in the testing set",
        "2211.03149_d453bf86676a185285306613198d001b": "As a result, both the training and the testing set accounts for a variety range of indoor environmental distortions",
        "2211.03149_a8b6f34308dfb58e5f924fd35c9acceb": "Since the training samples are touched by deamplification, reverberation, and background noise, our conflict detection algorithm trained on them is designed to be able to handle the three challenges (deamplification, reverberation, and background noise)",
        "2211.03149_da4a2460acca84392f83dcf627ec79bc": "The conflict detection model's performance on the testing set achieves an f1 score of 93.1",
        "2211.03149_ef72f1feb6b7040fd15de740f416c518": "The high performance suggests that the conflict detection is robust against environmental distortions such as reverberation, background noise, and deamplification",
        "2211.03149_59a5d9b45323ea691fac73dca3588ec4": "This help us set the stage to prove our hypothesis that, for an algorithm to work sufficiently in the real, designated environment in which challenges are perceived to be present, the algorithm must show that, during pre-deployment stage, it is able to handle the challenges",
        "2211.03149_353237249ff2cf9253603256dbb24abe": "Our conflict detection algorithm has indicated that during pre-deployment stage, it is able to handle the three challenges: reverberation, deamplification, and background noise",
        "2211.03149_23092680c6256cfc23dd8def5c6129b3": "Note that we do not include TV sounds as one of the acoustic realisms that the conflict detection model needs to address",
        "2211.03149_810b0a1f4b14f8bdc5f6a12d01c514fa": "In the future, we plan to develop a conflict detection algorithm that takes TV sounds into consideration.",
        "2211.03149_f5503cf6a8a2d84c96588b809caf5d99": "\\begin{table}[]\n\\centering\n\\begin{tabular}{ccccccc}\n\\toprule\n          & Dyad 1  & Dyad 2  & Dyad 3 & Dyad 4 & Dyad 5 & Dyad 6\\\\\n\\hline\nOurs       & 63.4\\%    & 65.9\\%    & 70.7\\%  & 86.2\\% & 82.7\\% & 90.1\\%\\\\\n\\bottomrule\n\\\\\n\\end{tabular}\n\\caption{The evaluation results for the conflict detection model. The measurement is f1 score.}\n\\label{tab:eval_conflict}\n\\end{table}",
        "2211.03149_e1e7aa0fd689c1e81855005e081c8a7e": "In the post-deployment time, we seek to prove our hypothesis that, for an algorithm to work well post-deployment time in the real, designated environment in which it is going to be deployed, during pre-deployment stage it must show that it is capable of overcoming the challenges that are present in the real, designated environment",
        "2211.03149_e03b8399d99a5f54b0062afebfce2ffb": "Our conflict detection algorithm has showed that it is capable of overcoming the challenges (it achieves an f1 score of 93.1",
        "2211.03149_4026908ee3966677980fcb914418c2cd": "pre-deployment time)",
        "2211.03149_b6f00b4a8992280318b3d8008133d97a": "However, is it going to work well in the post-deployment time? Table",
        "2211.03149_e0f0ec52ff3c4ddbcdf63712d63228ce": "shows our conflict detection algorithm's performance during the post-deployment time at the six homes",
        "2211.03149_87fe4bfa4ec4dca9ac7879e0d3fd10d7": "Now we explain how we obtain the f1 score results in Table",
        "2211.03149_4b796b838bd2b364be237816b073de79": "If a clip is labeled by the labelers such that it contains verbal conflict and the classifier also thinks this clip contains verbal conflict, then it is a hit",
        "2211.03149_fd0c5d1474bce2abf0fdab79fac7c5e2": "If the clip is labeled by the labelers as not containing verbal conflict and the classifier also thinks that it does not contain verbal conflict, then it is a hit",
        "2211.03149_572d873fc902ea4afb3833c7e6bfd340": "All other cases are misses (for example, the labelers think that a sample contain verbal conflict but the classifier fails to classify it as so)",
        "2211.03149_e59e9021a7e2dcff477e216670adfc29": "By looping through all samples produced by a dyad, we produce an f1 score on that dyad",
        "2211.03149_bad968ec1699e6d92b8c41af332799c9": "From Table",
        "2211.03149_1d6e7abf69f976ad9abc994bdd36f27b": ", we observe that the sixth dyad achieves the best performance with an f1 score of 90.1",
        "2211.03149_a107d3cedcb2ca198bc3b0c8679ca7e5": "while the first dyad achieves the lowest performance with an f1 score of 63.4",
        "2211.03149_386406cc19ed09440c86824d4197cd2d": "For each of the dyads, we observe a drop in performance compared to 93.1",
        "2211.03149_920ff67044089e153d0d66d3da817f33": "obtained when the same model is evaluated on the dataset containing speech samples from the 19 couples",
        "2211.03149_9d55c888ae106e3706b7174d81ec990a": "This indicates that despite our effort in mitigating environmental distortions, the effects of the environmental distortions such as room reverberation, background noise, and the deamplification effect are not fully mitigated",
        "2211.03149_1dbb22894396dacd6b3cc7fa2b48453d": "But the relatively satisfactory performance of the conflict detection model on dyads 4, 5 and 6 indicates that our way to perform comprehensive and realistic pre-deployment testing to improve post-deployment success is effective for exapected conditions",
        "2211.03149_0a3a79be6a7a77e7a88434ac18d732f4": "We also investigate why the performance of the conflict detection model is lower in dyads 1-3 (f1 score of 63.4",
        "2211.03149_63ee40a01ddb81b9f2c1de318105d785": "to 70.7",
        "2211.03149_9371d7a2e3ae86a00aab4771e39d255d": ")",
        "2211.03149_2c78af6096917eb62c9ee1bde1f4eb8d": "Upon communicating with the dyads, we learned that dyad 1 moved the system (which included the microphone) to the hallway which is very far away from the usual places that the participants were speaking",
        "2211.03149_da49e28128f7b636cee9430db8b0b9e9": "Dyad 2 had a construction team rennovating their home, so there was a lot of construction noise to confuse the conflict detection model",
        "2211.03149_b0876eeb6f2c424f04d9a76eb43921e7": "When we developed the conflict detection model, we did not take construction noises into consideration",
        "2211.03149_fb66624eebb28c38071108b56fad055b": "In dyad 3, the caregiver's voice was always very low, almost inaudible, and our conflict detection model was not designed to handle such low-to-inaudible voice samples.",
        "2211.03149_290612199861c31d1036b185b4e69b75": "Summary",
        "2211.03149_792db6809ddc1a5f7511a90fa86d68e8": "In this Section we briefly summarize our findings in Section",
        "2211.03149_65896f1114b014c8fdf59f3b0829a875": "The first finding is that, to ensure post-deployment success of an algorithm, during pre-deployment time it must be rigorously tested on samples that are touched by the challenges that are perceived to be present in the real, designated environment during post-deployment time",
        "2211.03149_ee2c8d4e5e2d56c28bff47548375cc14": "This finding is confirmed by the pre-deployment stage assessment results and post-deployment stage assessment results of the VAD model, the SID model, the emotion detection model, and the conflict detection model.",
        "2211.03149_87ab0e07d0c19424c33e4a6d286e916c": "The second finding is that in the acoustic processing pipeline we should always go for off-the-shelf solutions first before developing your own algorithm",
        "2211.03149_ea2fe70d0e085c4293f63fe5f8cbe42b": "Many acoustic functions have been under study for many years and excellent solutions exist",
        "2211.03149_88ca50949cf807119cbd4fafbc12c196": "Yet, rigorous testing is still required since not all of the available solutions will work for the environment where the system will be deployed",
        "2211.03149_7786bacbf4e130437cd4ef1dcd9cefab": "In our case, the VAD, SID, and emotion detection models are off-the-shelf",
        "2211.03149_35efb2599ef8d0e8d6b2888a9a20f44e": "Since there are no state-of-the-art conflict detection models that",
        "2211.03149_0a581cb22a1968f686f21c000b478693": "to detect verbal conflict, this has to be developed and will not have the luxury of having solutions refined many many researchers over many years",
        "2211.03149_fbc962236eaeb89048daa03fef737adc": "This likely is why the performance is lower than the well developed acoustic functions.",
        "2211.03149_f88aaa2e270520c9cab456cffefae119": "Add-on Components",
        "2211.03149_2e80f62dc90cb7ee8c15ba8d22429264": "Deploying research systems over long time periods requires significant adaptability in many ways",
        "2211.03149_238674f95e1917c099c14004e1414ce2": "Because the user is central, in this section we concentrate on adaptability in regards to the user interface.",
        "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694": "EMA Wording",
        "2211.03149_4d0729429d88257ffc28a70cceed131b": "EMA apps are common interfaces to humans",
        "2211.03149_80a0b97a0f602b9d909bbb7c231e8ccd": "They are used to send messages to the participants and receive responses",
        "2211.03149_969b2094ca75afaa8b4e2fe10d836561": "In our system messages are the interventions or recommendations based on the output of the emotion, conflict detection, and reinforcement learning recommendation modules",
        "2211.03149_f4b1647a3807c91f070b44037a96af96": "During the pre-deployment time, we collaborated with a team of psychologists and specialists from the nursing field and determined four main categories of interventions/recommendations: the breathing exercise, which encourages the participants to take deep breaths to calm down, the timeout exercise, which encourages the participants to take a timeout/break from engaging with their loved one (the dementia patient), the mindfulness exercise, which encourages them to practice mindfulness, and enjoyable activities, which encourage them to partake activities that they enjoy",
        "2211.03149_e7bb85ac6c5949c64391bbd2f71cdf9c": "Each of these categories contains multiple subcategories",
        "2211.03149_17646faf27ea27f35c18b31bd8e43919": "Our implementation allows the exact wordings of the messages to be easily changeable in case during the deployment time the participants preferred different wording.",
        "2211.03149_1a9055eaf7c0d522fecadce4f81b18a8": "Indeed, during the deployment time, we received feedback from the some participants that certain messages seemed insensitive and harsh, and the insensitivity and harshness of the messages actually discouraged them from implementing the recommended interventions",
        "2211.03149_531344f9d2c773d36eaf413624e54ff8": "To fix this problem for these users, we went back to the EMA app and easily changed the wording based on the participants' complaints",
        "2211.03149_e2f51726f6d4c05f04bcd54fe4642494": "After we made the changes to the wording for all participants, they no longer felt the wording as insensitive and harsh, and were encouraged by the messages to implement the interventions.",
        "2211.03149_60178e9bea87234e2bc0bd22a09b20a4": "Personalized Recommendations",
        "2211.03149_6974ab7ea14115378ab9c4b11e2f24ee": "We have previously stated in Section",
        "2211.03149_f676d27f8720dc734d121a2a6cbf094e": "that there are four categories of interventions or recommendations",
        "2211.03149_788146ad4641e840c0acb246f2da27b3": "In this Section, we describe how we make the personalized recommendations adaptable during pre-deployment time and verify if our strategy (that makes the recommendations adaptable) succeeds during post-deployment time.",
        "2211.03149_a8cb9261abc822002a531dea568801d4": "We have also stated that during pre-deployment time we made the EMA app to be easily adjustable in case we need to change the interventions or recommendations",
        "2211.03149_0d77e56ec6d4a3cc80359aac2321e533": "The EMA app is easily adjustable because it reads text questions (such as the list of enjoyable activities for the participants) from a database and to change that list, we just need to go to the database instead of recompiling the app every time we make changes to the list of text surveys and interventions",
        "2211.03149_83ba81df4d80c3a30b000316484fe30e": "The adaptability of the EMA app and, therefore, the XYZ-W system came in handy when we discovered that participants want more specific recommendations, especially under the category of enjoyable activities",
        "2211.03149_868f827f4a385d3ef42378fbf9b1cb0b": "In other words, instead of a generic",
        "2211.03149_c4187b395c91ab764278c328a9114b53": "now it's time to do some enjoyable activities,",
        "2211.03149_71d5cd78a47fe27338202c55ee7fa058": "they wanted the enjoyable activities to be more specific and personalized such as",
        "2211.03149_ba95db6f0cd5de838e08cd692807997d": "now it's time to play with the family cat.",
        "2211.03149_f3b0a7d4d4a7d80c6ab1d2c693bf83a6": "To accommodate this, we asked each participant to provide us a list of their personalized enjoyable activities",
        "2211.03149_ba308cc50968259a5d741aa72ecbd31c": "Because the EMA app was made to be easily adjustable, the integration of the personalized enjoyable activities for each participant was quick and easy.",
        "2211.03149_44608a5559e1c24352d1cd8c64da39e3": "The participants of all six dyads reported that they liked the personalization (we asked them through surveys during our interviews with them)",
        "2211.03149_f6fe43a0100224bbafbb9c2cf34b65b8": "For smart health apps that make recommendations, we feel that it is imperative to be able to change them to accommodate the personal needs of the participants.",
        "2211.03149_6febff8610cf80243dd71a73ddd40d78": "Positive Feedback",
        "2211.03149_c5a4bac02fa47985623efa2dedcb2a36": "Before we deployed our XYZ-W System, we decided to only send out at the end of the day post-recommendation surveys that asked the participants if they had implemented the recommendations",
        "2211.03149_2d17ba9020e94deea3be9279e41b4080": "Then, we received requests from the participants that they would like some positive feedback after they implemented the recommendations",
        "2211.03149_c838e29e573b1fa163857afe6b3dd522": "The positive feedback should acknowledge the effort they put in to adhering to the recommendations and remind them of the importance of implementing the recommendations (to improve their mental health and lessen their care-giving burden)",
        "2211.03149_ec6c616af956aed7fea93e2269808da3": "Again, because the EMA app was designed at pre-deployment time to be easily changed, integrating the feature of positive feedback into the existing system was quick and easy",
        "2211.03149_c6ea76674071e2c6e054a8afd9cc6af0": "The participants of all six dyads reported to have liked the positive feedback.",
        "2211.03149_be3859755b496872fe346f333be86fd4": "The main takeaway message in Section",
        "2211.03149_53eb4db79f7d3c3a2e94b3ef28f7ebc4": "is that researchers need to anticipate the need of the participants and make sure that their technology (in our case, the add-on components to the XYZ System), is adaptable to those needs",
        "2211.03149_2ad6b880a695bcec5d9ffd5a70be3091": "For example, we initially set the positive feedback times to be in the morning and in the evening, but participants report that they want the positive feedback more often",
        "2211.03149_a02a791b4ef80748bc2e92de9c122c12": "Since we have anticipated that they might have the need (to want to see the positive feedback more often), we have designed our add-on components in such a way that allows the change to be easily made.",
        "2211.03149_c2b3f016333a762c02e0e945b61362b6": "Privacy Concerns",
        "2211.03149_c48de9b1b81a344dd1df56c82c2dc49f": "Developing new research systems that will be deployed in homes require solutions for privacy issues during recruitment and during deployment",
        "2211.03149_eb2938a104c19736673634dc61bd2c07": "This is especially true when using sensing that can be considered invasive such a microphones",
        "2211.03149_4ef28e01c141faaef7cadaa53dbff281": "Our XYZ system is privacy-conserving, meaning that it concentrates on allowing users to benefit from its functionalities without releasing their voice data in its original form.",
        "2211.03149_a9735710b29bc08d674fac043b1e64b9": "Pre-deployment Stage Preparation",
        "2211.03149_70023937d14cf4196a1ca9ec82bc5fee": "During pre-deployment a set of privacy mechanisms were implemented",
        "2211.03149_54bbc95f033423cf0ae6df0cd2e9df88": "This included that users could set the day start and end times when the system is operational, turn off the system at any point, e.g., when a visitor was there, all voice from non-registered speakers would not be recorded, and that the content of speech would not be recorded, i.e., only prosidy features would be recorded",
        "2211.03149_80cf621dd9894bc570a67546c075c794": "During recruitment, the above privacy mechanisms were fully described to potential dyads",
        "2211.03149_34592364260628acfadc3c0c9544c464": "Also, using a graph and tables we showed them what prosidy means",
        "2211.03149_6b6032a5101fc4434a499287f8550c6f": "Nevertheless, one in four care-giving dyads who rejected participation in the study worried about the privacy issue despite the thorough explanation of the study procedures",
        "2211.03149_0faf3ea923db147eaa595d153ffaae01": "Basically, once we explained that our system listens to them for anger/conflict events, it caused some of the prospective dyads to think about privacy invasion and they declined to participate in the study",
        "2211.03149_e2254473470318da5324f19696957e52": "Overall, Table",
        "2211.03149_a363d4f2d56b54a48fe0aff5fbababab": "describes the reasons that potential participants did not choose to participate in our study: 3 potential participants did not meet the criteria to be included in our study. 15 potential participants lost interest in participating and did not reply to our call for screening that they must pass in order to be included in our study. 12 potential participants decided upfront with us during our communication with them that they were not interested. 10 potential participants found the study to likely be burdensome. 2 potential participants in our follow-up calls with them indicated that they are no longer interested in the study. 9 potential participants were no longer interested to participate due to various issues such as the patient passing away. 17 potential participants refused to participate out of the concern for privacy issues",
        "2211.03149_cccf3e66d23ee0e3f4cac46a7f3afea2": "Privacy is the main reason for 25",
        "2211.03149_1d5ec651601e431186fe15adfe5f9a50": "of those interviewed (the largest percentage among all categories of the reasons to not participate)",
        "2211.03149_21b28eb4220917af837bcbafdbcc24d7": "It can be expected that when deploying sensing systems in homes some people will reject the system",
        "2211.03149_a857690e73ca0cb7d30d94707bc516d4": "With enough privacy mechanisms we were able to limit those not willing to participate due to privacy to 25",
        "2211.03149_2de50d7fa88ec70283190a397c435c70": "\\begin{table}[]\n\\centering\n\\begin{tabular}{cc}\n\\toprule\n  Reason for Rejection & Number(\\%) \\\\\n\\hline\nDid not meet inclusion criteria &\t3 (4.41\\%) \\\\\nDidn't reply to call for screening &\t15 (22.06\\%) \\\\\nNot interested &\t12 (17.65\\%) \\\\\nBurdensome &\t10 (14.71\\%) \\\\\nNo longer wanted to participate &\t2 (2.94\\%) \\\\\nOther &\t9 (13.23\\%) \\\\\n\\textbf{Worried about privacy issue} &\t\\textbf{17 (25.00\\%)} \\\\\n\\hline\nTotal &\t68 (100\\%) \\\\\n\n%Amazon Transcription & 100\\% &  100\\% & 100\\%\\\\\n\\bottomrule\n\\\\\n\\end{tabular}\n\\caption{The reasons that potential participants did not join our study. 25\\% of the potential participants refused to participate in our study because they were worried about privacy since our system would be listening to their conversation.}\n\\label{tab:human_behavior_privacy_recruitment}\n\\end{table}",
        "2211.03149_a38576ed1cbc1c9aa1f9d510ad4a83d4": "Using a survey after the 4 month study, five out of six of the recruited dyads agreed that their privacy concerns are addressed and they have had no issue regarding privacy",
        "2211.03149_463174acca015d7ad651592d35f543d4": "However, one dyad still has some concerns over their privacy",
        "2211.03149_2db48ded00905d5c74385bc7f0850e85": "In this home, the Alzheimers' patient (not the caregiver) pulled out the wires that connect our equipment to the power source, for he feared that during the time the system is set to not monitor them, the system is still actively listening.",
        "2211.03149_bde980419c938659e8d98cd2b7608460": "We countered this distrust our system by showing these participants the data we collected: namely, we showed them the timestamps of the voice samples that we collected so they knew that outside of the active hours of the system that we were true to our word and the system did not listen to them",
        "2211.03149_200e0a3cd976dbfb6e1a0ece954783d7": "We also showed them amplitude plots of the data we collected where there are no words",
        "2211.03149_654e10dd70697f20827907b9cf159123": "We also showed them that there did not exist files which recorded the transcriptions of their conversation, since some concerns had been raised such that the participants were worried about being transcribed.",
        "2211.03149_b012480db878c626bab3a032c819347c": "Privacy concerns are likely to arise when researchers deploy their technology in the home environments",
        "2211.03149_c8013a330e38f3c537a2967f18609b8a": "During the pre-deployment stage, researchers must implement privacy mechanisms even if they are not the core purpose of the system",
        "2211.03149_f106715e62b9871eecdb1550bd961645": "These mechanisms must be explained to participants",
        "2211.03149_83f441ee1101cb8d19866d6cd935adcc": "We believe that the mechanisms we describe can be used in many systems that utilize speech of the participants.",
        "2211.03149_c043c2ebb76106aca481045501b48a0c": "Finally, the responses from the dyads at post-deployment time provide some evidence that privacy can be addressed to users' satisfaction.",
        "2211.03149_6f8b794f3246b0c1e1780bb4d4d5dc53": "Conclusion",
        "2211.03149_d4bc2d5e07d04558faee07b9772bfe7b": "As research projects (not pilot studies), smart health groups often design novel smart technologies to be deployed in people's homes",
        "2211.03149_cf91d958f32aa715c0bda4d93bcfe020": "However, the integration of novel smart technology from the less complex lab environments to the more complex real environments poses many challenges",
        "2211.03149_abf1bb43c59324948c4af9a9d873ee8f": "In this paper, using the XYZ system as a case study, we present and evaluate various techniques for acoustic pipelines, adaptability of the user interface, and privacy that increase deployment time success."
    },
    "hierarchy": {
        "1": {
            "2211.03149_f3bd149c3bb7de5b90d06bec6fea1fa1": "2211.03149_428e7c60b664f5008fd0e35c6c9856c4",
            "2211.03149_e353dbe42c8654f33588d4da0b517469": "2211.03149_428e7c60b664f5008fd0e35c6c9856c4",
            "2211.03149_6becf3bc1e086db713f0563ffafb159a": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_6b61dd4b98212bb6ebb4d768ad258684": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_a28ee31c4cc86f1e6335cea134f65a06": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_43df5361aa822a905743f73b78a38df9": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_1f12b97780cd8c0c81a53d0c1bc52bf5": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_6d164e49cb2abd23c892be6cb114a8e7": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_2e5a906330c74225acf50874e8526b78": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_4d1ff06d177eab6d4ac5251c528b464e": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_40b00e89a432e0f588c62995647616ee": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_b7e03030fe69906c1d2c27885e334e23": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_0fad25b8fb1bf316eba9f084f7a5ea9f": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_9f78c5a9c51ab57a6fe6167d72b8d625": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_d5d31fd7feb337ede9af76b418926fda": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_729f8ff38b50aeac7f5ba4ad4f6c0c21": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_0b79795d3efc95b9976c7c5b933afce2": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_96407e4146d721ac08816207469c7c17": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_9a62a7c9f219699215fd7cffadf44074": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_70f268310ad1fe7b13f96818ffffc811": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_f492c23048ffde2ad611ca158b49a498": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_d73a5589701ba9c7c4947fad907de475": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_61f72a3c680dd4df68ac9cac3c1b236d": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_eff926391288d7c345d7ceb4719969a7": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_b03f6e0bca33dc5a6bb7dd77ced8395f": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_9d5d749d687fcefb34f5329383ee2e02": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_ff10e3062b4ef45a82ecd105dd6f0092": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_1c5aa20afad447ad38eeb27b7ee9562e": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_2adfbaf235b22f2bc665867764551b3f": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_4103347e1ca36426383910100b958c47": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_fd9485fd667b7c6e6482df6dee6f9688": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_ef60fc45da8e9351496c1d3bdb58f5ab": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_5058f1af8388633f609cadb75a75dc9d": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_460b5811ca540df898a8f5791a74d121": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_ec2414225f4af6515af730209fd04dcf": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_76a62247c115ca97f9fce380beb6b732": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_8b1b426dae08bb57c122fd54ac6774b0": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_312abdfeb21c9ef907a9b38a506e8404": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_75c4c5cb8684a87d292368746cfd03c3": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_932cb934cd1150619448c454cd61a691": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_18307568137a7106a4c1e6c8b7ff5d2e": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_d63bc1e5640e38ba9a785e0b9dfa145f": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_138bc1609938a56e6455896b5dc5f03f": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_5a022b692ecc21336dcefb197fc0bff5": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_2a1705d715868e84a4f6316f37ab3e30": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_4824fcdeb3e9ad7075480ea46174195c": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_995f0042310d9b3d67279849af591f4d": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_bfa5c832480ba410a72b3bd64b170d5a": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_0bd26a56175b60375385569cfd9825ca": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_0e254caf8bad34adf30091c19dcaddb9": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_0d3f75555409e4b65cd57b5b65e08b33": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_b0c70c88bf2db037621f5d5bb66b6938": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_b41ffd0650855d3c9cab3c6d573a04eb": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_a0d539310a5f143ba04aa5deae18a440": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_4e690252b814e074d25df789f6746cf9": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_cbf51c80867b35b9de952f11897393c3": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_8634a4364d355f8ccf2d146fbcc5cf07": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_5dd14dcbd3b7d468ea03cdf76a9545cd": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_843d40ae62bb38274abd32346ac3dad9": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_34e667137a9c40e68a16b4a0a8cd4910": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_505c7e0b72771373f04ab1ae9685dd21": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_5bf7a48ef9ae7f52a7dc04e2654aa47d": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_cac6235e8f2889f915d2151afcf293f5": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_6cfb7e2dacd3e8cc53c21b2830e74f70": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_a8f65dd93445b90d34246cc201862695": "2211.03149_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03149_7d74f3b92b19da5e606d737d339a9679": "2211.03149_a8f65dd93445b90d34246cc201862695",
            "2211.03149_2fb4f4c076e5231260e10fdd316ddeb0": "2211.03149_7d74f3b92b19da5e606d737d339a9679",
            "2211.03149_27ef7f0f05856c0b6e2550b1fdd9a68e": "2211.03149_7d74f3b92b19da5e606d737d339a9679",
            "2211.03149_c7acc2736c73467c087605269d7bb73e": "2211.03149_7d74f3b92b19da5e606d737d339a9679",
            "2211.03149_90d929d894c49ccfd2cefb5eee4c5f69": "2211.03149_7d74f3b92b19da5e606d737d339a9679",
            "2211.03149_a7f204812a4ab08c2f566ec19b4abab8": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_b7e8977a5368d94f458708a5693d8543": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_641548ce65546ae625d265a714a07523": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_c6a50c360fa182ae652826ca53e54ea1": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_055e213968694667190897c7b3d07ec5": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_f7a7237be6426a53b250f73fd342a693": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_ccb29382ad9e1ba496b3b1da0db8bb03": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_ae6fa5f4cf9cc5292cc34e9d96af4f80": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_28464c80630fe3b9c4cfa9c23e4fa39c": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_1bd5519b48a6401d6f2aacbe620a58e0": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_96ea2dc1a0812eb70860256d86c81530": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_83c7bbfba6ad0be3bd374fcb6d496678": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_7b553dffb33756cad24b1bc0199c0ce4": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_0260cc1e7bc637aa842f7a13453a00f0": "2211.03149_c6a50c360fa182ae652826ca53e54ea1",
            "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_be681c8b3db0878332f47682e446fcfb": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_fa750b7f27d9a87f9ba97d1eaf5da46b": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_97d8dfe5a8f5d72111e93a7d6c957933": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_83ea1048c25caa3a726f7d3bcd4c10bf": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_3797d3dd637161f2062f4402f25ea2aa": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_7121f21addf0f7857df5169159c14d54": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_7789b4e0bff323e305e3790573719e8b": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_18e09f206943055bd1d0719effaccfff": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_11e0eb38ef85163b34d359561649765f": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_b01f3bd054549fd8248e6e113fc3fb88": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_511af8043f7d66af54c3b7d245e64106": "2211.03149_e6d2c5d28e2df05199ea16e97bdc24b6",
            "2211.03149_99975fe953f1aa9b4cf801fa116f810e": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_c2b10d5c465ad21982c3bbb82f8d9883": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_ed7567d90c2d4dd5338e4f5eac5b761c": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_9f86b0c0fe82da2e8065f01a127544bd": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_53b5cde6e952e6067baeb2d7f75153f2": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_0d09f1102592e1e5ee3beade5cbdcd38": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_67231162ba69eb6bc3e62936662f9c68": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_972f48574b82274ed65affc07f06b51d": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_3d83f35322a5062920d1e6d92ec850a5": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_1212865afe92b84493c2e2951ff2c889": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_360bccc96d869ea64d8507f18a4b8762": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_afd198218b3bdf1cfa750ad4bba098d0": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_9699f4161d8baf8cb77d32556de331f7": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_3001b53df2f45419bfd6aed118cbe98e": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_d5177820c5a2f82ba3bad8f722b64752": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_9c4391f8772027760decb9ddf392f2fa": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_d4cab91b3b8b916591aed9affe7cefa6": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_9914e956be512b43d841d20adc335f76": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_def65e449eaa5e1345d487f8c842bb31": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_fa9c556a295d17600cbf032cacf8fc54": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_61bc75e4434240c5690e6316d88e5fa4": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_68ea76bd67df967865008df720ab8ac7": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_ba041df90364097ca781aa845f0ada2c": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_0fa791221683f01bccebddbb56191e4e": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_cea3866e109cd52fd4c58107d003b03f": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_2cf577d6a51a988af209bd9790dee44b": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_5b4bad4bc35174eb11f336f837d5f698": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_207649d9171f1b7bcd8549f0f4c41449": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_4124afd7d781422c99a3c1d16a17b1ad": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_b75d7ce3960f7b19b3ae946712f5f9ba": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_3725aaa57535830f807fefe1db84e167": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_ae43cebc517155a542a1bdf22344a2b9": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_f6cc7caf3ef3f462d26c32c9c96777a4": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_e36985b2fc742895f80d9537bc03d417": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_eedf6b875d99beafa67a1de777fea88d": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_c32ec3438833531188ba5d0b6f78b5f3": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_d4c665091913d2f401fc1c23c3e5c99a": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_83e739a7da0c6206196789b70b3738d4": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_86b7a6978be279a3f641dd9b5ffc7f0b": "2211.03149_8a5b357a1dbe7aaa6be4842b9f90a85f",
            "2211.03149_b76b247889a9ea90211ec423d6161532": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_c75fef9c47c46a022b8c99151cdf5df7": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_256df5fb8b2b6d3beca6ebcd96b86ec0": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_acdd0c16c901f1725b2b77ce31cb4f23": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_331c8b1c328410e1e8062945cb7081ef": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_e62ecba6ec7e16614506ed66fbb1ff68": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_f9c8e1de7acc915e183d6521814ab480": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_d4cc482ae9b5dc6393c4e183aa1d8321": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_98379fcf1df04b89751dd25e2f44e510": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_12168dad6f6c524c9bd56b44ddaa02b5": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_95c6bee5d6bdf947de5cda79b8411a01": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_130f5df5da248d8484cb8aa308ca149d": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_662fba80ced12bca3becb5cafff1ff43": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_7ed67ecbf76d4a22fe7d565ef6b60211": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_99c180106a979f499a36fe35e0520f20": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_5de04e3b0e9d09c0c7f35946757a3560": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_d23bf5e466a532bec03c7aadcd50058d": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_1fcf4a2238549386fb710a499f3458a5": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_48e02e4c2ac4db7999ee6b259621b96f": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_f5b2ab85a6917c820892a3b6de3de214": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_b64a53d8eedd55ec42dafbece939a6c3": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_7be6e681b7cc4658e818f950e08b04a7": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_def6c1d6b73fbcadd59330f827d13e14": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_1f621190263a9f5aaefaacb1e88f9b05": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_590b5f60e789fb3eb5a031dfffbb5750": "2211.03149_b76b247889a9ea90211ec423d6161532",
            "2211.03149_f6655941c8b7f1b64866c108d6780457": "2211.03149_a7f204812a4ab08c2f566ec19b4abab8",
            "2211.03149_55dd2b1fdf10cf1ddd41562718dc8e5a": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_026c89c143f20d27ddf4248bff7c9c34": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_b805b19e03b33d83044810661e50d372": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_ff6aeea40c797b1f680f4f724df3afa5": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_29214b65390f9f86fe66000eece45af5": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_0d5c3d245730f83ab955749942ebf5cf": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_32cacacc4e5fb943be8ca25e39b3d95f": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_979c84bebc6adc2a779b73e4cc1208b4": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_b0ab18c1263411dac151629477563484": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_537a1039d49cec23b4b62710b3c77095": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_aef8e1bc3328f2da6edba3171685c35e": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_f7a167b0777e6f7f182f635280d81b01": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_3375b5b9b3511c63bdc9d81ddea939a6": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_b760f80c690cbcaaef2db0102d64cecc": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_3102eccb07a9755e5fc5b3064914402f": "2211.03149_f6655941c8b7f1b64866c108d6780457",
            "2211.03149_309470075fde2121f75bbca582f83f76": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_97a53a96745767903ebf3c7d6493614d": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_c75fc82d6ee53376a60f387fe6d68fc7": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_f098283f33cc9ed6d0586e06f7241d99": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_a273b00e1f798ee3afd8df85b7ad3272": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_d6802760f2fc7110ef0766c0fb987d9c": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_829aa2e7b9ffa8febd175258495a37d3": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_f280bdbe7322ffca83d95fc53d1294fb": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_9046faffdd2ff86937fb046208a99ba7": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_a317ad13e914c5bf03a6cb5c697cf988": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_5c9194b3ea3926c9db01846e557787d6": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_39052d399dc087d8c818f7225d2013de": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_3b05cc98a8c6ddfa8ea29bd2b53ac830": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_1eb74e0901826942e8f59aba26a1a99f": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_4afe39a84d346878f29c8f19f06307d2": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_4f15c58abbc5d7ec0670280d18785580": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_e0347d5f94098f8fd764c093ceec1b40": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_13b3d1a027eecdd757dbb858d8cc7e03": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_32e730af57fbde97b71d8979c93575f7": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_c8e2c6f540a5cbad43371ed74a18e647": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_46b1fd1c2815312f161d7d73e7b85749": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_4ae1892aacce8440b926f5fbee714c8e": "2211.03149_309470075fde2121f75bbca582f83f76",
            "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_6921c21521e737a22be05701a9b27e11": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_5bdfc391343000e859af56ff87a104b7": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_a3113c6e2697ce02bc64c2c94219105e": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_502f9d1bd1f9633d954fdf6feb7de517": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_2ed2a36150028b5cbd19f282374d1647": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_f0ae116c5744c2feda8b323c2a2cfa70": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_9343ce10374bea0e58d9d85440e8fd2d": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_5573cd54f9dab9fc58967d9953cfa9cc": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_98276f45f1973a59e74cd41574f74728": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_073298f48ba2c52dd2e90d002dcaa9ff": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_ee2aec818b5b834d9d0a2362887ad602": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_da87453eb65c756e94f2c67af0dbf60e": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_9f6b9e9bbf341866e416c167d78aef74": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_bfd8a014df58e1371f1a60133731d5c5": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_4fb9bb887f55a894e18584ad86ac7866": "2211.03149_c3ae0df0ab9842eb3a1a053ddeae7369",
            "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_b2da100cf8ee9e9492a72f4291171b94": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_af295f0c5603b63476417cab18a7b47e": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_6d9cb77f80f08354f3c9e2625abbe969": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_e4091f484104060f178c954d2be8b0e1": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_6f87e0253611ddf3886715ce8f42c250": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_dd7c3d394b8b24e7d9f27e1c5135eb21": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_28cc6709632b07634a7c46467f3a8574": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_6b497c5aed3a7150fdcb0814cab52b60": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_a6ffa00b8eb74b5dd26712de027ff51f": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_2063b507392402c0a9dff9458e4a2c64": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_69ec0b0d29c1879edfe6626b2e83baba": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_e4bfc11b222bd3f452269138c021887a": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_42c343c46851a3b0d628ccb6c53f9e30": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_c10c9ac50a2c9526f2015a73f5ca5f28": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_b45c59375b4987e7b1ca471da7d763c9": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_6248790b541afc97582366f67cedd077": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_282654775e57b9b14a5dff8d123bf619": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_8920618a9e08ebd153b014c33e10ea05": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_5a1c816e82d007cfe28101720ae5ba15": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_67130cfa604590e5a80d642f451fb1a1": "2211.03149_99975fe953f1aa9b4cf801fa116f810e",
            "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd": "2211.03149_6f6ddb2823d61d513229ded70dc4b2ad",
            "2211.03149_746ea368b78c9164bff587d1a0daf954": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_663249bf112d82e347cc71db45760300": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_ef218691bdcd1d0594bb5755905be191": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_ed64f357adcece910e6d55d4ac774c23": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_51c45b795d5d18a3e4e0c37e8b20a141": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_f4ddb9783a549cf6ba6dcf40d7381a10": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_19cdb018e88ec4f4d9cdfcad01f16bc4": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_420a8c8ac940f5597afa75af13e9bfac": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_298422e68eb51950355892948e8f9491": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_9bece8891324f3761440d7bf9fd559bc": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_b11ae9fe8045f3b6cc7c4e357890d005": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_cc4c23e80f5ee1a4f5e9a52b76d2611e": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_48cf9ce8bbc0a76184b686c81f4a6e0c": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_268cccda1a3e58e53188aae68cd28bab": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_cb5ff623355f7f979605268caf2e3ecc": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e5ca4be0338c766f601a75f4ec85902e": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e0aa646c759dc2a56ebd0c6335dad71a": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e6c8e97d5ad6764dec25c3cce535e062": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_d219435f4e08988dd1480c632888ba05": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_9e0917a3ab2a5031af1ca3a0cb6a8799": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_4fe78af9c74075e470a501cbc3e91df3": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c4e47a990df4e5f46607d29a8a2582ef": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_a117a24a203844cb502d9a741507c3dd": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_004a4113bc01222933c4913835317aca": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_6f7ee2a898c660a935581d0940eb58e7": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_2e766835749e54ad63669859d49172d0": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_8bada236f33df551c1d81c4c0018cd4a": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_89f2e0d2d24bcf44db73aab8fc03252c": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_063bca407a9476d23a54a5996565998b": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_2103f85b8b1477f430fc407cad462224": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_fc970aa29365734b247075095a2960b7": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_190083ef7a1625fbc75f243cffb9c96d": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_5cf40fb0804a38b3f268caf94abbcced": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_de72cae772e42dee5d3df20139c6420d": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_a01a17aed12ae4aaceb9b48a1f5bc686": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_53369a5c76f3c9e2bac41d35d407d9a1": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_07e89554eedb2532a0361b75a363a7e0": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_647492e211fe203e8178839136c2fdf2": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_aa2dd34f306295b1f3a1b66fdc99fc03": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_323f551c51df88b5ba2299967370a3c5": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_20240290611def07a26a5a9a7498a6d7": "2211.03149_c2b3f016333a762c02e0e945b61362b6",
            "2211.03149_825effc875d4b39f833614ee4304d1b8": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_6cd4a489f18a44fae6afc3a44cc8d358": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_30a15b6d3c782afa91ebf9d7fd147add": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_ac56854348bbf1f08195b7685debba5a": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_da2cae1eadd411da045ba173d80d3bc5": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_a0cf3862574928e832f7e173a9c1cbe1": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_86f93f55ac5660647dd53af053b59bdb": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_944b2fea32bb74b23ef07ad61af96c26": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_a3e2bb13034b29f1b2c6d1832bf71ccf": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_83c8ced0911c0c9b208fabc304901789": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_9d056a4e7459c156331bb2917810ba86": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_fffcf6ef362e6cb2bf10b396cb2dea56": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_9f38b97ac3140c4878cae54fd83381bf": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_6cfc9f0bbe795c46e74863964b79b3e2": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_1e92991fc8145c8d26fd67c7145c29aa": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_eeb3ba88f7cee432c5c726a3780d3ca5": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4badaa51a089095989163574f112373d": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_3cabfd4f1c41c0996f8821e8e86ec4de": "2211.03149_4badaa51a089095989163574f112373d",
            "2211.03149_b6bfcb6148ef8f410f985651c3b6db10": "2211.03149_4badaa51a089095989163574f112373d",
            "2211.03149_0a3f91f29c461aeb7f37fa7ad9b625fe": "2211.03149_4badaa51a089095989163574f112373d",
            "2211.03149_d356247f675f570e7d733f80d68f5962": "2211.03149_4badaa51a089095989163574f112373d",
            "2211.03149_7ef6032c44b96d2bacb95c753f4cfd96": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c0db8b75b21b5240639978bb71cd3ea1": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_a3f6c36a1c8088a4c0e75ed824389e95": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_f7caf462f85fc5453ad6367bd4c33c9e": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c923ef8086a07a710c70f01062aaba33": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e3aaf6939e6e1c0ec76739209d6cbec8": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c9891f56e2da41e6b13b6c8039e7e553": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_767c099557da4f5c2e607298891cd790": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_9a50efdaf191947913badc34cde17a99": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_1e2791fe05afb6fadd7c12b2a7d5f08f": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c41958dfb33bd2d269846f2b5aaa07f6": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_bdbf342b57819773421273d508dba586": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_f3c8070816b6f1e6825c072618326035": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_8674cfa6e1c38a7fcd128c90f7c67b05": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_2a1fcfd0e3f5304649238a8784cf067e": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_dfe03a4971b9c77bcc85cc96b033e792": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_d40436125c19cd3e54e0756fc731ccdc": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_ee243f73d0392c1b4009c99ac89166b1": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_991fbdc9fce3325d228fad11ea77d12b": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e1daac032faa99e507bb45ebb02299de": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_fe78b8c4cf19601262718e2ef2066a55": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_bc1aebcec98428d5f25efbf0e2e36175": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c0cb5f0fcf239ab3d9c1fcd31fff1efc": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_8a0e2b549d223aba55a866c38d1c9275": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_42225db6e446515743bfe460f6f029da": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_6634c6e60f1e126e4b4aa2a48b1a391e": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_2abcd130151d440fe446d0008a2aedfe": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_6a0db4521bcc68b7db6211d9afacb2ef": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_316fc942cd7726bdb443eba02a63030b": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4c163453d0916d66d8f43598855c5752": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_19091ad9a2b52cfd446736b954061a1f": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_606e763825c7fba9ae92d32b507d4783": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_3d0d75b0200536d3f7da427be572f9d8": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_260f268e2e1eb4e5b46303f603f9ad5f": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_f0dbee7ae46a2cf4d41e02eb6d48793c": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_1c1f0080eb8eb4ac81cf43a979532944": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_ae24074028e2165d7c55012435220ce5": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_98431d2350560eb7c4da6199d2a7444e": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_2368610fad42f3446245258f7ea8dd26": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_b813f860504089d5211744e6d5ce8c73": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4b43af53a212eda7935ab7bbb0f4e78a": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_c2a0b3904e272da842585b1bdae8ed2c": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_eddede5a071c28179b74689b964c4947": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_686c59ffc73254d28b9c16eaa7062862": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_c204623e2eb9b3bd682bee1be88e2d10": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_01aa043b59cd4baa42e1025ac2dbb0df": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_1f0823b321a7f8a3c1533081f6948c29": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_7600f068a232a7defd967fd58ca3022e": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_eb6868a6fc42e8306785c4ab8f2389b0": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_49955719e22e93dc5e4add298189612d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_84d8298209171837bf0e668735a9ba23": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_2dd54038e9a330d736551a333e2d2f8d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_7c4bcf2faf13d3758c10a06337aaad91": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_20519dae101da70ca552516460c0c08a": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_5aaec86265a769aa8fc48aa2af0c6df2": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_cc025564c02ceb7d1818051cb3fcd2a8": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_823197092fa7d296e722f937be9e9b56": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4937166e0146e812659817c5b322a411": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_d081c813920f8a4dc3806462be8cfbca": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_45497efe1d7302c3e651f042ff180b0c": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_168c0e0f22e82c8c5254c310f3a994cb": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_505656031a90c51e88dd5e6c2d879906": "2211.03149_168c0e0f22e82c8c5254c310f3a994cb",
            "2211.03149_8346dcfde1ae72af8d7029110b41fccc": "2211.03149_168c0e0f22e82c8c5254c310f3a994cb",
            "2211.03149_23febda724478b32ed6eaae72327d4f5": "2211.03149_168c0e0f22e82c8c5254c310f3a994cb",
            "2211.03149_c0f645528829bb8754745d446fbc85c2": "2211.03149_168c0e0f22e82c8c5254c310f3a994cb",
            "2211.03149_26ea971eb32eb0cb33936c0c7ee832a7": "2211.03149_168c0e0f22e82c8c5254c310f3a994cb",
            "2211.03149_757be0bc109e6151a0aa598cd0bcb708": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e83528aaf29da9f4cf47a07eb30171b9": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_d709273dfaa52df68b74429b74262784": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_6ced65face999e4e780c73e30eaaef9d": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_9fe99b50abe1a99dea006b32a9ee1598": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_f40290cffe0846167ae9da65595c1198": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_0a241e60fa0c0d5430f48b278e6a2dbe": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_7b3ead98e308307f8ab3d6a1bdfed51f": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_bc177c99164f74d8fa677039ccd0de2b": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_4a70b3a7b0c242dd90e789bc609ff5b6": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_8596202df90ba1306110ab1c3fe03643": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_4015e9ce43edfb0668ddaa973ebc7e87": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e83754f557c411f862a4f2898f1386d3": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_a8c1109c4326bc0e001a0a1d35c3905c": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_98c6ef97b826cb7c46b941b47ffbdebb": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_0f05d987be97329d4ce27adef87055cb": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_f7a81b96f7be1b7fc22328c326d94927": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_0e988832bc6e3f69385b25a83e85f0d8": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_61ff614aaae244ad546872623563f156": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_12525497e50a4dd70d816d776b9bfcf9": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e8be550ec928226cded7289a4bd8daf2": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e4c83dab716f0fa57d1cf2a0b867fb40": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_483f62fe8ec4137c6d67776286d6a3a2": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_ca17b3879421ae3ef33d6d12cc18eaa5": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_61c7499bfeb80128dbccef24a05681f3": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_474d02fb4879ec6194175fe882c856b6": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_c6c1d7420dbff034945ef8861cadc399": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_62c15ed86ccafa60e3b574cacdd25cea": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_c1fb6e15238c6daf22a5c316ce610e96": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_a3e0fa219a558e585cd153eb0bdfaf49": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4ac58ba6cd3055f007708237e8a12866": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_b07966d4476da2dabf462c454943f576": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_0fd56432c12034f57ce00befe28b3dc5": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_b2c2dce96eb344f08f825a3b4408ebf3": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_bd7451f67db0f8654d8592e1a2e2b522": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_3e4fb5173e8ab30fe21875db0370fa5a": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_37481a2b472d681697a24c7f08b05d7b": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_c0520d33ad16f9d3a01d097a1286f3c0": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_871b6df63025e2492eb91dcbc800d145": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_788fe121c22b3a056cd5486782099df7": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_03889a07ed0106f61329db2f3716d057": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_c6d0626bc1e7461a948cc17b5626d481": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_79252b2985effeef6d4a3ee8266f0932": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_f2d593cc1077eeca327abe4806e4639d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_0ed1dfba15bdff1644c658fcdefa8cf9": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_545885cf758de900e56f474490254a6e": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_09042ee97b62c5ea85090b88e29a88e6": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_84905c65cf1a640397783000cc68d2ea": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_43da8f05e7d89e83fbf6d39b153843da": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_cd69eefc03843f7210e0c316e2b2162f": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_860fe445fa9cbc5c5028fae147627e81": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_d9bb06c3fd4125ce2825d2228b3050fb": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_5597c64624ab1c32b1ca1de745a45b56": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_1fa11f0384ccab53c2a15a4a26e35a48": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_7e493aab1b20105a7a9974e115ca253b": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_c9f444568c3490853a6ae33d3088c218": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_6f90c67343bfc4c64c6eea795b0bc225": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4bc8cdaba328a41a3452daab932e21f0": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_3b4987131488c5d9a39dad81c1c1c05c": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_ce96ce64475d88003b81a20710c10f5e": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_13ed8bdb6be85187a4a6ad32c6a07d2d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_6f6ddb2823d61d513229ded70dc4b2ad": "2211.03149_d1ec602319f9da672ff7e6e84f8ec53d",
            "2211.03149_5e4c6b8785e7fc1b423107189451ce38": "2211.03149_6f6ddb2823d61d513229ded70dc4b2ad",
            "2211.03149_50b0aaf88bce7baa877554a31677a072": "2211.03149_6f6ddb2823d61d513229ded70dc4b2ad",
            "2211.03149_8451afb27bc70db298198742be93d269": "2211.03149_6f6ddb2823d61d513229ded70dc4b2ad",
            "2211.03149_be2915de0b2e9cf2c3ea0f030f5802de": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_b7b1ae46def44ad1befe20aef897a6e5": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_2a24279f7560f5ca65ae6807f0eb732b": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e0bc20fb8b4b332c9f09fd9e7498eb8d": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_2c166860cbc0e3c9c725106e85a2c086": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_8d6ce6aac9f4e4c70c3343043bbde499": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_66c049ea8012399ab68ec222f5ff9b67": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_d453bf86676a185285306613198d001b": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_a8b6f34308dfb58e5f924fd35c9acceb": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_da4a2460acca84392f83dcf627ec79bc": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_ef72f1feb6b7040fd15de740f416c518": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_59a5d9b45323ea691fac73dca3588ec4": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_353237249ff2cf9253603256dbb24abe": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_23092680c6256cfc23dd8def5c6129b3": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_810b0a1f4b14f8bdc5f6a12d01c514fa": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_f5503cf6a8a2d84c96588b809caf5d99": "2211.03149_c650ba77f63a2de8ddffc114a6c65cbd",
            "2211.03149_e1e7aa0fd689c1e81855005e081c8a7e": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_e03b8399d99a5f54b0062afebfce2ffb": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4026908ee3966677980fcb914418c2cd": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_b6f00b4a8992280318b3d8008133d97a": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_e0f0ec52ff3c4ddbcdf63712d63228ce": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_87fe4bfa4ec4dca9ac7879e0d3fd10d7": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_4b796b838bd2b364be237816b073de79": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_fd0c5d1474bce2abf0fdab79fac7c5e2": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_572d873fc902ea4afb3833c7e6bfd340": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_e59e9021a7e2dcff477e216670adfc29": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_bad968ec1699e6d92b8c41af332799c9": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_1d6e7abf69f976ad9abc994bdd36f27b": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_a107d3cedcb2ca198bc3b0c8679ca7e5": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_386406cc19ed09440c86824d4197cd2d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_920ff67044089e153d0d66d3da817f33": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_9d55c888ae106e3706b7174d81ec990a": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_1dbb22894396dacd6b3cc7fa2b48453d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_0a3a79be6a7a77e7a88434ac18d732f4": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_63ee40a01ddb81b9f2c1de318105d785": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_9371d7a2e3ae86a00aab4771e39d255d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_2c78af6096917eb62c9ee1bde1f4eb8d": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_da49e28128f7b636cee9430db8b0b9e9": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_b0876eeb6f2c424f04d9a76eb43921e7": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_fb66624eebb28c38071108b56fad055b": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_290612199861c31d1036b185b4e69b75": "2211.03149_c2b3f016333a762c02e0e945b61362b6",
            "2211.03149_792db6809ddc1a5f7511a90fa86d68e8": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_65896f1114b014c8fdf59f3b0829a875": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_ee2c8d4e5e2d56c28bff47548375cc14": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_87ab0e07d0c19424c33e4a6d286e916c": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_ea2fe70d0e085c4293f63fe5f8cbe42b": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_88ca50949cf807119cbd4fafbc12c196": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_7786bacbf4e130437cd4ef1dcd9cefab": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_35efb2599ef8d0e8d6b2888a9a20f44e": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_0a581cb22a1968f686f21c000b478693": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_fbc962236eaeb89048daa03fef737adc": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_f88aaa2e270520c9cab456cffefae119": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_2e80f62dc90cb7ee8c15ba8d22429264": "2211.03149_f88aaa2e270520c9cab456cffefae119",
            "2211.03149_238674f95e1917c099c14004e1414ce2": "2211.03149_f88aaa2e270520c9cab456cffefae119",
            "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694": "2211.03149_f88aaa2e270520c9cab456cffefae119",
            "2211.03149_4d0729429d88257ffc28a70cceed131b": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_80a0b97a0f602b9d909bbb7c231e8ccd": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_969b2094ca75afaa8b4e2fe10d836561": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_f4b1647a3807c91f070b44037a96af96": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_e7bb85ac6c5949c64391bbd2f71cdf9c": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_17646faf27ea27f35c18b31bd8e43919": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_1a9055eaf7c0d522fecadce4f81b18a8": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_531344f9d2c773d36eaf413624e54ff8": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_e2f51726f6d4c05f04bcd54fe4642494": "2211.03149_d2dde39fcda28fa251dbefb5a6aa5694",
            "2211.03149_60178e9bea87234e2bc0bd22a09b20a4": "2211.03149_f88aaa2e270520c9cab456cffefae119",
            "2211.03149_6974ab7ea14115378ab9c4b11e2f24ee": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_f676d27f8720dc734d121a2a6cbf094e": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_788146ad4641e840c0acb246f2da27b3": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_a8cb9261abc822002a531dea568801d4": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_0d77e56ec6d4a3cc80359aac2321e533": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_83ba81df4d80c3a30b000316484fe30e": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_868f827f4a385d3ef42378fbf9b1cb0b": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_c4187b395c91ab764278c328a9114b53": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_71d5cd78a47fe27338202c55ee7fa058": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_ba95db6f0cd5de838e08cd692807997d": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_f3b0a7d4d4a7d80c6ab1d2c693bf83a6": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_ba308cc50968259a5d741aa72ecbd31c": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_44608a5559e1c24352d1cd8c64da39e3": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_f6fe43a0100224bbafbb9c2cf34b65b8": "2211.03149_60178e9bea87234e2bc0bd22a09b20a4",
            "2211.03149_6febff8610cf80243dd71a73ddd40d78": "2211.03149_f88aaa2e270520c9cab456cffefae119",
            "2211.03149_c5a4bac02fa47985623efa2dedcb2a36": "2211.03149_6febff8610cf80243dd71a73ddd40d78",
            "2211.03149_2d17ba9020e94deea3be9279e41b4080": "2211.03149_6febff8610cf80243dd71a73ddd40d78",
            "2211.03149_c838e29e573b1fa163857afe6b3dd522": "2211.03149_6febff8610cf80243dd71a73ddd40d78",
            "2211.03149_ec6c616af956aed7fea93e2269808da3": "2211.03149_6febff8610cf80243dd71a73ddd40d78",
            "2211.03149_c6ea76674071e2c6e054a8afd9cc6af0": "2211.03149_6febff8610cf80243dd71a73ddd40d78",
            "2211.03149_be3859755b496872fe346f333be86fd4": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_53eb4db79f7d3c3a2e94b3ef28f7ebc4": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_2ad6b880a695bcec5d9ffd5a70be3091": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_a02a791b4ef80748bc2e92de9c122c12": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_c2b3f016333a762c02e0e945b61362b6": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_c48de9b1b81a344dd1df56c82c2dc49f": "2211.03149_c2b3f016333a762c02e0e945b61362b6",
            "2211.03149_eb2938a104c19736673634dc61bd2c07": "2211.03149_c2b3f016333a762c02e0e945b61362b6",
            "2211.03149_4ef28e01c141faaef7cadaa53dbff281": "2211.03149_c2b3f016333a762c02e0e945b61362b6",
            "2211.03149_a9735710b29bc08d674fac043b1e64b9": "2211.03149_c2b3f016333a762c02e0e945b61362b6",
            "2211.03149_70023937d14cf4196a1ca9ec82bc5fee": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_54bbc95f033423cf0ae6df0cd2e9df88": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_80cf621dd9894bc570a67546c075c794": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_34592364260628acfadc3c0c9544c464": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_6b6032a5101fc4434a499287f8550c6f": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_0faf3ea923db147eaa595d153ffaae01": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_e2254473470318da5324f19696957e52": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_a363d4f2d56b54a48fe0aff5fbababab": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_cccf3e66d23ee0e3f4cac46a7f3afea2": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_1d5ec651601e431186fe15adfe5f9a50": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_21b28eb4220917af837bcbafdbcc24d7": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_a857690e73ca0cb7d30d94707bc516d4": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_2de50d7fa88ec70283190a397c435c70": "2211.03149_a9735710b29bc08d674fac043b1e64b9",
            "2211.03149_a38576ed1cbc1c9aa1f9d510ad4a83d4": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_463174acca015d7ad651592d35f543d4": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_2db48ded00905d5c74385bc7f0850e85": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_bde980419c938659e8d98cd2b7608460": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_200e0a3cd976dbfb6e1a0ece954783d7": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_654e10dd70697f20827907b9cf159123": "2211.03149_20240290611def07a26a5a9a7498a6d7",
            "2211.03149_b012480db878c626bab3a032c819347c": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_c8013a330e38f3c537a2967f18609b8a": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_f106715e62b9871eecdb1550bd961645": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_83f441ee1101cb8d19866d6cd935adcc": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_c043c2ebb76106aca481045501b48a0c": "2211.03149_290612199861c31d1036b185b4e69b75",
            "2211.03149_6f8b794f3246b0c1e1780bb4d4d5dc53": "2211.03149_e353dbe42c8654f33588d4da0b517469",
            "2211.03149_d4bc2d5e07d04558faee07b9772bfe7b": "2211.03149_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03149_cf91d958f32aa715c0bda4d93bcfe020": "2211.03149_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03149_abf1bb43c59324948c4af9a9d873ee8f": "2211.03149_6f8b794f3246b0c1e1780bb4d4d5dc53"
        }
    }
}