{
    "elements": {
        "2211.03009_9a7891a027a82bb26f895519d3e68a3b": "Document Root 2211.03009",
        "2211.03009_e353dbe42c8654f33588d4da0b517469": "Abstract",
        "2211.03009_ee1d86667244b34af7a0e8cbb64a311d": "Mood inference with mobile sensing data has been studied in ubicomp literature over the last decade",
        "2211.03009_3146ef71b3e74a013dc23c2d3d8b7674": "This inference enables context-aware and personalized user experiences in general mobile apps and valuable feedback and interventions in mobile health apps",
        "2211.03009_a848d2bb2f4501e575ceba7c87243018": "However, even though model generalization issues have been highlighted in many studies, the focus has always been on improving the accuracies of models using different sensing modalities and machine learning techniques, with datasets collected in homogeneous populations",
        "2211.03009_335924debaba11f2b402fa101b1b4902": "In contrast, less attention has been given to studying the performance of mood inference models to assess whether models generalize to new countries",
        "2211.03009_0615ca0bcad2947f18d010dc3d967c8e": "In this study, we collected a mobile sensing dataset with 329K self-reports from 678 participants in eight countries (China, Denmark, India, Italy, Mexico, Mongolia, Paraguay, UK) to assess the effect of geographical diversity on mood inference models",
        "2211.03009_555c5f3013c94b56262877c925a12a33": "We define and evaluate country-specific (trained and tested within a country), continent-specific (trained and tested within a continent), country-agnostic (tested on a country not seen on training data), and multi-country (trained and tested with multiple countries) approaches trained on sensor data for two mood inference tasks with population-level (non-personalized) and hybrid (partially personalized) models",
        "2211.03009_8d9510dbb95efda5fc5de9ccf519530d": "We show that partially personalized country-specific models perform the best yielding area under the receiver operating characteristic curve (AUROC) scores of the range 0.78-0.98 for two-class (negative vs. positive valence) and 0.76-0.94 for three-class (negative vs. neutral vs. positive valence) inference",
        "2211.03009_2077ffff24ce4a2040931deec75606a0": "Further, with the country-agnostic approach, we show that models do not perform well compared to country-specific settings, even when models are partially personalized",
        "2211.03009_d19a0ac655b8cf28df1bcd50fb10a598": "We also show that continent-specific models outperform multi-country models in the case of Europe",
        "2211.03009_54a91c3b126ca2703f0754825f0fbfb1": "Overall, we uncover generalization issues of mood inference models to new countries and how the geographical similarity of countries might impact mood inference.",
        "2211.03009_413777eeb2e9c5669e435f8dda7a91ec": "<ccs2012> <concept> <concept_id>10003120.10003121.10011748</concept_id> <concept_desc>Human-centered computing",
        "2211.03009_92748717ca96628e8a4e658620fc7ab1": "Empirical studies in HCI</concept_desc> <concept_significance>500</concept_significance> </concept> <concept> <concept_id>10003120.10003138.10011767</concept_id> <concept_desc>Human-centered computing",
        "2211.03009_61cfaa28a124e6811e6b5e6595a09109": "Empirical studies in ubiquitous and mobile computing</concept_desc> <concept_significance>500</concept_significance> </concept> <concept> <concept_id>10003120.10003138.10003141.10010895</concept_id> <concept_desc>Human-centered computing",
        "2211.03009_0b3d4dfbff09b19c48e14ef03f2aaf5b": "Smartphones</concept_desc> <concept_significance>500</concept_significance> </concept> <concept> <concept_id>10003120.10003138.10003141.10010897</concept_id> <concept_desc>Human-centered computing",
        "2211.03009_caa59772923f7ada7fb76ecffdb8e000": "Mobile phones</concept_desc> <concept_significance>500</concept_significance> </concept> <concept> <concept_id>10003120.10003138.10003141.10010898</concept_id> <concept_desc>Human-centered computing",
        "2211.03009_524a428f4b50d386066c83fa8c41de01": "Mobile devices</concept_desc> <concept_significance>500</concept_significance> </concept> <concept> <concept_id>10003120.10003130.10011762</concept_id> <concept_desc>Human-centered computing",
        "2211.03009_3efe4ac2b8a3e8fe61ab4c93d07aedc9": "Empirical studies in collaborative and social computing</concept_desc> <concept_significance>300</concept_significance> </concept> <concept> <concept_id>10010520.10010553.10010559</concept_id> <concept_desc>Computer systems organization",
        "2211.03009_ed2efc94933fabf68527f18c1959b71f": "Sensors and actuators</concept_desc> <concept_significance>100</concept_significance> </concept> <concept> <concept_id>10010405.10010444.10010446</concept_id> <concept_desc>Applied computing",
        "2211.03009_27ebd0f272a327acf2f2bef6070cedea": "Consumer health</concept_desc> <concept_significance>300</concept_significance> </concept> <concept> <concept_id>10010405.10010444.10010449</concept_id> <concept_desc>Applied computing",
        "2211.03009_40669d7f88430909ecc73320eb4d5e78": "Health informatics</concept_desc> <concept_significance>300</concept_significance> </concept> <concept> <concept_id>10010405.10010455.10010461</concept_id> <concept_desc>Applied computing",
        "2211.03009_50509a01d8bd029c1b71cbff15d748cd": "Sociology</concept_desc> <concept_significance>300</concept_significance> </concept> <concept> <concept_id>10010405.10010455.10010459</concept_id> <concept_desc>Applied computing",
        "2211.03009_0c27d3bb6c4c989c9d60bb3d0259f515": "Psychology</concept_desc> <concept_significance>100</concept_significance> </concept> </ccs2012>",
        "2211.03009_729f8ff38b50aeac7f5ba4ad4f6c0c21": "[500]",
        "2211.03009_ca28dabe78fe29043ca3a2924026613c": "[300]",
        "2211.03009_5dd14615efeb2d086e519ed35efd3f73": "[100]",
        "2211.03009_0b79795d3efc95b9976c7c5b933afce2": "Introduction",
        "2211.03009_8d08bd9135ec964d6936a97404f19d0c": "Mental well-being related issues are common among young adults due to a plethora of personal and societal reasons such as leaving home, study workload, poor financial stability, and complex social relationships",
        "2211.03009_fb925c8d948b50c23cf5cecb0badd17d": "\\cite{patel2007mental, rickwood2007and}",
        "2211.03009_b0ff07611537fc9620cccadfc3213e21": "These issues are even more prominent in the post-pandemic world, where social relationships have taken a toll due to more emphasis on remote work/study settings",
        "2211.03009_15d6052f037e8aecd01b4734172a040a": "Some studies have shown that this emerging lifestyle has affected phone usage behavior as well",
        "2211.03009_85d02c08f8d6afec763df2d11981ca60": "\\cite{stockwell_changes_2021, zheng_covid-19_2020, ratan_smartphone_2021, saadeh_smartphone_2021, li_impact_2021}",
        "2211.03009_ca75675abf3d8f20701493a9fc59c8a3": "Further, declining mental well-being conditions could lead to adverse outcomes such as substance abuse and suicidal thoughts",
        "2211.03009_097a96c3f4b82cc15e811e376cca492c": "\\cite{rowe2003substance, crosby2011suicidal, franklin2017risk}",
        "2211.03009_e29ed7da72c887456c0a4041bc6b1467": "In this context, prior research has discussed the potential of timely and accurate mood tracking for both personal and clinical care",
        "2211.03009_b92d646718b68c9b9723dc6013c56f92": "\\cite{spathis2019passive, wang2016crosscheck, faherty2017pregnancy, mark2008chart}",
        "2211.03009_163800ea8021b00c8a7c1f1877e0b9f1": "Ecological momentary assessments (EMAs) and survey questionnaires are commonly used for mood tracking",
        "2211.03009_41bc7de2b8959f1389bf85288f06e9bb": "However, such techniques are burdensome to users, and prior work has shown that it is difficult to sustain the practice of reporting for long periods unless there is a strong motivation",
        "2211.03009_9a8e1203525b089a58d558d361d4123e": "\\cite{baumel2019objective, rapp2014self, schueller2021understanding}",
        "2211.03009_1bc46f45bf06f14db6df996ec9c38256": "As a possible alternative, multi-modal sensors in smartphones could be used to infer mood unobtrusively with reasonable accuracies",
        "2211.03009_724c4fa20964cda8e8daf6902108ee79": "\\cite{pratap2019accuracy, likamwa2013moodscope, servia2017mobile}",
        "2211.03009_8feb318ae8043c5ec5ba50c8d7eccfb7": "According to prior work in psychology and social sciences, physiological aspects, including mood, are perceived and expressed differently in different countries, cultures, and societies",
        "2211.03009_dd6b938e4d54df95406e2c4ce016b41e": "\\cite{luomala2004cross}",
        "2211.03009_ebb674b8f10a47e869fb5841a76c0adf": "According to a cross-country study by Becht et al.",
        "2211.03009_1038d5c13f16f022b3c56b47cbbfcd9d": "\\cite{becht2002crying}",
        "2211.03009_7548424e1b5cd4fe58871a2b9ad505ea": ", mood and related behaviors could vary based on a person's culture, and perceptions and beliefs regarding different moods stemming from one's culture",
        "2211.03009_e48d1825cac370ea94b3994c1502245f": "However, prior work in mobile sensing does not study the effect of the geographical diversity of users (e.g., country of residence) on smartphone sensing-based mood inference models",
        "2211.03009_3e55977a58dee6a7a92291da294ff81b": "Issues of generalization and fairness with regard to the geographical diversity of data sources have been discussed extensively in domains such as computer vision, speech, and natural language processing",
        "2211.03009_ae1ea0a73498590f023898304130f8e0": "\\cite{grother2019face, zou2018ai, wang2020towards, castelvecchi2020facial, malhotra2008automatic}",
        "2211.03009_6db92e91420f5da12c4a2ef50da9cfe1": "For example, gender classification models trained with data predominantly from the USA have performed poorly on people of African and Asian descent",
        "2211.03009_21d1760f82190564feb7f873a771a0d5": "\\cite{castelvecchi2020facial}",
        "2211.03009_12b7785a9a692fe5f02945abc27983dd": "Many geographical-related biases (e.g., Indian brides being recognized as dancers, etc.) have been shown in models trained with the imagenet dataset, in which a majority of data is from western countries",
        "2211.03009_2219f6f69b41de80fa98a3e65833ddbd": "\\cite{zou2018ai}",
        "2211.03009_2eb6eabbea0105e4724a1f243c651386": "Such findings have uncovered issues in data collection practices and helped shape research directions to address issues related to diversity and biases",
        "2211.03009_63368bf0d18509ac2c10f2115690fc60": "In this context, many prior mobile sensing studies that attempt inferences regarding well-being related aspects highlighted that models are trained in specific countries, and the generalization of techniques for other countries or regions should be explored further",
        "2211.03009_0666ffcf97c5334350ec92acc68d03d7": "\\cite{choi2021kairos, muller2021depression, meegahapola2021examining, meegahapola2021one}",
        "2211.03009_c737b1e496f4e07c4e8cac597131b313": "However, mood inference studies have focused on only one or two countries for data collection",
        "2211.03009_299cbdb88b00552310fdb07053d5871d": "\\cite{likamwa2013moodscope}",
        "2211.03009_85c34941264b454f68d9bdb45fb3326f": "or have not considered the diversity of data sources in terms of the country, even when data were collected from multiple countries",
        "2211.03009_814ad27dd2da47cf5f5d2e47a4732d7f": "\\cite{servia2017mobile}",
        "2211.03009_540b1b795113df6aac7ba59b272f248b": "Bardram et al.",
        "2211.03009_6624bf8ba396e74c9ed02c94cc7591ec": "\\cite{bardram2020decade}",
        "2211.03009_6d16a85b7ab7b23773b95641e67d0a42": "emphasized the need for generalization and reproducibility of sensing-based models for mental well-being-related outcomes",
        "2211.03009_d5ccbe8facfaf9a8f2b4561749277f3b": "However, even though examining gender, age, and occupation-related diversity is feasible even within the same country, examining geographical diversity requires a considerable effort in conducting the same study, with the same protocol, in several geographic regions because studies are time-consuming and expensive; and logistical difficulties in conducting experiments such as language barriers, technology barriers, differences in motivating use cases and required incentives",
        "2211.03009_48ba5122d7f8b7301d13da658daceca4": "Hence, studies that examine the geographical diversity of mobile sensing-based inferences are rare",
        "2211.03009_441e912b40309c64f9ba94849c48c869": "\\cite{phan2022mobile, khwaja2019modeling}",
        "2211.03009_b73dda40a34c3537059bc58b694b4012": "In this paper, we study and compare the performance of country-specific, country-agnostic, and multi-country approaches for mood inference",
        "2211.03009_bd857965dd0782b59f0e6d98b4e09f72": "In addition, we also examine the effects of model personalization and generalization to new geographically diverse countries",
        "2211.03009_8ebc0e5aedc2f2cff31741ee95e5b70e": "To our knowledge, this is one of the first studies to examine the effect of geographical diversity of users on smartphone sensing-based mood inference models, hence shedding light on distributional shift related issues",
        "2211.03009_b31e0147e174ca0e303f867f7e21a0d7": "Considering these aspects, we ask three research questions.",
        "2211.03009_a8f65dd93445b90d34246cc201862695": "List (itemize)",
        "2211.03009_7d74f3b92b19da5e606d737d339a9679": "Item",
        "2211.03009_3f9b507228bc1dee77d85f5745ddc04f": "What behavioral and contextual characteristics around mood reports of college students (from eight countries spanning Europe, Asia, and Latin America) can be extracted from the analysis of smartphone sensing and self-report data?",
        "2211.03009_b87f6b7a145f75db316b865210144b3d": "How do smartphone sensing-based mood inference models perform in different countries (country-specific)? Can a model trained in one/more countries be deployed in another country not seen on training data to achieve reasonable accuracies, hence generalizing well (country-agnostic)?",
        "2211.03009_2615d058650d223901ac6b676fde1c98": "How do country-specific or continent-specific models perform as compared to a multi-country model?",
        "2211.03009_3a47f6fbcc8a227453f3f55ed513a526": "By addressing the above research questions, this paper provides the following contributions:",
        "2211.03009_87fbec7de0ed7d814e9b0f18f27acb20": "We conducted a new smartphone-based data collection campaign among 678 participants in eight countries (China, Denmark, India, Italy, Mexico, Mongolia, Paraguay, UK) representing Europe, Asia, and Latin America to study their everyday mood and behavior",
        "2211.03009_a348d6047f5b10e397f8b77ee2380cda": "During the study, we collected 329,974 fully complete self-reports",
        "2211.03009_68902bd1ced7390ffd2357d439901cad": "In addition, we also collected rich passive sensing data with continuous sensing (activity type, step count, location, cellular, wifi, bluetooth, proximity, etc.) and interaction sensing (app usage, touch events, user presence, screen-on/off episodes, notifications, etc.) throughout the deployment",
        "2211.03009_4d88e0e607efdd656d1e270fec64be44": "First, we found that negative mood reports in all countries would increase from morning to night",
        "2211.03009_5896db290370e547bd2211cc02dfde62": "Moreover, with statistical analysis, we found that the features that help infer mood are different across countries",
        "2211.03009_006992a4de9c78925209cb82cb5cf0c6": "However, the best features included both continuous and interaction sensing modalities in all countries.",
        "2211.03009_a634d76842e31f9efcaba35dcf675a8c": "We found that the country-specific approach performs reasonably for both two-class and three-class mood inferences with AUROC scores in the range of 0.76-0.98 with hybrid (i.e., partially personalized) models",
        "2211.03009_d92cb204aafe9d08b59dfe21b4f19105": "However, we noticed that across both two-class and three-class inferences, models do not generalize well to other countries, where AUROC scores drop to the range of 0.46-0.55 on average in the population-level (i.e., non-personalized) setting and 0.66-0.73 in the hybrid setting",
        "2211.03009_0c89c32b52d2135b86b96556b378a753": "These findings raise the significance of discussing issues of generalization of mobile sensing-based models to different world regions.",
        "2211.03009_8f478b2636c989e945e160cd9a2fa2bb": "In the hybrid setting, we found that multi-country models do not perform as well as country-specific models even though they achieved an AUROC of 0.81",
        "2211.03009_8a6ffa39ffee132f61627067b81dcec0": "However, they performed better than continent-specific models built for Asia and worse than the one built for Europe",
        "2211.03009_279e513272e417d3799bc25b04f38a4b": "Even though the performance differences were not high, this again highlights that building a model within European countries leads to higher performance and better generalization for those countries than using multi-country or even some country-specific models",
        "2211.03009_008c18e423608254a3b5e7fb2b27b90e": "A possible explanation is that the European countries under study (Italy, Denmark, UK) might share some daily behavioral patterns",
        "2211.03009_4352e33d2992f99a7a28f5a2c7432368": "In contrast, the three countries in Asia under study (China, India, Mongolia) have less similarity regarding daily patterns",
        "2211.03009_d8a96369d6f749fd678fb94eb29ebbd4": "Hence, these findings point toward the benefit of considering the geographical/cultural diversity of data collection on smartphone sensing-based mood inference models.",
        "2211.03009_365d57045d688d635eff42b0c4015e65": "The study is organized as follows",
        "2211.03009_2e2d69a7178955d1c78950920f27785d": "In Section",
        "2211.03009_458d6fc470a427d7a449d5f335e2211d": ", we describe the background and related work",
        "2211.03009_bef2faa3029262d4e0c215b0caf54960": "Then we describe the data collection procedure in eight countries and how we came up with features in Section",
        "2211.03009_d2c24d59e0baff4d0155fbdf62590867": "Section",
        "2211.03009_da2ec937720c20e3405664c5e74891d3": "provides a descriptive and a statistical analysis of data",
        "2211.03009_5981ee1d2dc26e7e2ae5adcb7028f227": ", we define the analysis strategy and evaluate two-class and three-class mood inference with population-level and hybrid models with approaches: country-specific, continent-specific, country-agnostic, and multi-country",
        "2211.03009_74e839a22db4c4411aea03874379c049": "We discuss the main findings and implications in Section",
        "2211.03009_eb6e9fd4aa33851dc0f208f2442039af": ", and conclude the paper in Section",
        "2211.03009_5058f1af8388633f609cadb75a75dc9d": ".",
        "2211.03009_f36791fd11b29f26e27f40a1e26281f8": "Background and Related Work",
        "2211.03009_983e5073694b42a67c7ad75492a425d3": "\\begin{table*}\n%   \\small\n\\centering\n\\caption{Terminology and description regarding different model types and approaches.}\n\\label{tab:terminology}\n\\resizebox{\\textwidth}{!}{%\n\\begin{tabular}{>{\\arraybackslash}m{2.1cm} >{\\arraybackslash}m{15cm}}\n\n\\rowcolor{Gray2!20}\n\\textbf{\\makecell[l]{Terminology}}  & \n\\textbf{Description} \n\\\\\n\n\\arrayrulecolor{Gray}\n\n\n\nPopulation-Level Model (PLM) &\nTraining and Testing splits have a disjoint set of users. Represents a case where a machine learning model trained with a population is deployed to a mobile app that is used by a new user. Hence, end user data are not used in model training leading to non-personalized and generic one-size-fits-all models.\\\\\n\n\\rowcolor{Gray!15}\nHybrid Model (HM)&\nTraining and testing splits do not have a disjoint set of users. Represent a case where a machine learning model is used by a mobile app user for some time, and data from the user is used in re-training models. Hence, this approach leads to partially personalized models. \\\\\n\n\\hline \n\n\n\\textcolor{black}{Country-Specific} &\n\\textcolor{black}{This approach uses training and testing data from the same country. \n%It is the least diverse approach,\nEach country has its own model, without leveraging data from other countries. As the name indicates, these models are specific to each country (e.g., a model trained in Italy and tested in Italy). Both population-level and hybrid model types can be trained in the country-specific approach.}\\\\\n\n\\rowcolor{Gray!15}\n\\textcolor{black}{Continent-Specific} &\n\\textcolor{black}{This approach uses training and testing data from the same continent. Each continent has its own model, without leveraging data from other continents. As the name indicates, these models are specific to each continent (e.g., a model trained in Europe and tested in Europe). Continent specific approach can be trained with population-level and hybrid models.}\\\\\n\n\n\\textcolor{black}{Country-Agnostic} &\n\\textcolor{black}{This approach assumes that data and models are agnostic to the country. Hence, a trained model can be deployed to any geographical region regardless of the country of training. Country-agnostic approach too can be trained with population-level and hybrid models. There are two types of country-agnostic settings:\\newline (1) Country-Agnostic I: The first setting uses training data from one country, and testing data from another country. This corresponds to the scenario where a model trained a in country already exists, and we need to understand how it would generalize to a new country (e.g. a model trained in Italy and tested in Mongolia). \\newline (2) Country-Agnostic II: The second setting  uses training data from four countries, and testing data from the remaining country. This corresponds to a scenario where the model was already trained with data from several countries, and we need to understand how it would generalize to a new country (e.g. a model trained with data from Italy, Denmark, UK, and Paraguay, and tested in Mongolia).} \\\\\n\n\n\\rowcolor{Gray!15}\n\\textcolor{black}{Multi-Country}&\n\\textcolor{black}{This one-size-fits-all approach uses training data from all eight countries and tests the learned model in all countries. This corresponds to the setting in which multi-country data is aggregated to build a single model. However, this is also how models are typically built without considering aspects such as geographical diversity. Multi-Country models too can be trained with population-level and hybrid approaches.} \\\\\n\n\n\\arrayrulecolor{Gray2}\n\\hline \n\n\n \n\\end{tabular}\n}\n\\end{table*}",
        "2211.03009_e5ced83bc8521ae58759544f1385c2d7": "Definitions and Terminology",
        "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa": "What is Mood?",
        "2211.03009_a462b796e2a58e0a661756c35314ab9a": "There is no single way to define mood",
        "2211.03009_7faed00a79757065ac13ba18d5adcb55": "\\cite{dissanayake2022sigrep}",
        "2211.03009_5d2cc2a65729f737c14d45bd3414950e": "However, in prior work in mobile sensing, some operationalizations have been commonly used",
        "2211.03009_c697714c3bf5bd0846cd880898444bf9": "Positive Negative Affect Schedule (PANAS) is a widely used validated questionnaire that can be used to capture the positive and negative affect of individuals",
        "2211.03009_b9bc458fa4b2876950ed8d68596833ac": "\\cite{kanjo2017notimind}",
        "2211.03009_a14fa2e71453206b0f65666ce13dd97d": "However, these questionnaires are long and could be cumbersome to users",
        "2211.03009_6c8437069c65e77e3f88930e0c941cc0": "Further, they can capture mood over the past week (or two),",
        "2211.03009_b91b86447f5144c2a79030487d76e10e": "Hence, prior work has also used an affect grid based on the circumplex mood model",
        "2211.03009_49d1b729615b44b65e87a70384a981d4": "\\cite{servia2017mobile, likamwa2013moodscope}",
        "2211.03009_93d782ae0137be66f83cf7fb7264549e": "that would capture the",
        "2211.03009_be5d5d37542d75f93a87094459f76678": "and",
        "2211.03009_82239188158ac2ff70430afe3eddacb9": "As described in later sections, due to pragmatic reasons, the data collection in this study does not focus on arousal because positive and negative affects of the circumplex model are important in determining negative moods that could be useful for adverse mental well-being related outcome detection, feedback, and interventions",
        "2211.03009_0e6fc1f73ccaec99fdebebbb80be2748": "\\cite{baumel2019objective,schueller2021understanding}",
        "2211.03009_db94a1c940454d5693c49c295ce7d09e": "Hence, only",
        "2211.03009_0c2d477673ad5f14b8583cc988b59e65": "has been captured in a five-point scale: very positive (",
        "2211.03009_8cef47f6f219b66134cbc25455340f4a": "), positive (",
        "2211.03009_63a7c81ca627c0cb89a2325c13126ed6": "), neutral (",
        "2211.03009_a1076f1705c11b60b4585d2393a7e8ec": "), negative (",
        "2211.03009_5c29a87beeed9333ee90527f3c082c51": "), very negative (",
        "2211.03009_9371d7a2e3ae86a00aab4771e39d255d": ")",
        "2211.03009_c9115adb319d4f4a9aa140df4b5fa661": "This five-point scale is similar to LiKamwa et al.",
        "2211.03009_61dd6d1d9c1285417da5158650b7c1dc": "and Horlings et al.",
        "2211.03009_b1a5b42ab9b6890565e3babb96e154af": "\\cite{horlings2008emotion}",
        "2211.03009_a0a4fc7a2c17431f28352b3c5d5dbdec": "For inference, we reduce the five-point scale to two-point and three-point scales similar to prior work",
        "2211.03009_52de106c2fa8a289f4f0600234a20c09": "\\cite{wampfler2022affective, dissanayake2022sigrep, brown2011towards}",
        "2211.03009_85ccf014ddc645b654409ccb2c185d71": "This is usually done based on the idea that in mood inference, the more important aspect is to detect extreme moods (i.e., negative, positive) rather than to identify all fine-grained intermediate mood levels in the middle of the spectrum",
        "2211.03009_ed42518ada7cf5f60d22365f39f9cae8": "First, obtaining a three-point scale using the five-point scale was obvious by combining very positive and positive to positive; neutral as it is; and negative and very negative to negative, hence having three classes",
        "2211.03009_907bd851d4413441dd1b506ecd1c42df": "\\cite{wampfler2022affective, soleymani2011multimodal}",
        "2211.03009_139aa26c1ce1a4b5d73a39aa66c06f1e": "However, for two-class inference, the categorization is not as obvious",
        "2211.03009_f41fe5e77fb90874892b15a82965cacc": "Some prior studies have removed the class in the middle (i.e., neutral), hence obtaining positive and negative labels",
        "2211.03009_ebcc03f24f0b9ad074e876e850e47114": "\\cite{zhang2020corrnet, horlings2008emotion}",
        "2211.03009_98a53c1cae62f841a6a565c27e71d744": "Even though it is possible to do it with the available classes in the dataset, we believe it would lead to a biased classifier that would not perform reasonably well when exposed to data corresponding to neutral mood labels",
        "2211.03009_9db2935111e9202cea904436610362fd": "Hence, we followed prior work that binned very positive, positive, and neutral moods as positive; and negative and very negative moods as negative",
        "2211.03009_498ad85002702522347e02a2d0b37d31": "\\cite{zhang2020corrnet, brown2011towards}",
        "2211.03009_bc0a5a6789136e4daa257d8b8141afe8": "This two-class inference also allows for detecting negative moods, which is useful in mobile health apps for feedback and interventions",
        "2211.03009_9a1c220c1afcf27e72fb3d242a41c212": "because it is such negative moods, along with other aspects like stress that could be harmful to individuals on the long term",
        "2211.03009_8abc74a127225e7337152c4796645753": "Hence, in the scope of this paper, mood can be defined as",
        "2211.03009_c687040d465a9cc872409591d7558f22": "Model Types and Approaches.",
        "2211.03009_af029582cebba015ba107205540ec198": "This section introduces the definitions and terminology used in this paper, as summarized in Table",
        "2211.03009_399a0c6264634d64606548b09650dae9": "In terms of model types, we use population-level (subject-independent) and hybrid models",
        "2211.03009_c282eaf861739b2f80de55c1a82f26fb": "\\cite{ferrari2020personalization, bangamuarachchi2022sensing, likamwa2013moodscope}",
        "2211.03009_b5ede90e27706c31caa705a8ef68b02e": "While population-level models are not personalized, hybrid models are partially personalized",
        "2211.03009_031107325c69b1c9a4b134b95d85df62": "The operationalization of models is described in Section",
        "2211.03009_1afb74fe7e712eaa1f50c9ece962b9c4": "Second, in terms of approaches, we consider the country-specific approach that is trained and tested within each country; the continent-specific approach that is trained and tested within each continent; the country-agnostic approach in which models are trained in one or more countries, and tested in an unseen country; and the multi-country approach that would ignore the diversity in terms of countries, and train a one-size-fits-all model considering data from all countries",
        "2211.03009_7e7c08f234f6419f2b98ba0421b7606c": "As an important note, all these approaches can be evaluated with both population-level and hybrid model types",
        "2211.03009_9842199cc376f88bce3aaf8affba4b01": "For example, in a country-specific setting, imagine a model trained with a certain population in Italy and tested with some new users in Italy, hence examining the model performance on new users from the same country",
        "2211.03009_f19ce4925c6ebbec2e21cc9e4f1ddb15": "This is equivalent to a population-level model of the country-specific approach",
        "2211.03009_0c0abad7832177aa397088ec95b00115": "Then, imagine the set of unseen users producing data for model training after using a mobile app for some time, and these data points being used to update the model",
        "2211.03009_d3425b3a18530462ae0581e507f4a25e": "This would then lead to a hybrid model of the country-specific approach",
        "2211.03009_df7501dffc22ebbb45440b1e3b9af111": "Similarly, for the country-agnostic approach, a model trained in Italy deployed to unseen users in Paraguay is similar to evaluating a population-level model",
        "2211.03009_ed575673d2ccd43e8e1c8a1d9e6ecb32": "Then, imagine the users in Paraguay providing some data for model personalization",
        "2211.03009_ad8883bbe62d857ae2312be98ffd527b": "This leads to a hybrid model created with a mix of data from Italy and Paraguay that can be evaluated on new data points from users in Paraguay, whose data were used in model training",
        "2211.03009_cdaa1e5433daeddf252dcf7dc77747ea": "While this model too can be called a multi-country model, for ease of understanding in the scope of this paper, we would still call it a hybrid model with the country-agnostic approach",
        "2211.03009_707ef42617c5e26b83be6028383eb036": "Using the combination of model types and approaches, we can examine the effect of personalization (with model types) and model generalization to new countries (with the four approaches), hence uncovering distributional shift-related issues of multi-modal mobile sensing datasets for mood inference.",
        "2211.03009_70f40d568404952ec3236f2274cfd772": "Considerations for Research in Mobile Sensing Involving Geographic Diversity",
        "2211.03009_90fcf16dab7eb88755865a9fca8edb30": "Mood and Geographical Diversity",
        "2211.03009_53fcaa4aad7016752b098e50f55d7513": "Across different geographical regions and cultures, behavior is mediated by inherent beliefs, presses, and affordances of physical and/or socio-cultural environments",
        "2211.03009_ad2df2a343b9fe2ca8b872d0b8132be0": "\\cite{phan2022mobile}",
        "2211.03009_07afaaf8045b049e2742ee930644624f": "Even for behaviors that are similar across cultures, the psychological meaning of those behaviors might not be the same due to",
        "2211.03009_332fd5c869aced0286e84b107b71c89a": ": (a) Certain behaviors that are acceptable in certain countries/cultures are not perceived as normative or appropriate in other countries",
        "2211.03009_92a5584ad85b8ffc346540a539f84ab8": "\\cite{van2004bias}",
        "2211.03009_a3eca3239d7640e66baeb88e98ca39bf": "; (b) The same behavior might be indicative of different outcomes/functions",
        "2211.03009_86564e7450bac027071fc7ef32929029": "For example, while cycling is everyday behavior in certain regions (e.g., Aalborg, Denmark), it might only be used for exercise in other areas (e.g., Ulanbatoor, Mongolia); and (c) Different behaviors might be indicative of a similar outcome/function",
        "2211.03009_3c1ac42abf451d60064a6352f8ddf80d": "For example, while people in some countries might perform cycling for exercise, people in other countries might prefer going to the gym for exercise",
        "2211.03009_f5cb7bd57f559a5fcb260ce14c23f0bf": "Why people cycle will depend on many contextual and cultural factors such as road safety, availability of public transport, alternative exercise options, weather conditions, and perceptions about cycling in a specific geographical region",
        "2211.03009_7d83d8b7f71416ed0ad4b3bed3ddf5b7": "Given that smartphone sensors can capture such physical activities (e.g., Google Activity Recognition API",
        "2211.03009_3771fbc8c1c16099848dbc4bb5d9c3ee": "\\cite{GoogleActivity2022}",
        "2211.03009_392b0329815af4a8fde385f36e9c00b1": "and other activity engines built by researchers",
        "2211.03009_23e23cb9bfee9934e9234d8ccee4d08b": "\\cite{wang2014studentlife}",
        "2211.03009_a8a28b51f098d09edfe753e506088b55": ") and are used to infer more complex variables",
        "2211.03009_da7652b1744e3cd4befe12fb5ceec943": "\\cite{canzian2015trajectories, wang2014studentlife}",
        "2211.03009_314c28b6f1fd26b0fd63a6046a353fd6": ", invariably, such behavioral differences across geographical areas could affect mood inference models that leverage activity data from accelerometers and location",
        "2211.03009_eba86585ce89def97bede72cba64cc71": "In addition, device-mediated behavior or phone usage behavior could also vary between geographical areas depending on cultural norms, weather conditions (e.g., the phone usage behavior while walking outside in a cold vs. a hot country), network coverage, and subscription plans (e.g., people in countries where internet plans are expensive might turn off internet frequently, people in countries where the used phones are old might turn off Wifi and location sensors often to save battery of the phone, etc.), and availability of alternative equipment that could serve similar functionality (e.g., using a laptop for zoom calls instead of the phone, hence showing differences in the sensed app usage behavior)",
        "2211.03009_652b6c7c9525caf180bcb6d05d43e1e4": "Given that mood inference models in prior work have used both continuous (activity types, step counts, location, proximity, wifi, etc.) and interaction (typing and touch events, user presence, application usage, screen on and off events, etc.) sensing modalities to examine/infer mood and related psychological constructs, how behaviors and contexts captured with smartphones affect mood inference in different countries is worth investigating.",
        "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444": "Studies about Psychological Constructs and Geographical Diversity.",
        "2211.03009_6c7442140678240dfec8fbbd12d90189": "According to Khwaja et al.",
        "2211.03009_7c217d420cd50c61043cc17b2cac6232": "\\cite{khwaja2019modeling}",
        "2211.03009_72859ca70671157ea1e5e5245e5380b1": ", psychological mobile sensing research aims to quantify and measure constructs related to mood, stress, depression, and user personality over the last decade due to the advancement of sensing technologies",
        "2211.03009_6e8874f937a3fd6a00fd1b3788a1b51f": "Even though there is a myriad of studies about such psychological aspects, ranging from clinical to non-clinical studies, many have focused on a population within a single country",
        "2211.03009_ecb52927aa04f15fd7646845fd17d229": "In addition, even when the construct of analysis used in studies is the same (e.g., circumplex mood model, positive-negative affect schedule, etc.), comparing different studies across countries is complicated because data have been collected using different protocols and sensing modalities",
        "2211.03009_4df4e4f48a300c2bfa928993e5b836bb": "\\cite{adler2022machine}",
        "2211.03009_0bef340f08cb771340dba1839b6d769a": "Furthermore, Phan et al.",
        "2211.03009_4f28270ab5df39c98b7e37c259655156": "have discussed how prior psychology studies in mobile sensing have collected data focusing on WEIRD samples (Western, Educated, Industrialized, Rich, and Democratic) and paid less attention to the global south",
        "2211.03009_7765ab6aa640e4ec3d584cb24b91f7c1": "This has also been highlighted in a review study on smartphone sensing by Meegahapola et al.",
        "2211.03009_bfff6800a07b38a22497c939385bd071": "\\cite{meegahapola2020alone}",
        "2211.03009_872d66e8955c95157640a7e0f5833027": "For these reasons, prior work has emphasized the need for studies that examine the generalization of models across countries/cultures by building diversity-aware approaches to machine learning-based modeling of sensor data",
        "2211.03009_92371f3a363f1eaa09c5e8dbdeeb5764": "\\cite{meegahapola2020smartphone, bardram2020decade}",
        "2211.03009_e071bc399cde10dd9474d980c2985161": "According to a recent review by Phan et al.",
        "2211.03009_0781693c039378cf7bb64526cf74dd26": ", only Khwaja et al.",
        "2211.03009_89cc4c7fe1dec6b21cc7941960434d23": "have considered the cultural diversity of smartphone sensing-based models on psychological aspects, where they studied personality traits based on Big-Five model",
        "2211.03009_b05d319cb2f0b797db0ab4daebb469a8": "In that study, the authors collected data from 166 participants from five countries (UK, Spain, Colombia, Peru, and Chile)",
        "2211.03009_f25b4aabb0341fceb69bd8a7aac90f5d": "They showed that country-specific models perform the best, regardless of the gender or age balance, for the prediction of Extraversion, Agreeableness, and Conscientiousness",
        "2211.03009_16f32c089b270cf2a5b1626704386c26": "Compared to that study, we also collected data from multiple countries",
        "2211.03009_82e1d17888d8e501a6d182a296e2ad08": "However, our primary focus is on studying mood inference models that could vary from time to time, even within the same person (more dynamic), instead of stable personality traits",
        "2211.03009_ac683f14d004e5b13bdb52a322b8abd6": "In addition, Muller et al.",
        "2211.03009_6a57e661677006c9e7aa36cc9d34c45a": "\\cite{muller2021depression}",
        "2211.03009_29c226519c3ea85a710814948ba7b1cf": "used mobile GPS data to predict depression in socio-demographically homogeneous sub-samples within the USA",
        "2211.03009_a914a276a6a008e61e7958ab5745685d": "They trained algorithms for the whole sample and homogeneous sub-samples (e.g., highly educated men, women residing in rural regions, etc.) and tested within and across sub-samples",
        "2211.03009_b1ff18f7c319815acd9b1beaada25d2d": "They found that the technique that led to high AUROC scores for student populations (0.82), did not generalize well to the USA-wide population-level model (AUROC of 0.57)",
        "2211.03009_bfd7a877e07fcda6dcbc109c41919127": "In contrast, our work focuses on valence instead of depressive mood",
        "2211.03009_900b2c91700b10f8a8e67192e3f81bc6": "In addition, rather than concentrating on socio-demographic differences within a particular country, we focus on cross-country differences.",
        "2211.03009_eaa7a0f3534da1c29a67c2544781f43d": "Mood and Smartphone Technologies",
        "2211.03009_b090903d5fb4feba267e3bac79ad272d": "Mood Tracking with Self-Reports",
        "2211.03009_35734c7e922eb797d73d2c7a7a464b02": "In the early days, mobile phone-based mood charts were used to track the mood of individuals",
        "2211.03009_f2c44461c652ecd6cbd3df312602982d": "These are based on self-reported questionnaires and ecological momentary assessment (EMA) responses",
        "2211.03009_c581252937f0e45dc74cd3f5ccf80148": "\\cite{chan2018asynchronous, meegahapola2020smartphone}",
        "2211.03009_90c207baf76ea5adc2955f8ae0de76ca": "Similar to how mobile food diaries were designed for people who wanted to control their diet",
        "2211.03009_30731e059415c8e678da019069733126": "\\cite{meegahapola2021one}",
        "2211.03009_62111bef6f927ad0502d669e71944c1d": ", mood charts were designed to support people who wanted to control negative moods and increase self-awareness, allowing for monitoring and feedback",
        "2211.03009_070d5a8cb1d83594e252f6fbca30e9df": "With randomized controlled trials, some studies explored the usefulness and efficacy of self-report-based mood tracking and showed that engaging in mood tracking tools increases self-awareness, hence reducing the possibility of having anxiety, even within clinically depressed populations",
        "2211.03009_5e6775b19737f516b00d5d1e4d4e3684": "\\cite{bakker2018moodprism, birney2016moodhacker}",
        "2211.03009_f7e9d8d7b9c3f5872d9e651b4241f6c1": "Going beyond applications related to health and well-being, Glasgow et al. discussed how aspects like destinations, travel choices, and social ambiance are related to mood",
        "2211.03009_e6c516fd46fb12c66bd699a1e96b8a64": "\\cite{glasgow2019travel}",
        "2211.03009_3856be1833d8fbef4cd578af432b8ee3": "Further, in this context, prior work that uses mood tracking has focused on different populations such as college students",
        "2211.03009_7159fe9505a0fad16a537a0fe0ad5f36": "\\cite{lee2018destressify, wang2014studentlife}",
        "2211.03009_94e76c2b495ab694d621bd5db4615240": ", adolescents",
        "2211.03009_4458b4e002c8cf5b9330f72882fbea74": "\\cite{kenny2015copesmart}",
        "2211.03009_ec541878dc7ef370a80f8f306e059d5f": "and clinically diagnosed, high-risk populations with mental well-being related issues",
        "2211.03009_3b6f406288d8d2249555869eea3d1b52": "\\cite{wang2016crosscheck, faherty2017pregnancy, mark2008chart}",
        "2211.03009_b701c09c9444e55142480061e3b09f43": "Hence, most prior studies relied on user engagement to keep track of mood",
        "2211.03009_0372fbd538d68605e615b2896fbb2a54": "This could be a burden to users in the long run, and it is known that apps that require many self-reports do not have high adoption rates",
        "2211.03009_a07f9255d586d769589065af68ccc41a": "In our work, even though we captured self-reports about mood, they were captured as ground-truth labels to train classifiers with sensor data for mood inference",
        "2211.03009_54c9b1258381ce90a056d8fd7240cbd5": "Such inferences could be used to update mood-tracking applications that could be used to provide context-aware interventions, and feedback to users, with less user burden",
        "2211.03009_c7c0d8d3aa3fa493a63085349e433484": "Mood Tracking with Sensing.",
        "2211.03009_5bb61e667352be9bab38a3575842a7df": "Mobile phone sensors allowed researchers to build context-aware systems that could infer various aspects regarding the health and well-being of people",
        "2211.03009_88b82755d9958656b2a7eae65eb89a7d": "\\cite{lane2010survey}",
        "2211.03009_df0fb717d880b5c65eccfb58e00ed022": "Most of such studies rely on using features captured from sensors in smartphones as proxies to personal attributes (mood, stress, etc.), behavior (eating, drinking, running, walking, etc.), and context (social context, semantic location, ambiance, etc.)",
        "2211.03009_8720aa36c5796bcaa54ab13e218660ce": "\\cite{meegahapola2020smartphone}",
        "2211.03009_0e221333926c3fd029b513d937af069e": "Hence, there are studies that infer aspects like mood",
        "2211.03009_fda172adbc212308649f465ccb2e8fbb": ", stress",
        "2211.03009_c34fe76ffb57bc76d093f09de57cbafc": "\\cite{lu2012stresssense, sano2013stress}",
        "2211.03009_9c4a18ae768495639dcdc6122293d7a3": ", depression",
        "2211.03009_915c33faae0fea39edbbd71d42b1f7d3": "\\cite{canzian2015trajectories, farhan2016behavior}",
        "2211.03009_2058cfc75b30dccb1e29d19aa4b4351b": ", eating behavior",
        "2211.03009_72c2b863df57eac9e681cacd132ac3e6": "\\cite{meegahapola2021one,biel2018bites}",
        "2211.03009_4fa6ebd98e27553bba6cb7d55f8f5b94": ", drinking behavior",
        "2211.03009_af088c178231616d1e886c64c3680a76": "\\cite{santani2018drinksense}",
        "2211.03009_36d269f61feacc3cf8d77f1bbcd2cd22": ", activity types",
        "2211.03009_60cbba5b4b0e8ef9895fec917019deee": "\\cite{morales2017physical}",
        "2211.03009_cb457d311fbe54a8aa862a7d9f05c62e": ", and social contexts",
        "2211.03009_61be4edb9ff868fafd592d686900231d": "\\cite{meegahapola2021examining, meegahapola2020alone}",
        "2211.03009_4d847f0cd4f6bb0eaa8fc082ceadd579": ", among many others",
        "2211.03009_aedfda4cade53bd6d9e4aea60b14513c": "If we specifically focus on mood-related studies, LiKamwa et al.",
        "2211.03009_17c24917ee086e5a9c90433e8fd8d297": "showed that the mood of individuals captured with the circumplex mood model could be inferred with an accuracy of 66",
        "2211.03009_3898954ec94c09102b774e0a4418fc3e": "with all user models (population-level), which can be increased up to 93",
        "2211.03009_e336f016924c2c8890cf5b17c1faf863": "using personalization (user-level) with a dataset collected from 32 individuals",
        "2211.03009_b77a69a622a926201936a028bacaf0c9": "They suggested that building hybrid models (partially personalized) would help overcome the drawbacks of both population-level and user-level models",
        "2211.03009_5638fbefdbab79b0a2a5d67d88db7670": "Servia-Rodríguez et al.",
        "2211.03009_b4e9944bd641954ff9f003bb75ed1f30": "collected a large-scale dataset of mood self-reports and passive sensing data from multiple countries",
        "2211.03009_cb050d4a26dac7b01295193570aad8e7": "They also showed that binary mood captured with the circumplex mood model could be inferred with an accuracy of 70",
        "2211.03009_972e9876a1973f64446b26bbd9378749": "with population-level models",
        "2211.03009_b65f937e6dfca43f1365a0ef03a4bce1": "Some studies examined mood instability derived using mood reports, with phone sensor data",
        "2211.03009_3631aca0599a735a3afbb0afb37ecffc": "\\cite{morshed2019prediction, zhang2019inferring}",
        "2211.03009_7bf8911650c0293f1228bcf0c2930391": "In our work, we look into inferring mood valence with population-level and hybrid models",
        "2211.03009_e47e9685fe0063a191ff29c4305ba6c5": "However, we are more interested in examining (a) the similarities and differences in mood models for different countries; and (b) the generalization of models to unseen countries, both of which have not been examined in prior work",
        "2211.03009_79ffbefe578d07e8be2c77ea2cf101ac": "Further, as Bardram et al.",
        "2211.03009_57c3a1ee55a84f57262764c6033dcc22": "highlighted, there is a lack of reproducibility and generalization of machine learning models across studies in this domain",
        "2211.03009_f6405e3fc509ee0dd052f5313ae64e77": "We believe the results presented in this study would be a step in the right direction for better awareness of these issues in examining the characteristics and generalization of smartphone sensing-based mood inference models across different geographical regions.",
        "2211.03009_45ff46d868bdb38d75fa89a38562a5cd": "Study Design, Data Collection, and Feature Extraction",
        "2211.03009_6efcbc235b3721756a1f95f6426af09a": "\\begin{figure}\n    \\includegraphics[width=\\textwidth]{images/diversity_mood_overview.pdf}\n    \\caption{High-level overview of the study.}\n    % \\Description{}\n    \\label{fig:overview}\n\\end{figure}",
        "2211.03009_2f67357b4bf46f6867b841f6b2d2ad76": "With a team representing computer science, social sciences, user experience design, and ethics from institutions in over ten countries, we designed an exploratory study and developed a mobile sensing application to collect passive smartphone sensing and self-report data from participants about their everyday life behavior and well-being",
        "2211.03009_3f8d7be6c886259a0eec234b6ff30f3a": "The ultimate goal of this deployment was to study their behavior, including aspects such as activity, social context, location, mood, and sleep quality from a mobile sensing standpoint and also to consider various diversity aspects that could potentially affect sensing-based inferences (ranging from geographical region and gender to personality and values)",
        "2211.03009_d0be9a5fd874bc76fd0aaab1949c1199": "The study is summarized in Figure",
        "2211.03009_67cae1cfc38e0a310127696fc7c3a8a3": "The study design consisted of two main components: (a) LimeSurvey component to collect survey responses during pre and mid-study phases; and (b) Mobile sensing app to collect sensor data and self-reports",
        "2211.03009_99ef51cf4db76e509c49d6503d8cc909": "A technical report regarding the study procedure and future plans for dataset access is available in",
        "2211.03009_d9f3c70be527d6eb6bf066517ad22db9": "\\cite{giunchiglia2022aworldwide}",
        "2211.03009_4021ee4f7f2ceb8033f0b86888e580df": "Survey Questionnaires",
        "2211.03009_ca0e721d45d878e1a3c1b36097e941e4": "Survey responses were captured from participants with three questionnaires sent to them before and during the pilot at three different times",
        "2211.03009_40314e505c2edd2c21043ebaffcb4f82": "This was done to ensure that the burden on participants was reasonable",
        "2211.03009_9d285ed93fc43dc534ae0cf1d37c15bd": "These questionnaires were administered through the LimeSurvey platform",
        "2211.03009_ce00b7dff6201f65489fcbe404495377": "\\cite{engard2009limesurvey}",
        "2211.03009_7a28d40b076019e5132a8f052886d24a": "Pre-Study Diversity Questionnaire",
        "2211.03009_fef9cda501692aeb26b0ee272ec904df": "The primary objective of this questionnaire was to capture diversity attributes of participants from different perspectives",
        "2211.03009_d71c7020ce0c03357a9cac3fbb7595c7": "As the first step, basic demographic information was captured, including gender, age, sex, degree program, and socioeconomic status",
        "2211.03009_5fddf88c58c98df72ea22498a80f0b07": "Then, in an attempt to capture the psychosocial profile, the 20-item Big Five Inventory (BFI)",
        "2211.03009_a1593c3e3bf2d528e30590cdb214309e": "\\cite{donnellan2006mini}",
        "2211.03009_0352cff7e859bea20c0f244316a2adf1": "and Basic Value Survey (BVS)",
        "2211.03009_434e2275b3dd029b6e064a6f46890893": "\\cite{gouveia2014functional}",
        "2211.03009_315c20917d582c67fe1ce19d26e30cd0": "were administered",
        "2211.03009_5e655b135614f9720d31a14baaaecaf1": "Finally, there were several questions regarding social relationships (virtual and real) and cultural consumption that they were interested in.",
        "2211.03009_20262e314742c673494dbb831c2b4202": "Mid-Study Questionnaire I and II",
        "2211.03009_cd952ecc2d9c081d11651d3012e98f5b": "The objective of the first questionnaire was to gather more detailed information about personality using the Jungian Scale on Personality Types",
        "2211.03009_1ef44087f6c9a1409c6c972a9e37a6fd": "\\cite{jung2016psychological}",
        "2211.03009_6048759ee2e4da70bc5617d08522fc22": "and Human Values Survey",
        "2211.03009_d3ead7150ca1438031390dc658d9352f": "\\cite{schwartz1994there}",
        "2211.03009_9d0de2aaafbccccd118a5a6ff54e6bfc": "In addition, questions regarding physical activity and sports, cooking and shopping habits, transport methodologies, and cultural activities were captured",
        "2211.03009_301310a388a8a0f905a3487b1a0ec796": "The second questionnaire consisted of the Multiple Intelligences Profiling Questionnaire",
        "2211.03009_65cfc378d28448a0bd14289701fa2c01": "\\cite{tirri2008identification}",
        "2211.03009_a186ce8e0bdca05a330622596241ba23": "This also contained several open-ended questionnaires about the mobile app user experience.",
        "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4": "Mobile Application",
        "2211.03009_495069d6f22648bf1bcb7f4a56e2dd86": "An Android mobile application was used to capture the everyday behavior of participants using short in-situ self-report questions",
        "2211.03009_89a17c99597560dba1239339d05f63b5": "The app was developed such that data would be stored in an SQLite database on the phone, and later when the phone is connected to a Wifi network, data would be uploaded to the main server and free up the local phone storage",
        "2211.03009_84b56574633f9882d8764bd16647c185": "In addition, the app could send push notifications by using Google Firebase as a notification broker",
        "2211.03009_24241f44ac26edef0778ded2f462f1de": "Hence, the three main components of the application are: (1) a push notification system that would send periodical reminders to participants to fill in self-reports; (2) mobile time diaries to capture self-reports; and (3) a smartphone sensing component to collect passive sensing data from multiple modalities.",
        "2211.03009_5673d2a98915f194c4574de1fbc3dd1e": "Push Notifications.",
        "2211.03009_03e9a41892a5f6a569102ab4ad30969c": "Given the nature of the study and the requirement to capture behavioral and situational data in a particular moment, the app sent reminders for participants to fill in in-situ self-reports regarding their everyday life behavior around 20 times throughout the day",
        "2211.03009_a63d4382fff675349461697f32dc2f3f": "In addition, start-of-the-day and end-of-the-day questionnaires were administered at the beginning and end of the day",
        "2211.03009_f7564127ef84f83fb8eaf5563bd3f9a2": "When a notification was not clicked and a participant did not complete the self-report within two hours, the notification expired, and a new notification would be sent later",
        "2211.03009_8490f305594660b5255f5f4bb5d52ff3": "This allowed to keep track of participant compliance (e.g., how many self-reports were answered from the total number of notifications sent).",
        "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d": "Time Diaries and Start/End-of-the-Day Questionnaires.",
        "2211.03009_c0efc6b32659b441f847377e646c905c": "The start-of-the-day questionnaire was sent to participants at 8 am each day",
        "2211.03009_cee11e2b813dcbc50dbddde03053004d": "It only had two questions with five-point likert scales (very good to very bad): (i) sleep quality; and (ii) expectations about the day",
        "2211.03009_0689ec10825b4eccfab66dea69879029": "The end-of-the-day questionnaire was sent to participants at 10 pm and asked them (a) to rate their day (five-point likert scale; very good to very bad); (b) if they had any problems during the day (open response), and (c) how did they solve them (open response)",
        "2211.03009_74363a68d510937d65d84a496e579cb4": "The time diary was sent to users once every 30-60 minutes",
        "2211.03009_d568332a5dd7235411903da2ecb2eda9": "While this allowed capturing longitudinal behavior granularly, it also introduced user burden",
        "2211.03009_b280c82ea4692eaf19a5f7ade1d878b8": "Therefore, the time diary was designed to minimize user burden and reduce completion time",
        "2211.03009_6a9a4c49c1b6742a904c04fcfa4d2e11": "Hence, after several iterations of discussions, only four questions were included in this component: (i) current activity: 34 activities including eating, working, attending a lecture, etc.; (ii) semantic location: 26 categories including home, workplace, university, restaurant, etc.; (iii) social context: 8 categories including alone, with the partner, family member/s, friends, etc.; and (iv) current mood: five-point likert scale to capture the valence of the circumplex mood model",
        "2211.03009_585de41a34edabc468132c8a2aab2148": "\\cite{russell1980circumplex}",
        "2211.03009_830fc0c781573ddb13c877ba73dc3cb9": "similar to LiKamwa et al.",
        "2211.03009_9f5fe612f28ba3abf2ca850dcfdffcfe": ", with an emoji-scale",
        "2211.03009_98a6a61c9ab16bb96fad18a864d68c10": "As explained in Section",
        "2211.03009_0273a1d53731c8408a2bb07ffe044625": ", this is the variable we chose as this paper's primary focus.",
        "2211.03009_3950ed8ca69b1282117ad082939bebda": "\\begin{table*}\n    \\caption{\\textcolor{red}{Summary of 105 features extracted from sensing data, aggregated around activity self-reports using a time window. A detailed description about sensing modalities is provided in Appendix A.}}\n    \\label{tab:agg-features}\n    %\\centering\n    \\begin{tabular}{{p{0.139\\linewidth}p{0.11\\linewidth}p{0.725\\linewidth}}}\n        \n        \\cellcolor[HTML]{EDEDED}\\textbf{Modality} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{Frequency} &\n        \\cellcolor[HTML]{EDEDED} \\textbf{Features and Description}\n        \\\\\n        \n        \n        \\makecell[l]{Location} & \n        \\makecell[l]{1 sample \\\\per minute} & \n        \\makecell[l]{radius of gyration, distance traveled, mean altitude} \\\\\n\\arrayrulecolor{Gray}\n    \\midrule\n    \n        \\makecell[l]{Bluetooth \\\\{[}low energy, \\\\normal{]}} &\n        \\makecell[l]{1 sample \\\\per minute} & \n        \\makecell[l]{number of devices (the total number of unique devices found), mean/std/min/max \\\\rssi (Received Signal Strength Indication -- measures how close/distant other \\\\devices are)} \\\\\n        \n        \n\\arrayrulecolor{Gray}\n    \\midrule\n    \n        \\makecell[l]{WiFi} & \n        \\makecell[l]{1 sample \\\\per minute} & \n        \\makecell[l]{connected to a network indicator, number of devices (the total number of unique \\\\devices found), mean/std/min/max rssi} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n    \n        \\makecell[l]{Cellular {[}GSM, \\\\WCDMA, LTE{]}} & \n        \\makecell[l]{1 sample \\\\per minute} & \n        \\makecell[l]{number of devices (the total number of unique devices found), mean/std/min/max \\\\phone signal strength} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n    \n        \\makecell[l]{Notifications} & \n        \\makecell[l]{on change} & \n        \\makecell[l]{notifications posted (the number of notifications that came to the phone), \\\\notifications removed (the number of notifications that were removed by the \\\\user) -- these features were calculated with and without duplicates.} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n    \n        \\makecell[l]{Proximity} & \n        \\makecell[l]{10 samples \\\\per second} & \n        \\makecell[l]{mean/std/min/max of proximity values} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n        \\makecell[l]{Activity} & \n        \\makecell[l]{2 samples \\\\per minute} & \n        \\makecell[l]{time spent doing activities: still, in\\_vehicle, on\\_bicycle, on\\_foot, running, tilting, \\\\walking, other (derived using the Google activity recognition API \\cite{GoogleActivity2022})} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n        \\makecell[l]{Steps} & \n        \\makecell[l]{10 samples \\\\per second \\\\ or on change} & \n        \\makecell[l]{steps counter (steps derived using the total steps since the last phone turned on \\\\at 10 samples per second), steps detected (steps derived using event triggered for \\\\each new step captured on change)} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n        \\makecell[l]{Screen events} &\n        \\makecell[l]{on change} & \n        \\makecell[l]{number of episodes (episode is from turning the screen of the phone on until the \\\\screen is turned off), mean/min/max/std episode time (a time window could have \\\\multiple episodes), total time (total screen on time within the time window)} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n        \\makecell[l]{User presence} &\n        \\makecell[l]{on change} & \n        \\makecell[l]{time the user is present using the phone (derived using android API that indicate \\\\whether a person is using the phone or not)} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n        \\makecell[l]{Touch events} &\n        \\makecell[l]{on change} & \n        \\makecell[l]{touch events (number of phone touch events)} \\\\\n        \n\\arrayrulecolor{Gray}\n    \\midrule\n        \\makecell[l]{App events} & \n        \\makecell[l]{10 samples \\\\per minute} & \n        \\makecell[l]{time spent on apps of each category derived from Google Play Store \\cite{likamwa2013moodscope, santani2018drinksense}: \\\\action, adventure, arcade, art \\& design, auto \\& vehicles, beauty, board, books \\& \\\\\n        reference, business, card, casino, casual, comics, communication,\n        dating,\\\\education, entertainment, finance, food \\& drink, health \\&\n        fitness, house, lifestyle,\\\\maps \\& navigation, medical, music, news \\&\n        magazine, parenting, personalization, \\\\photography, productivity,\n        puzzle, racing, role playing, shopping, simulation, \\\\social, sports,\n        strategy, tools, travel, trivia, video players \\& editors, weather, word, \\\\ not\\_found}   \\\\\n        \n        \n        \\hline\n    \\end{tabular}\n\\end{table*}",
        "2211.03009_1a51fba8d166789d4ea99920df72015f": "Sensor Data and Features",
        "2211.03009_b25fae92c78d9ffa0316edad6ddf3db1": "The app collected sensor data from a range of sensors passively",
        "2211.03009_c50f3492787c223b1a7980fdb8f5bf5a": "Hence, sensor data included continuous sensing modalities such as accelerometer, gyroscope, ambient light, location, magnetic field, pressure, activity labels generated by the google activity recognition API, step count, proximity, and available Wi-Fi and bluetooth devices",
        "2211.03009_6ac52f18b5dcb8ce31c659c5c23462b3": "Interaction sensing modalities included application usage, typing and touch events, on/off screen events, user presence, and battery charging events",
        "2211.03009_4193ff63e50333d05767da84f5763d53": "The modalities and features crafted from each modality are summarized in Table",
        "2211.03009_456d6f324985400021ee02660f04a36b": "In feature engineering, interpretability was a key factor as all the features were defined in a meaningful manner",
        "2211.03009_2de9413bf988804f4e12bd11a446aab0": "Similar to prior work in ubicomp, we used a time window-based approach for matching sensor data to self-reports",
        "2211.03009_477a7e1af0e8cf2dfa1234a0f0c93d8e": "\\cite{servia2017mobile, likamwa2013moodscope, meegahapola2021one}",
        "2211.03009_ed388ca25ae05cf11d6dee8de27f63b4": "While different time windows can be chosen based on the application scenario, this paper presents results with a dataset created using a time window of 10 minutes",
        "2211.03009_31566d43272af3f5d2365b9319be58f2": "Hence, if the self-report regarding mood occurred at time",
        "2211.03009_2f118ee06d05f3c2d98361d9c30e38ce": "$T$",
        "2211.03009_d19a06fb1c097f46d536472d6f15f394": ", sensor data would be considered from",
        "2211.03009_8f6b3305f414e69b6aeae338a6f1f3b9": "$T-5$",
        "2211.03009_aadb61f5ce4bef9f58b9fbccaed36958": "minutes to",
        "2211.03009_c869f5c784d6a7566f98158787490be0": "$T+5$",
        "2211.03009_640fd0cc0ffa0316ae087652871f4486": "minutes",
        "2211.03009_0f164aef149dd4ed1fc89cc5dd0cbcbc": "However, we also considered other time windows, such as 2, 4, 15, and 20 minutes",
        "2211.03009_d9cdea392375bd7618fe076b93792ee5": "Results showed that the 10-minute time window performed better for this task",
        "2211.03009_32c6e843b49494836ab9ed69a495506e": "This could be because shorter time windows do not capture enough behaviors and contexts around self-reports to make a meaningful prediction regarding mood",
        "2211.03009_1eef7c7d9faace3e296df856e909199b": "Prior work has shown that larger time windows can capture a high amount of information about user behaviors",
        "2211.03009_1a0a2e275c940ef509e4819da5c06e0e": "\\cite{bae2017detecting}",
        "2211.03009_53e1ecc37b1e04f1eb71ab58104dc9d0": "However, we can not use very large windows above 20 minutes because it would lead to a situation where sensor data segments for self-reports might get overlapped, leading to data overlap between samples",
        "2211.03009_cb11352fcaea6151d660f29f089ce001": "Therefore, throughout the paper, we present results with a ten-minute time window",
        "2211.03009_395ebe4eb036fac01ea8c30fff40836e": "In addition, in this paper, we do not discuss why each sensing modality was chosen and how features were derived",
        "2211.03009_960424f6f7fc164915ca56b1f5f401c9": "This is because such details have been discussed extensively in many prior studies on mobile sensing for health and well-being",
        "2211.03009_0739a7f0161d5e747a1da0958d78828c": "\\cite{servia2017mobile, khwaja2019modeling, santani2018drinksense, likamwa2013moodscope, meegahapola2021one, bae2017detecting, biel2018bites, wang2014studentlife, meegahapola2020smartphone}",
        "2211.03009_368f46984b7e507bd8bfdf666efe5330": "Participant Recruitment and Deployment",
        "2211.03009_06db71b1c5c39c829e951190f5f7f1aa": "The primary objective of this study was to capture data from diverse student populations",
        "2211.03009_9247de8259c96d06996bf93df19ec890": "While many facets of diversity could be captured by experimenting within the same country, it is difficult to study geographical diversity in such a way",
        "2211.03009_0eb24e16362eb6d9f964dd0a6b8bcf3c": "Hence, we conducted mobile sensing experiments in eight countries representing Europe, Asia, and Latin America",
        "2211.03009_8d4cc30fca5a408903549096d554d719": "Details regarding the data collection are mentioned in Table",
        "2211.03009_6b6cb39acc14ed810fe6c3a41c2bfe18": "According to prior work in mobile sensing, many studies have focused on Europe and North America, but not much research has been conducted in other world regions",
        "2211.03009_d19e9a5f0e90fd44120574059d665c19": "\\cite{meegahapola2020smartphone, phan2022mobile}",
        "2211.03009_928c8b0e707f80e7e488d35b123a29f4": "Hence, conducting the same study with the same protocol in multiple countries allows to study mood inference models and geographical diversity in a novel sense",
        "2211.03009_d4913d3efd9a531592ae2d140d7905f6": "The study was conducted in the following phases.",
        "2211.03009_3087aea5e533ebde1045ad5fd06eb49f": "Translation and Adaptation",
        "2211.03009_8ca256cbf6793428fe2498163461159d": "In this phase, each site received the English version of the questionnaires and the app, including time diaries and the list of sensors to be collected",
        "2211.03009_ceab50459921c4fe0b0d410f8706bad8": "These tools were evaluated and adapted, in coordination with all the partners, to the specific context (e.g., invitation letters, type and amount of incentives for the participants of the mobile app, privacy and ethics documentation, etc.)",
        "2211.03009_04cc4cfae0c2b0434104b8e2b1647a7d": "Some countries made minimal changes to better adapt the questionnaire to the local situation or academic organization",
        "2211.03009_ea40371d24f176dcf68d391119c075a5": "Concerning the standard scales mentioned above, the translations were completed by a forward translator from the original English version and then validated back via panel and back-translation processes by independent translators",
        "2211.03009_78846b74fff6829d60fdc98ac36e2994": "In addition, whenever a validated questionnaire translation was available, we used it (e.g., the Big five traits questionnaire is readily available in several languages)",
        "2211.03009_a206c7e4bb9813dd4a8d31aed6f045cb": "After translation and adaptation, the tools were tested locally",
        "2211.03009_31958a60dfd0620c050c2b21b30b96d8": "A first test was conducted to check and validate the translations and evaluate the tools' usability",
        "2211.03009_ee92933a3a0f3e8a154d43d018359e39": "A second test was conducted by sending the questionnaires to a small sample of participants, both project partners and students from various universities",
        "2211.03009_5584ac8a359f48edc7b9296f5dc0cce3": "As far as questionnaires were concerned, approximately 30 participants were involved",
        "2211.03009_46ef091e27829da495e00ee40cd4a436": "This test was also used to ascertain the completion times",
        "2211.03009_92915556be38bdb2c16ce02a21d6027c": "Concerning the mobile app, a two-week validation test was carried out.",
        "2211.03009_a0454ca3429f151e82e372de7a697869": "Invitations, Pre-Study Diversity Questionnaire, and Participants",
        "2211.03009_f2c4d7cf068b5d04fbdefee931d048f9": "This was the first of the three phases of the data collection",
        "2211.03009_eb308966b92ec2d5a2be2c50c4892024": "This phase started by sending an email containing the survey description, the invitation to the first questionnaire, and information on the second part of the data collection (sensing component) via university mailing lists",
        "2211.03009_b78b6df36f8052c99b682fcb335eac82": "This invitation was then reiterated through four weekly reminders to all students who still needed to complete the survey",
        "2211.03009_07a8794ab35dddcce204ff0ea2665841": "Over 20000 college students were contacted with mailing lists in the initial recruitment phase",
        "2211.03009_69d9d23b654d11b243ff1c94839cd610": "Out of the set of people who were contacted, 13398 participants filled in the pre-study diversity questionnaire",
        "2211.03009_11685338ab7cadd6973f9255b35b865b": "Then, a subset of the eligible participants was selected to participate in the second part of the study, which was done with the mobile app",
        "2211.03009_63abc75feb518f8bf8a15d287b818e58": "The requirements for the selection were two-fold: (i) having consented to the processing of personal data",
        "2211.03009_033d3fa96012fc6e218f4cd82c569195": "this required participants agreeing to release mobile data collected during the study after anonymization; and (ii) owning an Android smartphone compatible with the app.",
        "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3": "Mid-Study Questionnaire I, II and Mobile Sensing app",
        "2211.03009_ecbde8d121e0152245c745246613f0b2": "Of all the participants who completed the pre-study diversity questionnaire, 678 participants were chosen for the next phase with the mobile sensing app",
        "2211.03009_7e7dc04814b24a5674fc03a58f127ede": "This deployment was done between September and November 2020",
        "2211.03009_5a074ab51a59f138bbdbd4b0ef7d0acd": "The average age of study participants was 24.2 years (SD: 4.2), and the cohort had 58",
        "2211.03009_d8698f3558c99e12653404bd3adaa915": "females",
        "2211.03009_3f66c2f9362a9c2c892d1040ea64d9fb": "They were sent emails with a specification manual to download and install the mobile sensing app",
        "2211.03009_a47661cc32cc9246aa20d23ccc219129": "In addition, the participants completed the mid-study questionnaire I. Reminders were sent after one week for participants who still needed to complete the questionnaire",
        "2211.03009_bd37be2f811211412b963e22d1024ebb": "Then, participants completed time diaries, and sensing data were passively collected in the mobile app",
        "2211.03009_ae99e9f864bfc442d46b10a41b0aa2f2": "After two weeks of mobile sensing app usage, the mid-study questionnaire II was sent to participants via email",
        "2211.03009_085de4b9ce51c4413d4fd5246ff1430f": "After sending out this questionnaire, two more weeks of mobile sensing data collection were conducted",
        "2211.03009_26c463bd369bc3c6aaf864f480cefd12": "Daily reports were produced to facilitate monitoring the time diary survey and identify possible problems, including: (1) the number of notifications each participant responded to; and (2) the amount of data collected by the individual sensors",
        "2211.03009_ff0d9c0ae114d36d70f7edc3f4a8a406": "Using this information, local field supervisors could contact the inactive participants every three days and support them as needed",
        "2211.03009_2e1c58565751930d1c002c96ea2a98d8": "A further element of contact was the daily sending of the results of a daily prize, which was an additional incentive for participants",
        "2211.03009_1078dfeaaa5cc39b04330a9774e47e95": "Finally, this paper will only focus on the mood variable captured during the study, and deeper analyses around other questionnaires captured with pre-study, mid-study I, and mid-study II questionnaires will be done in future publications with different scopes.",
        "2211.03009_e52d15ea4e9280bf255ba22f558aab20": "\\begin{table}\n    \\caption{Participants of the mobile sensing data collection (countries named in alphabetical order).}\n    \\label{tab:num-participants}\n    \\centering\n    \\begin{tabular}{llrrrr}\n        \n        \n        \\cellcolor[HTML]{EDEDED}\\textbf{Country} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{University} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{Participants} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{$\\mu$ Age ($\\sigma$) } &\n        \\cellcolor[HTML]{EDEDED}\\textbf{\\% Women} &\n        \\cellcolor[HTML]{EDEDED} \\textbf{\\# Self-Reports }\n        \\\\\n         \n        \n        China &\n        %Anonymized &\n        Jilin University &\n        41 &\n        26.2 (4.2) & \n        51 &\n        22,289\n        \\\\\n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        Denmark &\n        %Anonymized &\n        Aalborg University &\n        24 &\n        30.2 (6.3) & \n        58 &\n        10,010\n        \\\\\n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        India &\n        %Anonymized &\n        Amrita Vishwa Vidyapeetham &\n        39 &\n        23.7 (3.2) & \n        53 &\n        4,233\n        \\\\\n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        Italy &\n        %Anonymized &\n        University of Trento &\n        240 &\n        24.1 (3.3) &\n        58 &\n        151,342\n        \\\\ \n        \n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        Mexico &\n        %Anonymized &\n        \\makecell[l]{Instituto Potosino de Investigación\\\\ Científica y Tecnológica} &\n        20 &\n        24.1 (5.3) & \n        55 &\n        11,662\n        \\\\\n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        Mongolia &\n        %Anonymized &\n        National University of Mongolia &\n        214 &\n        22.0 (3.1) &\n        65 &\n        94,006\n        \\\\\n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        Paraguay &\n        %Anonymized &\n         \\makecell[l]{Universidad Católica \\\\\"Nuestra Señora de la Asunción\"} &\n        28 &\n        25.3 (5.1) &\n        60 &\n        9,744\n        \\\\\n        \n        \\arrayrulecolor{Gray}\n        \\hline\n        \n        UK &\n        %Anonymized &\n        \\makecell[l]{London School of Economics\\\\ \\& Political Science} &\n        72 &\n        26.6 (5.0) & \n        66 &\n        26,688\n        \\\\\n        \n        \n        \n        \\cellcolor[HTML]{EDEDED}\\textbf{Total/Mean} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{678} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{24.2 (4.2)} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{58} &\n        \\cellcolor[HTML]{EDEDED}\\textbf{329,974} \n        \\\\\n        \n    \\end{tabular}\n    \n%\\vspace{-0.2 in}\n\\end{table}",
        "2211.03009_48452539f0e4eb44c328eb58e150bc9b": "Incentive Design",
        "2211.03009_b5f5035cbf36e645e1e198537260fd5a": "An incentive scheme was designed to motivate participants to complete time diaries and provide sensing data",
        "2211.03009_c883b3d43d6134ebfd0925db6f9c4075": "Incentives included monetary prizes for participants who completed at-least 85",
        "2211.03009_43fcb00d5037f956529aaf835512e571": "of time diaries (e.g., 20 Euro in Italy, 150 Kr in Denmark, etc.), cash prizes for multiple daily winners randomly chosen from each pilot (e.g., five winners were given a prize of 5 Euro in Italy, 5 MNT in Mongolia, etc.)",
        "2211.03009_91bf8878dd3cb63e088a09d757224e0e": "In the end, three winners from each country were randomly chosen for a larger prize (e.g., 150 Euros per person in Italy, 150 Sterling Pounds in the UK, etc.)",
        "2211.03009_14a34c08521eb91f596ab7b7c0afa960": "Incentives in all countries were designed by considering each country's socioeconomic status and expecting all participants to be compensated and motivated equally.",
        "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca": "Ethical Procedures",
        "2211.03009_07fc4be2f69877763c7de3b8690cc9f0": "All the survey activities and results at each site comply with the national ethical privacy-protecting laws and guidelines, hence getting approvals from respective ethical review boards",
        "2211.03009_9ccfaa46fce9dd05306dea32051d6614": "In addition, all the experiments, including non-European pilots, were compliant with the General Data Protection Regulation (GDPR)",
        "2211.03009_4c2905aabb0f5f953a18cab851b5d636": "\\cite{voigt2017eu}",
        "2211.03009_e219277a83c1da4af1199dda698746f8": "Additionally, for non-European experiments, the activities and results have been developed to comply with those of a European country for compliance purposes",
        "2211.03009_0a7188ce7947b679683b5e0090e2b322": "More specifically, Italian legislation was selected as the reference.",
        "2211.03009_1049e007fa59df903167e9cfbc470aef": "Behavioral and Contextual Characteristics Around Mood Reports Extracted from Sensor Data and Self-Reports (RQ1)",
        "2211.03009_be81ae1119a12bd07c2b2207490dba32": "\\begin{figure*}[t]\n\\begin{center}\n\n    \\begin{subfigure}[t]{0.49\\textwidth}\n        \\centering\n        \\includegraphics[width=\\textwidth]{images/data_distribution_5_class_v3.png}\n        \\caption{Five-class mood distribution}\n        \\label{fig:five_class_moods}\n    \\end{subfigure}\n    \\hfill \n    \\begin{subfigure}[t]{0.49\\textwidth}\n        \\centering\n        \\includegraphics[width=\\textwidth]{images/data_distribution_2_class_v3.png}\n        \\caption{Two-class mood distribution}\n        \\label{fig:two_class_moods}\n    \\end{subfigure}\n    \\caption{Summary of self-reported mood distributions.}\n    \\label{fig:mood_distributions}\n\\end{center}\n\\vspace{-0.25 in}\n\\end{figure*}",
        "2211.03009_e8c72146788910c54a3e471c8125ce90": "\\begin{figure*}[t]\n\\begin{center}\n\n    \\begin{subfigure}[t]{0.33\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/all_percent_hourly.png}\n        \\caption{All}\n        \\label{fig:hourly_all}\n    \\end{subfigure}\n    \\hfill \n    \\begin{subfigure}[t]{0.33\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/happy_percent_hourly.png}\n        \\caption{Positive}\n        \\label{fig:hourly_positive}\n    \\end{subfigure}\n    \\hfill \n    \\begin{subfigure}[t]{0.33\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/sad_percent_hourly.png}\n        \\caption{Negative}\n        \\label{fig:hourly_negative}\n    \\end{subfigure}\n    \n    \\caption{\\textcolor{red}{Distribution of self-reported moods for 24 hours of the day.}}\n    \\label{fig:hourly_distributions}\n\\end{center}\n\\vspace{-0.2 in}\n\\end{figure*}",
        "2211.03009_666df2f48cd16f38212c093999248769": "Figure",
        "2211.03009_c7f5173eb49ead5a7869ba0d161fcd29": "shows the distribution of mood labels for the eight countries",
        "2211.03009_175a86e3ace994ad93a601c9547327fa": "We observed fewer labels for the ‘negative’ and ‘very negative’ classes compared to the ‘neutral’, ‘positive’, and ‘very positive’ classes",
        "2211.03009_1071f01918a5d64a129a0b44e5ea7af4": "As shown in Figure",
        "2211.03009_1d28ba8c4fdb4a056e93ba80a70b3a37": ", except for China, where there were more ‘very positive’ reports than ‘positive’ or ‘neutral’ reports, all other countries had ‘positive’ as the majority label",
        "2211.03009_cb19dbc32b1649e84133212409b52563": "This behavior of skewed reporting is common in studies about valence",
        "2211.03009_b2c925867dbc485068a4ea91c396c9d1": "Furthermore, we plot the hourly distribution of mood reports in Figure",
        "2211.03009_18c8732f190a96d84c94188b3fda4d91": "According to Figure",
        "2211.03009_b47d06934be25d35b94b8e89bf7b5228": ", across all countries, we could see more self-reports in the morning compared to the afternoon or evening",
        "2211.03009_21a26d7e7075722dea1eee2cdca93f8c": "However, Figure",
        "2211.03009_5232776d9f7419292bd9cd5281bb59b6": "shows that most self-reports around morning are for the positive valence",
        "2211.03009_b2cc3cc2a21983c75825c388b92acc13": "This means that users had a more positive mood after waking up and around the morning",
        "2211.03009_5f7a86f3c315a9f68ce88aa64e9250ea": "Interestingly, we also observed that the curve for Mongolia indicates late sleep and late wake-up, according to reports, which the partner institution later confirmed to be consistent with the routines of students in the country",
        "2211.03009_b474aedeeace1da25bacf91be42f7d67": ", we also noticed that negative valence reports increase with time in most countries",
        "2211.03009_bc67ae4fa4cfb7cc26a67bc21b6f00f5": "This is in line with prior studies about mood and stress levels increasing with the time of the day",
        "2211.03009_9eeac81dcb07318976a5c540565d1ffc": "\\cite{mislove2010pulse}",
        "2211.03009_c95ac75011d83fad81c542ab5538533a": "As mentioned in Section",
        "2211.03009_b92e86dd0caaea36a95ad072acf09346": ", participants' social context and semantic location labels were captured with time diaries, in addition to mood",
        "2211.03009_ad8ab65f4af3bec8989e643f65ed803a": "So, in the sub-figures of Figure",
        "2211.03009_b08e025c4204f66e1dba058e53b98914": ", we show the distributions of social context (alone or not) and location context (home or away) for positive and negative moods",
        "2211.03009_193bd11cc5c1a38ab7345fab5e4d1910": "These two aspects were chosen because prior work has shown that being alone and being away from home could affect mental well-being and behavior",
        "2211.03009_66c8ad0c6ea82d6baabd3070986db6b5": "\\cite{patel2007mental, rickwood2007and, shattell2010occupational, meegahapola2021examining}",
        "2211.03009_66fa4944d6f4f7c9e3c7a7818a2a2b7c": "In the figure, on the X-axis, the eight countries are shown",
        "2211.03009_305a1bc92db8a0bfea479b1bb11863c2": "On the Y-axis, the percentage of self-reports is shown",
        "2211.03009_9d2df0a6f59e37d4e1e8db3beb926932": "Regarding location, except in China, in all other countries, most mood reports were captured when participants were home",
        "2211.03009_43ea6220b772639c3f3c3af3e6b2664f": "Please note that the data was collected in the Fall of 2020, during the covid pandemic",
        "2211.03009_ca200516178dc61c5f9dd8561bcbd189": "so participants spent a significant amount of time at home",
        "2211.03009_c01277832e04aecb44b72feaab907d58": "The more interesting aspect is the difference in the percentages for Positive and Negative moods: that is when comparing Figure",
        "2211.03009_d016197b86ff91d04652b49e5778a9e4": "and Figure",
        "2211.03009_8f1c2c2ffcd4b2c82de3273cf598f043": "The highest difference was in Mongolia, where 67",
        "2211.03009_f378c6ef2c442c67e708a782d112b7f2": "of negative moods were reported at home out of all negative reports",
        "2211.03009_78bf75fd3a322b57796a6bbc3aef4329": "In contrast, 90",
        "2211.03009_a95f76432a5690399278831e382e1d04": "of positive moods were reported when at home, out of all positive reports",
        "2211.03009_2377c54d46b44c56fde64f72678bf57e": "This means that in Mongolia, participants reported a higher proportion of negative reports when away from home",
        "2211.03009_c207bbedea834aa7f3a221816d04eed6": "This is a difference of 23",
        "2211.03009_a437f9880cf97aed497b2fc27a2c64ee": "The difference is the lowest in Mexico",
        "2211.03009_2f6264d1274d52379a60cd8d0f67cb4a": "For social context, the highest difference was found in the UK, where 87",
        "2211.03009_62834b202a9f105d7d57edb2cafbf523": "of negative reports were done when alone",
        "2211.03009_7b8b56463fd366992ae9be3a64c83fc5": "In contrast, only 68",
        "2211.03009_93e4c06e0b6ed69396b44670177b3273": "of positive reports were done when alone, indicating that in the UK, people tend to report more negatively when alone",
        "2211.03009_3830e9ebfa1e8fe78d82c4c33599b8ac": "The trend is similar in all other countries except China and Denmark, where proportionally more people reported that they are alone when having positive moods.",
        "2211.03009_6b84b58cb7030a07f6ec235902bcd063": "\\begin{figure*}[t]\n\\begin{center}\n\n    \\begin{subfigure}[t]{0.24\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/neg_vs_lc.png}\n        \\caption{\\centering Location context for negative mood.}\n        \\label{fig:neg_vs_lc}\n    \\end{subfigure}\n    \\hfill \n    \\begin{subfigure}[t]{0.24\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/pos_vs_lc.png}\n        \\caption{\\centering Location context for positive mood.}\n        \\label{fig:pos_vs_lc}\n    \\end{subfigure}\n    \\hfill \n    \\begin{subfigure}[t]{0.24\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/neg_vs_sc.png}\n        \\caption{\\centering Social context for negative mood.}\n        \\label{fig:neg_vs_sc}\n    \\end{subfigure}\n    \\hfill \n    \\begin{subfigure}[t]{0.24\\textwidth}\n        \\centering\n        \\includegraphics[width=1.125\\textwidth]{images/pos_vs_sc.png}\n        \\caption{\\centering Social context for positive mood.}\n        \\label{fig:pos_vs_sc}\n    \\end{subfigure}\n\n    \n    \\caption{Location and social context distributions for negative and positive mood.}\n    \\label{fig:mood_vs_context}\n\\end{center}\n\\vspace{-0.2 in}\n\\end{figure*}",
        "2211.03009_12ce857508d2a4af7ccd8935c075d9c7": "\\begin{table}\n    \\caption{t-statistic (TS) (p-value > 0.05 : *) and Cohen's-d (CD) (all features reported here had 95\\% confidence intervals not overlapping with zero) for positive, neutral, and negative moods for each country.}\n    \\label{tab:tstatistics}\n    \\resizebox{\\textwidth}{!}{%\n    \\begin{tabular}{l l r r l r r l r r}\n     \n     &\n     \\multicolumn{3}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Positive}} &\n     \\multicolumn{3}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Neutral}} &\n     \\multicolumn{3}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Negative}} \n     \\\\\n\n    & \n    &\n    \\textit{TS} &\n    \\textit{CD} &\n    &\n    \\textit{TS} &\n    \\textit{CD} &\n    &\n    \\textit{TS} &\n    \\textit{CD} \n    \\\\\n    \n    \n    %\n    % CHINA\n    %\n    \n    \\multirow{5}{1.1cm}{China} &\n    location altitude min & %HAPPY\n    10.43 & % HAPPY: t-statistic and p-value\n    0.16 & % HAPPY: cohen's-d and confidence interval\n    \n    proximity std & % NORMAL\n    11.51 & % NORMAL: t-statistic and p-value\n    0.17 & % NORMAL: cohen's-d and confidence interval\n    \n    app health \\& fitness & % SAD\n    5.03 & % SAD: t-statistic and p-value\n    0.08 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi connected &\n    7.98 & % HAPPY: t-statistic and p-value\n    0.11 & % HAPPY: cohen's-d and confidence interval\n    \n    location speed mean&\n    7.81 & % NORMAL: t-statistic and p-value\n    0.11 & % NORMAL: cohen's-d and confidence interval\n    \n    app music \\& audio &\n    4.52 & % SAD: t-statistic and p-value\n    0.13 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    app communication &\n    7.95 & % HAPPY: t-statistic and p-value\n    0.11 & % HAPPY: cohen's-d and confidence interval\n    \n    app health \\& fitness &\n    7.61 & % NORMAL: t-statistic and p-value\n    0.09 & % NORMAL: cohen's-d and confidence interval\n    \n    location speed min &\n    3.71 & % SAD: t-statistic and p-value\n    0.15 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    screen \\# of episodes &\n    5.56 & % HAPPY: t-statistic and p-value\n    0.08 & % HAPPY: cohen's-d and confidence interval\n    \n    app tools &\n    7.31 & % NORMAL: t-statistic and p-value\n    0.10 & % NORMAL: cohen's-d and confidence interval\n    \n    location speed mean &\n    3.34 & % SAD: t-statistic and p-value\n    0.15 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    app lifestyle &\n    5.15 & % HAPPY: t-statistic and p-value\n    0.08 & % HAPPY: cohen's-d and confidence interval\n    \n    app personalization &\n    6.87 & % NORMAL: t-statistic and p-value\n    0.10 & % NORMAL: cohen's-d and confidence interval\n    \n    proximity mean &\n    2.81 & % SAD: t-statistic and p-value\n    0.12 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \\arrayrulecolor{Gray}\n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % DENMARK\n    %\n    \n    \\multirow{5}{1.1cm}{Denmark} &\n    app not found & %HAPPY\n    24.17 & % HAPPY: t-statistic and p-value\n    0.62 & % HAPPY: cohen's-d and confidence interval\n    \n    touch \\# of events & % NORMAL\n    28.91 & % NORMAL: t-statistic and p-value\n    0.56 & % NORMAL: cohen's-d and confidence interval\n    \n    app puzzle & % SAD\n    8.76 & % SAD: t-statistic and p-value\n    0.19 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    activity onbicycle &\n    12.88 & % HAPPY: t-statistic and p-value\n    0.35 & % HAPPY: cohen's-d and confidence interval\n    \n    app video players/editors &\n    28.91 & % NORMAL: t-statistic and p-value\n    0.11 & % NORMAL: cohen's-d and confidence interval\n    \n    app music \\& audio &\n    7.32 & % SAD: t-statistic and p-value\n    0.29 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi \\# of devices &\n    9.93 & % HAPPY: t-statistic and p-value\n    0.24 & % HAPPY: cohen's-d and confidence interval\n    \n    app weather &\n    9.73 & % NORMAL: t-statistic and p-value\n    0.16 & % NORMAL: cohen's-d and confidence interval\n    \n    screen std episode &\n    4.07 & % SAD: t-statistic and p-value\n    0.25 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    proximity mean &\n    9.89 & % HAPPY: t-statistic and p-value\n    0.27 & % HAPPY: cohen's-d and confidence interval\n    \n    app personalization &\n    9.35 & % NORMAL: t-statistic and p-value\n    0.23 & % NORMAL: cohen's-d and confidence interval\n    \n    app lifestyle &\n    3.84 & % SAD: t-statistic and p-value\n    0.11 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi std rssi &\n    9.72 & % HAPPY: t-statistic and p-value\n    0.24 & % HAPPY: cohen's-d and confidence interval\n    \n    activity still &\n    8.83 & % NORMAL: t-statistic and p-value\n    0.22 & % NORMAL: cohen's-d and confidence interval\n    \n    app social &\n    3.21 & % SAD: t-statistic and p-value\n    0.18 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % INDIA\n    %\n    \n    \\multirow{5}{1.1cm}{India} &\n    noti posted w/o duplicates & %HAPPY\n    6.65 & % HAPPY: t-statistic and p-value\n    0.34 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi min rssi & % NORMAL\n    8.12 & % NORMAL: t-statistic and p-value\n    0.44 & % NORMAL: cohen's-d and confidence interval\n    \n    app business & % SAD\n    4.17 & % SAD: t-statistic and p-value\n    0.22 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi \\# of devices &\n    6.59 & % HAPPY: t-statistic and p-value\n    0.34 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi mean rssi &\n    6.31 & % NORMAL: t-statistic and p-value\n    0.38 & % NORMAL: cohen's-d and confidence interval\n    \n    activity tilting &\n    4.02 & % SAD: t-statistic and p-value\n    0.28 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    noti removed w/o duplicates &\n    5.99 & % HAPPY: t-statistic and p-value\n    0.28 & % HAPPY: cohen's-d and confidence interval\n    \n    location radius of gyration &\n    5.08 & % NORMAL: t-statistic and p-value\n    0.27 & % NORMAL: cohen's-d and confidence interval\n    \n    app tools &\n    3.47 & % SAD: t-statistic and p-value\n    0.27 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    app strategy &\n    5.72 & % HAPPY: t-statistic and p-value\n    0.36 & % HAPPY: cohen's-d and confidence interval\n    \n    app books and reference &\n    5.02 & % NORMAL: t-statistic and p-value\n    0.11 & % NORMAL: cohen's-d and confidence interval\n    \n    wifi min rssi &\n    3.17* & % SAD: t-statistic and p-value\n    0.26 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    screen \\# of episodes &\n    9.10 & % HAPPY: t-statistic and p-value\n    0.27 & % HAPPY: cohen's-d and confidence interval\n    \n    screen min episode &\n    4.65 & % NORMAL: t-statistic and p-value\n    0.24 & % NORMAL: cohen's-d and confidence interval\n    \n    app communication &\n    3.12* & % SAD: t-statistic and p-value\n    0.27 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \n    \n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % ITALY\n    %\n    \n    \\multirow{5}{1.1cm}{Italy} &\n    proximity max & %HAPPY\n    26.20 & % HAPPY: t-statistic and p-value\n    0.16 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi \\# num of devices & % NORMAL\n    12.96 & % NORMAL: t-statistic and p-value\n    0.07 & % NORMAL: cohen's-d and confidence interval\n    \n    app news \\& magazine & % SAD\n    11.47 & % SAD: t-statistic and p-value\n    0.11 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    proximity std &\n    15.19 & % HAPPY: t-statistic and p-value\n    0.09 & % HAPPY: cohen's-d and confidence interval\n    \n    app video players/editors &\n    10.45 & % NORMAL: t-statistic and p-value\n    0.06 & % NORMAL: cohen's-d and confidence interval\n    \n    app action &\n    8.55 & % SAD: t-statistic and p-value\n    0.09 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    location speed min &\n    13.21 & % HAPPY: t-statistic and p-value\n    0.08 & % HAPPY: cohen's-d and confidence interval\n    \n    activity still &\n    6.80 & % NORMAL: t-statistic and p-value\n    0.04 & % NORMAL: cohen's-d and confidence interval\n    \n    activity still &\n    4.98 & % SAD: t-statistic and p-value\n    0.07 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    proximity mean &\n    12.61 & % HAPPY: t-statistic and p-value\n    0.08 & % HAPPY: cohen's-d and confidence interval\n    \n    app adventure &\n    6.52 & % NORMAL: t-statistic and p-value\n    0.03 & % NORMAL: cohen's-d and confidence interval\n    \n    app video players/editors &\n    4.62 & % SAD: t-statistic and p-value\n    0.07 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi min rssi &\n    11.75 & % HAPPY: t-statistic and p-value\n    0.07 & % HAPPY: cohen's-d and confidence interval\n    \n    app lifestyle &\n    6.16 & % NORMAL: t-statistic and p-value\n    0.03 & % NORMAL: cohen's-d and confidence interval\n    \n    app social &\n    4.17 & % SAD: t-statistic and p-value\n    0.06 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % Mexico\n    %\n    \n    \\multirow{5}{1.1cm}{Mexico} &\n    wifi max rssi & %HAPPY\n    24.57 & % HAPPY: t-statistic and p-value\n    0.68 & % HAPPY: cohen's-d and confidence interval\n    \n    proximity std & % NORMAL\n    41.39 & % NORMAL: t-statistic and p-value\n    0.98 & % NORMAL: cohen's-d and confidence interval\n    \n    cellular lte min & % SAD\n    10.29 & % SAD: t-statistic and p-value\n    0.65 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi mean rssi &\n    23.99 & % HAPPY: t-statistic and p-value\n    0.69 & % HAPPY: cohen's-d and confidence interval\n    \n    proximity max &\n    0.93 & % NORMAL: t-statistic and p-value\n    0.06 & % NORMAL: cohen's-d and confidence interval\n    \n    wifi \\# of devices &\n    9.74 & % SAD: t-statistic and p-value\n    0.65 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi std rssi &\n    22.28 & % HAPPY: t-statistic and p-value\n    0.63 & % HAPPY: cohen's-d and confidence interval\n    \n    app communication &\n    20.98 & % NORMAL: t-statistic and p-value\n    0.49 & % NORMAL: cohen's-d and confidence interval\n    \n    proximity max &\n    9.34 & % SAD: t-statistic and p-value\n    0.73 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    screen \\# of episodes &\n    13.74 & % HAPPY: t-statistic and p-value\n    0.35 & % HAPPY: cohen's-d and confidence interval\n    \n    cellular lte std &\n    18.23 & % NORMAL: t-statistic and p-value\n    0.32 & % NORMAL: cohen's-d and confidence interval\n    \n    app tools &\n    8.79 & % SAD: t-statistic and p-value\n    0.73 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    location altitude max &\n    12.39 & % HAPPY: t-statistic and p-value\n    0.34 & % HAPPY: cohen's-d and confidence interval\n    \n    app music \\& audio &\n    18.03 & % NORMAL: t-statistic and p-value\n    0.36 & % NORMAL: cohen's-d and confidence interval\n    \n    activity still &\n    7.92 & % SAD: t-statistic and p-value\n    0.56 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \n    \n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % Mongolia\n    %\n    \n    \\multirow{5}{1.1cm}{Mongolia} &\n    app not found & %HAPPY\n    13.76 & % HAPPY: t-statistic and p-value\n    0.12 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi \\# of devices & % NORMAL\n    16.46 & % NORMAL: t-statistic and p-value\n    0.14 & % NORMAL: cohen's-d and confidence interval\n    \n    app personalization & % SAD\n    10.99 & % SAD: t-statistic and p-value\n    0.19 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi std rssi &\n    13.04 & % HAPPY: t-statistic and p-value\n    0.12 & % HAPPY: cohen's-d and confidence interval\n    \n    location altitude max &\n    16.25 & % NORMAL: t-statistic and p-value\n    0.15 & % NORMAL: cohen's-d and confidence interval\n    \n    app music \\& audio &\n    10.09 & % SAD: t-statistic and p-value\n    0.11 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    proximity &\n    7.25 & % HAPPY: t-statistic and p-value\n    0.06 & % HAPPY: cohen's-d and confidence interval\n    \n    app role playing &\n    15.24 & % NORMAL: t-statistic and p-value\n    0.09 & % NORMAL: cohen's-d and confidence interval\n    \n    app educational &\n    9.79 & % SAD: t-statistic and p-value\n    0.05 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi connected &\n    6.66 & % HAPPY: t-statistic and p-value\n    0.05 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi min rssi &\n    12.26 & % NORMAL: t-statistic and p-value\n    0.11 & % NORMAL: cohen's-d and confidence interval\n    \n    app sports &\n    8.10 & % SAD: t-statistic and p-value\n    0.08 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    user presence time &\n    6.07 & % HAPPY: t-statistic and p-value\n    0.05 & % HAPPY: cohen's-d and confidence interval\n    \n    app tools &\n    11.98 & % NORMAL: t-statistic and p-value\n    0.11 & % NORMAL: cohen's-d and confidence interval\n    \n    app communication &\n    6.67 & % SAD: t-statistic and p-value\n    0.11 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % Paraguay\n    %\n    \n    \\multirow{5}{1.1cm}{Paraguay} &\n    wifi min rssi & %HAPPY\n    24.32 & % HAPPY: t-statistic and p-value\n    0.53 & % HAPPY: cohen's-d and confidence interval\n    \n    touch \\# of events & % NORMAL\n    24.29 & % NORMAL: t-statistic and p-value\n    0.49 & % NORMAL: cohen's-d and confidence interval\n    \n    app role playing & % SAD\n    6.99 & % SAD: t-statistic and p-value\n    0.15 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi mean rssi &\n    20.07 & % HAPPY: t-statistic and p-value\n    0.43 & % HAPPY: cohen's-d and confidence interval\n    \n    location speed min &\n    22.49 & % NORMAL: t-statistic and p-value\n    0.48 & % NORMAL: cohen's-d and confidence interval\n    \n    app productivity &\n    5.71 & % SAD: t-statistic and p-value\n    0.17 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    noti posted w/o duplicates &\n    13.60 & % HAPPY: t-statistic and p-value\n    0.31 & % HAPPY: cohen's-d and confidence interval\n    \n    app tools &\n    12.30 & % NORMAL: t-statistic and p-value\n    0.27 & % NORMAL: cohen's-d and confidence interval\n    \n    app tools &\n    5.02 & % SAD: t-statistic and p-value\n    0.26 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    activity running &\n    8.08 & % HAPPY: t-statistic and p-value\n    0.19 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi \\# of devices &\n    11.53 & % NORMAL: t-statistic and p-value\n    0.25 & % NORMAL: cohen's-d and confidence interval\n    \n    screen std episode &\n    4.71 & % SAD: t-statistic and p-value\n    0.23 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    user presence time &\n    7.69 & % HAPPY: t-statistic and p-value\n    0.17 & % HAPPY: cohen's-d and confidence interval\n    \n    app strategy &\n    8.72 & % NORMAL: t-statistic and p-value\n    0.16 & % NORMAL: cohen's-d and confidence interval\n    \n    touch \\# of events &\n    4.49 & % SAD: t-statistic and p-value\n    0.22 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \n    \n    \n    \n    \n    \n    \n    \\cmidrule{2-10}\n    \n    \n    \n    %\n    % Paraguay\n    %\n    \n    \\multirow{5}{1.1cm}{UK} &\n    proximity std & %HAPPY\n    10.52 & % HAPPY: t-statistic and p-value\n    0.18 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi mean rssi & % NORMAL\n    17.93 & % NORMAL: t-statistic and p-value\n    0.24 & % NORMAL: cohen's-d and confidence interval\n    \n    app role playing & % SAD\n    39.48 & % SAD: t-statistic and p-value\n    0.53 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    wifi \\# of devices &\n    10.51 & % HAPPY: t-statistic and p-value\n    0.15 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi min rssi &\n    15.67 & % NORMAL: t-statistic and p-value\n    0.21 & % NORMAL: cohen's-d and confidence interval\n    \n    app board &\n    21.19 & % SAD: t-statistic and p-value\n    0.29 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    app business &\n    9.83 & % HAPPY: t-statistic and p-value\n    0.16 & % HAPPY: cohen's-d and confidence interval\n    \n    wifi max rssi &\n    11.89 & % NORMAL: t-statistic and p-value\n    0.17 & % NORMAL: cohen's-d and confidence interval\n    \n    app personalization &\n    17.32 & % SAD: t-statistic and p-value\n    0.47 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    app tools &\n    9.82 & % HAPPY: t-statistic and p-value\n    0.14 & % HAPPY: cohen's-d and confidence interval\n    \n    app role playing &\n    10.34 & % NORMAL: t-statistic and p-value\n    0.13 & % NORMAL: cohen's-d and confidence interval\n    \n    touch \\# of events &\n    8.27 & % SAD: t-statistic and p-value\n    0.21 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    &\n    proximity max &\n    9.53 & % HAPPY: t-statistic and p-value\n    0.16 & % HAPPY: cohen's-d and confidence interval\n    \n    cellular lte mean &\n    9.08 & % NORMAL: t-statistic and p-value\n    0.13 & % NORMAL: cohen's-d and confidence interval\n    \n    screen \\# of episodes &\n    6.78 & % SAD: t-statistic and p-value\n    0.20 % SAD: cohen's-d and confidence interval\n    \\\\\n    \n    \\arrayrulecolor{Gray2}\n    \\hline \n    \n    \\end{tabular}%\n    }\n\\end{table}",
        "2211.03009_286a98d89f6d622095bb4e23086c56f6": "\\begin{figure*}[t]\n\\begin{center}\n    \\iffalse \n    \\begin{subfigure}[t]{0.99\\textwidth}\n        \\centering\n        \\includegraphics[width=0.85\\textwidth]{images/distribution_of_tstatistics.png}\n        \\caption{t-statistic distribution}\n        \\label{fig:dist_tstat}\n    \\end{subfigure}\n    \\hfill \n    \\fi \n    \\begin{subfigure}[t]{\\textwidth}\n        \\centering\n        \\includegraphics[width=0.7\\textwidth]{images/distribution_of_cohensd.png}\n        %\\caption{cohen's-d distribution}\n        %\\label{fig:dist_cohens}\n    \\end{subfigure}\n    \n    \\caption{Cohen's-d (effect Size) distribution of features for negative and positive classes, grouped by countries and modalities.}\n    \\label{fig:statistics}\n\\end{center}\n\\vspace{-0.2 in}\n\\end{figure*}",
        "2211.03009_3f58a2b7a5b7e0f76de4563408254d75": "In this section, we seek to understand features with high statistical significance in discriminating either positive, neutral, or negative classes from the other two",
        "2211.03009_e7f03c99fee04ac2bbda37b24103a7d2": "Therefore, in Table",
        "2211.03009_20bab44e5f93b8eb6ae3107dba29c8ee": ", we show the t-statistic",
        "2211.03009_c8e02cf4e60c62641afb3cba12f38041": "\\cite{Kim2015}",
        "2211.03009_100ce6fb8ee6c705c46b6755989cd040": "and p-values",
        "2211.03009_d030873bbafc73115f9604337c2a3481": "\\cite{Greenland2016}",
        "2211.03009_b8c23c960a109d4e98c3c948ec3bacb0": "(p-values higher than 0.05 after Bonferroni correction for multiple hypothesis testing",
        "2211.03009_0d6831767d01d7182e3922b4a7a05b57": "\\cite{weisstein2004bonferroni}",
        "2211.03009_4df19f60cec3d4d9f876ce5cb5bb12e8": "are marked with *)",
        "2211.03009_149c6e3f95aa560dd4e7827478cd1aae": "In addition, since p-values are limited in determining statistical significance",
        "2211.03009_ecb793d43f5ea1d72e325549c20b7d1b": "\\cite{Lee2016}",
        "2211.03009_bd0ef877f5a02fa1bc719ed5e95c4dd4": ", we also report Cohen's-d",
        "2211.03009_941b673926f75cbae8371d59a63422d4": "\\cite{Rice2005}",
        "2211.03009_9b469b6811fd18e0004aa938e49b0128": "(all features have 95",
        "2211.03009_1462b1e4c9adc14c91e9fbeeb6465114": "confidence interval not crossing zero",
        "2211.03009_0f6a59a176d91846e0a5b46780793205": "\\cite{Lakens2013}",
        "2211.03009_e3702884a575f3ff2962627a23ad9a75": ") for positive, neutral, and negative classes for each country",
        "2211.03009_36bcefdfa13f0051fa4507d79ba73546": "The rule of thumb to evaluate Cohen's-d is 0.2 = small effect size, 0.5 = medium effect size, and 0.8 = large effect size",
        "2211.03009_3d160114e963c802541b6a83fee6a00d": "For the positive mood, across all the European countries and Mongolia, proximity sensor-related features were among the top five features, indicating that phone usage and/or location of the phone could reveal positive moods",
        "2211.03009_770c83a495b3ec9e35fb13995b51745c": "However, except for Denmark, where there was a small effect size, the proximity feature had less than small effect sizes in all other countries",
        "2211.03009_3fab810469e5d134e2ca922ad5943fbd": "In addition, in Denmark, cycling activity was indicative of positive moods",
        "2211.03009_279d4fd79e20111ca7e9b4297d014bdb": "Interestingly, Copenhagen in Denmark is a city widely known for cycling",
        "2211.03009_a0b551425eb0fb702f884e81b420b966": "\\cite{pucher2007frontiers}",
        "2211.03009_2921639ba923031992ae4cbfafa40e3f": ", which might explain this finding",
        "2211.03009_f05282b432057477aa421e7e141361a7": "Further, running activity could discriminate positive mood with a small effect size in Paraguay",
        "2211.03009_29a9a5fb9129d3cbe21a5ad3a8eaca19": "Prior work has also shown that high physical activity could lead to positive moods and less stress",
        "2211.03009_3bb17cbccb3abfdd4a7288d727f6e69b": "\\cite{biddle2000emotion, kanning2010active}",
        "2211.03009_bc727ed50036cfafbd9186f6b26ea7df": "Regarding the negative class, app features were predominant in most countries",
        "2211.03009_ce6f00034cd85982a3f939cb52137b04": "For some apps, high usage indicated negative moods (e.g., puzzle in Denmark, news",
        "2211.03009_f0ee7a0929c8bcf48a7f296db0c4c24a": "magazine in Italy, etc.)",
        "2211.03009_5652ea65ddf91406303f7c3818491392": "In contrast, for some apps, low usage indicated negative moods (e.g., health",
        "2211.03009_e83f6679b80d47367272d93379f3f575": "fitness in China, music",
        "2211.03009_1bdf0b7040eb6b05f8bc22e06c386578": "audio in China and Mongolia, role-playing games in UK and Paraguay, etc.)",
        "2211.03009_1d99a189b36389427338aa24ca810b4d": "In addition, for both UK and Paraguay, a high number of touch events on the phone was indicative of negative moods",
        "2211.03009_1dc96758f7bb4f6c67ef8cdb557b4e65": "This finding is generally in line with prior studies that examined fine-grained smartphone usage and mental well-being",
        "2211.03009_72a53ad1c9b95cdd72505f4943cc5b30": "\\cite{hung2016predicting, likamwa2013moodscope}",
        "2211.03009_87ca9ed768b23b3c1db3857109b686c4": "In summary, features from modalities such as app usage, screen and phone usage events (episodes, touch events, user presence, proximity, etc.), WiFi, activity types, and location were among the ones that helped discriminate between different moods",
        "2211.03009_4c7d6f8cb87365801e5a43e1af4a0538": "Further, except for the `proximity std' feature in Mexico for neutral mood, none of the features had a larger effect size",
        "2211.03009_19eccc7e3bfbe61a136f6cebfb401ea9": "For a few country-mood pairs, there were cases of features having above medium effect sizes (e.g., number of touch events in Denmark for Neutral, many features from modalities such as cellular, WiFi, proximity, etc. in Mexico, minimum RSSI value for WiFi in Paraguay for Positive, and role-playing apps in the UK for Negative)",
        "2211.03009_2f42d904f8b6ec80f38280f5432407a2": "shows the distribution of Cohen's-d values for all features grouped by sensing modalities for the two classes studied in this paper (i.e., negative vs. positive)",
        "2211.03009_5d75d55b99eaf918ccdb7de1a99b58d8": "Results indicate that depending on the country, the expressiveness of different sensing modalities in discriminating negative classes from other classes is different",
        "2211.03009_4376ecd02f2a4f8bdc3a0f767552c792": "For example, for `app' features, effect sizes are small for countries such as China, Italy, and Mongolia",
        "2211.03009_d573689af59f30fe68863022f8b4897d": "In contrast, more informative features with larger effect sizes are present for Denmark, Mexico, and the UK.",
        "2211.03009_e2265fa77c3f9df75d9f5b698a352323": "Mood Inference (RQ2 RQ3)",
        "2211.03009_d575842d81dec3a51d3f41c166db8bf4": "Experimental Setup",
        "2211.03009_2ccadd8689f3881e4d0ab72c57df23f0": "The primary goal of this paper is to investigate aspects related to mood inference, personalization, and generalization to different countries using smartphone sensing data",
        "2211.03009_fe7e5e6fedb779385d9743259e76b4c8": "As described and defined in Figure",
        "2211.03009_05fbb6792748c449bd8177660c851bd3": "and Table",
        "2211.03009_af8adb91dbe1d2ada70995078bd27bc4": ", we use two model types: population-level and hybrid, to examine personalization to individuals, and four modeling approaches: country-specific, continent-specific, country-agnostic, and multi-country, to examine generalization and country-wise performance",
        "2211.03009_ff3ce76350d671de2455bcda16e190e3": "Hence, this section will describe the operationalization of the experimental protocol",
        "2211.03009_9a6bb153fc144f2925b60cd01e5ada30": "We used python with scikit-learn",
        "2211.03009_03e3e49c1a6aa41bd88437a8fe67f9d8": "\\cite{pedregosa2011scikit}",
        "2211.03009_eeea3d682ae870241f43df3658b7dc9d": "and Keras",
        "2211.03009_7aa9219d84bc520d073fe91873044571": "\\cite{chollet2015keras}",
        "2211.03009_976a07fbdbaad237f45916ac9f6a4570": "frameworks to conduct all experiments",
        "2211.03009_b783a9f41de0139201477f4f157c6f13": "Initially, we conducted country-specific experiments with different model types such as random forest (RF), gradient boosting, support vector classification, XGBoost, AdaBoost, and multi-layer perceptron neural networks",
        "2211.03009_c9d54e3c02a9e777469eef13b0337e25": "\\cite{rf_inbook, rish2001empirical, natekin2013gradient, chen2016xgboost, schapire2013explaining, noble2006support}",
        "2211.03009_aa67b0f7422920317be0d5c63f924f3d": "We obtained the best results for a larger majority of inferences with RFs",
        "2211.03009_d11f6c6abd38b49c6ea597a74a90ef7c": "In addition, these models allow interpreting results better because they provide Gini feature importance values for trained models",
        "2211.03009_cb39903dca7791bdd79bb21323825a83": "Because of these reasons and space limitations, we will only report results for RF models with default parameters in this paper",
        "2211.03009_d2a5ea4f99967a09ee1f224a3c875e83": "Further, to fill in missing values of the dataset, we used k-nearest-neighbor (kNN) imputation",
        "2211.03009_529fe307e786653d481706f600619e30": "\\cite{beretta2016nearest, zhou2018missing}",
        "2211.03009_d9735aca47bf4a74888ce9cea922f9bf": "In addition, we report all the results with the area under the receiver operating characteristic curve (AUROC)",
        "2211.03009_9080353851f40d3e28e1610c5e20b516": "\\cite{bradley1997use}",
        "2211.03009_af34062e3180bf170583aa02e546d111": "because they provide a better assessment of performance when dealing with imbalanced data (when used with macro averaging which gives equal emphasis to all classes in an inference)",
        "2211.03009_75df74ffb56c419961af888621baaece": "While we provided a basic description of model types in Table",
        "2211.03009_ad083528f39c21c7cff4fa35fed416ea": ", the operationalization of models is given below.",
        "2211.03009_e05b0bc885cf71d13ff0d225796323de": ": Since this represents a scenario where models are deployed to a set of users unseen in model training, we use the leave-n-participants-out strategy when testing models",
        "2211.03009_6c7b3da92dc7696fd2c5a260fb78cbf2": "This is an extension of leave-one-out cross-validation, where we consider",
        "2211.03009_55a049b8f161ae7cfeb0197d75aff967": "$n$",
        "2211.03009_56e06de359ecb9c9ee3f4bdd82535192": "users in testing instead of one",
        "2211.03009_875dfc39706fc3eb0b3bc313417d8254": "Hence, if the number of users in the considered population is",
        "2211.03009_f9c4988898e7f532b9f826a75014ed3c": "$N$",
        "2211.03009_b9d7c3b2c027a75ba37907bf50540f47": ", we pick",
        "2211.03009_2a4447249acfee344f832816d3a99022": "such that it is roughly 20",
        "2211.03009_8bf8854bebe108183caeb845c7676ae4": "of",
        "2211.03009_2e48f7c09c24a049c4f1c82aefdc6fd2": "(can be obtained with group-k-fold cross-validation with k = 5 in scikit-learn)",
        "2211.03009_91bf767c9a5546790d2422e29ea556ce": "So, for each",
        "2211.03009_ee0971ffa2d49b847d90c3f25797b484": "user in the testing split, 50",
        "2211.03009_9c05b44ebfa5f3e3d8bb9afccd332222": "of their data would be used for testing to be coherent with hybrid models (stratified based on users and mood labels), and data from the rest of the",
        "2211.03009_37da842cc09d6afb19f036c0727aef27": "$N-n$",
        "2211.03009_0ff597398171a35b7903832640458c9c": "users would be used for the training split",
        "2211.03009_98c36084e2f923df581b9617afea1987": "Then, experiments were repeated ten times by randomly sampling",
        "2211.03009_f9d11348d33d2c7260a2780d63b941c6": "users, and the results were averaged.",
        "2211.03009_e299ee374db21397f413b712d05d7221": ": Since this represents a scenario where models are deployed to a set of users already seen in model training (hence partially personalized models), we first use the leave-n-participants-out strategy similar to PLM",
        "2211.03009_55a1bfe0bcac990ace50e3de0485609e": "user in the testing split, data from the rest of the",
        "2211.03009_e7fa5253b8af25f0b0f42c8aeade834a": "In addition, 50",
        "2211.03009_b5ada2f0602080ec9a3115ce0ef3c509": "of the data from the testing split (stratified based on users and mood labels) would be included in the training set to represent partial personalization",
        "2211.03009_31ec8cc35ad40c81d10bb4310abaa907": "In addition, an equal number of data points to the number of data points added to the training set from the testing set would be removed randomly to make the number of data points in the training and testing sets for HM and PLM equal making them more comparable",
        "2211.03009_603ff91ae45330dd1f4311693e6b1f87": "Finally, experiments were repeated ten times by randomly sampling",
        "2211.03009_b6b8776f0e64728425ca9cd8fdda1df5": "Using the above two model types, we conducted the experiments using four approaches",
        "2211.03009_bcd7f5bceaf5781c2f75093314af0a0f": "The country-specific approach examines how models trained within a country perform",
        "2211.03009_e55b64ece1158db92eb6d461c4beb958": "We examine both PLM and HM types for this approach, hence examining the personalization within countries",
        "2211.03009_a85b6730ee75cf88844996259a079904": "The country-agnostic approach examines how models trained in one or a few countries generalize to a new country",
        "2211.03009_bf0207bd4688c798b3137d0e36c6fda9": "With PLM and HM model types, we examine how personalization affects model performance when models are deployed to countries unseen on training data",
        "2211.03009_c7d46bbf68f297fe05366f0ad15a659f": "The multi-country approach is similar to a one-size-fits-all model trained with data from all available countries",
        "2211.03009_ef59c5448b95df48c98669d16a7107f5": "This is similar to a model in which country diversity is ignored",
        "2211.03009_62e77a62658e277d6dba530fd92e5cff": "Both PLM and HM model types were used to examine the effects of personalization on model performance.",
        "2211.03009_0ca7de549219df7453ce7cac4dc83c19": "\\begin{table}\n    \\caption{{Country-Specific and Multi-Country results with PLM and HM: }Mean ($\\bar{S}$) and Standard Deviation ($S_\\sigma$) AUROC scores computed from ten iterations. Results are presented as $\\bar{S} (S_\\sigma)$, where $S$ is AUROC.}\n    \\label{tab:specific-results}\n    \\resizebox{0.65\\textwidth}{!}{%\n    \\begin{tabular}{l l l l l}\n     \n     \n    &\n    \\multicolumn{2}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{PLM}}&\n    \\multicolumn{2}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{HM}} \\\\\n    \n    &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Two-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Three-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Two-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Three-Class}} \n    \\\\\n    \n    \\arrayrulecolor{Gray}\n    \\hline\n    \n    %& \n    %\\textit{F1} &\n    %\\textit{AUROC} &\n    %\\multicolumn{1}{l}{\\textit{F1}} &\n    %\\multicolumn{1}{l}{\\textit{AUROC}} \n    %\\\\\n    \n    Baseline &\n    .50 (.00) & % Baseline 1\n    .50 (.00) & % XGBoost\n    .50 (.00) & % Baseline 1\n    .50 (.00)  % XGBoost\n    \\\\\n    \n    \\hline \n    \n    China &\n    .51 (.04) & % Random Forest\n    .45 (.04) & % MLP\n    .78 (.02) & % Random Forest\n    .79 (.01)  % MLP\n    \\\\\n    \n    Denmark &\n    .41 (.10) & % 2-class\n    .56 (.03) & % MLP\n    .83 (.03) & % Random Forest\n    .86 (.01)  % MLP\n    \\\\\n    \n    India &\n    .46 (.15) & % Random Forest\n    .45 (.04) & % MLP\n    .79 (.03) & % Random Forest\n    .76 (.02)  % MLP\n    \\\\\n    \n    Italy &\n    .55 (.05) & % Random Forest\n    .52 (.01) & % MLP\n    .82 (.01) & % Random Forest\n    .81 (.00)  % MLP\n    \\\\\n    \n    Mexico &\n    .62 (.21) & % Random Forest\n    .62 (.13) & % MLP\n    .98 (.01) & % Random Forest\n    .94 (.01) % MLP\n    \n    \\\\\n    \n    Mongolia &\n    .49 (.08) & % Random Forest\n    .49 (.02) & % MLP\n    .85 (.01) & % Random Forest\n    .83 (.00) % MLP\n    \\\\\n    \n    Paraguay &\n    .48 (.08) & % Random Forest\n    .53 (.01) & % MLP\n    .84 (.01) & % Random Forest\n    .84 (.01) % MLP\n    \\\\\n    \n    UK &\n    .56 (.05) & % Random Forest\n    .52 (.05) & % MLP\n    .91 (.01) & % Random Forest\n    .87 (.00) % MLP\n    \\\\\n    \n    \\hline \n    \n    Aggregate &\n    .51 (.10) & % Random Forest\n    .52 (.04) & % MLP\n    .85 (.02) & % Random Forest\n    .84 (.01) % MLP\n    \\\\\n    \n    \n    %\\hline \n    \n    Multi-Country &\n    .52 (.03) & % Random Forest\n    .53 (.02) & % MLP\n    .83 (.01) & % Random Forest\n    .79 (.00) % MLP\n    \\\\\n    \n    Multi-Country (Balanced) &\n    .53 (.02) & % Random Forest\n    .52 (.03) & % MLP\n    .81 (.03) & % Random Forest\n    .78 (.02) % MLP\n    \\\\\n    \n    \\arrayrulecolor{Gray2}\n    \\hline \n    \n    \n    \\end{tabular}%\n    }\n%\\end{wraptable}\n\\end{table}",
        "2211.03009_fd69c5cf902969e6fb71d043085ddee6": "Results",
        "2211.03009_92b304be58de448ea24b3fbe9ec036b8": "Country-Specific Models",
        "2211.03009_84d8298209171837bf0e668735a9ba23": "In Table",
        "2211.03009_bddab35aee1a33c20b1d9b4f642a2d7c": ", we show country-specific results with PLM and HM",
        "2211.03009_b8234ee6f8b325d79fdf912df6f89d6f": "In addition, we also show the aggregate results from country-specific (as `Aggregate') and multi-country models",
        "2211.03009_f3cbdf0c7e8bd0252a944727266d8167": "Under `Multi-Country (Balanced)', we use an equal number of data points from each country (equal to the country with the minimum number of data points, which is India) by randomly sampling when training and testing models",
        "2211.03009_b136e72efdf709ff08da36636a2fb856": "The results show that PLMs do not perform well for two and three-class inferences",
        "2211.03009_b0bdcfc681065a9855fb24dd1d258b1a": "Models in Mexico performed better than in other countries",
        "2211.03009_4ce85958757ae9e11abbbdb1b8295a93": "These results are reasonable because many features in Mexico had medium to large effect sizes, as shown in Figure",
        "2211.03009_64a04c17d704f300997d6e32a8dde7a3": "However, HM results show that they perform better than PLMs, showing the usefulness of personalization within each country",
        "2211.03009_731d433ced6c3f029292a2eb20d0bf3f": "With HMs, the performance for two-class inference almost doubled for Denmark, and even for other countries, the AUROC bump was above 30",
        "2211.03009_5b5871163c316de3b10ccc28dc70d7c5": "These results suggest that for both two-class and three-class inferences, partial personalization within each country leads to significant improvements in performance",
        "2211.03009_77f3904ddd7d9b02ecb7af7ef9f63f72": "When the aggregate results of country-specific models are compared with multi-country models, PLMs do not show a significant difference",
        "2211.03009_cecdbe22e808ab29fdb29dad9fc73a79": "However, with HMs, it is clear that country-specific models outperform multi-country models by 2",
        "2211.03009_6a8412d498136cc702f90447edb6c13c": "for two-class and 5",
        "2211.03009_c5810cec1faf1d3fe9604bd1449d015a": "for three-class",
        "2211.03009_22c8b0707b18ca52fc75760f4d8179ad": "This suggests that model personalization within countries leads to better performance when compared to the personalization of one-size-fits-all models",
        "2211.03009_8a3f545253e3d2dfe0c4de3dc1901865": "This is reasonable given that we are reducing the distributional shift by only considering data within a country and adding an effect of personalization by being geographically diversity-aware",
        "2211.03009_4b34ae288d93bf6d2b65917ba2bebec3": "In addition, the `Multi-Country' approach performed slightly better than the `Multi-Country (Balanced)' case",
        "2211.03009_7e5f19623cf92c3b7a55445202d88d02": "This could be because, in the imbalanced case, models favor countries with more data points, such as Italy and Mongolia, leading to a slight increase in performance for those countries that occupy a majority of the dataset",
        "2211.03009_b87225d4b52ffe29cf9c804cb5b0d1cb": "Furthermore, regardless of whether it is a two/three-class inference, the performance of models did not degrade much.",
        "2211.03009_291efcada0f980f2202fa0a2a14b6261": "Country-Agnostic I Models",
        "2211.03009_84ef0921c808770d858fbae3ba572ec3": "Next, we examine the country-agnostic approach",
        "2211.03009_51c45b795d5d18a3e4e0c37e8b20a141": "Table",
        "2211.03009_54811f467db274f5bbca328368d5aa42": "show the results for two-class and three-class inferences, respectively",
        "2211.03009_f385133ba911fbbeffb3173e10671094": "In both tables, we first show results for models trained in specific countries when tested on an unseen country in the form of a matrix with an empty diagonal",
        "2211.03009_f9987df42223c650fb1b32254a86bbe9": "Then, under `Aggregate', we show the aggregate value of those results for each training country (e.g., PLM performance for models trained in China when deployed to other countries)",
        "2211.03009_e9507cdb9b1a6be11074cd4d3907def3": "In addition, we calculated AUROC scores for the same set of models with partial personalization (all the results are not shown here due to space limitations), and similar to the aggregate of PM, we show the aggregate values under HM",
        "2211.03009_5efbba7cd6e9bf4c5f680778d1d46102": "Results show that PLMs do not generalize well to new countries with AUROCs of 0.47 - 0.52",
        "2211.03009_bb2c2441b01660f61cbb4d874a4db03a": "However, these results are on par with PLM accuracies in country-specific and multi-country approaches",
        "2211.03009_a778b292f226a7544a7466ea73a24638": "This suggests that regardless of the country from where sensing data were obtained to train models for mood inference, PLMs performed similarly",
        "2211.03009_4f7469a17c3296e587716360adc94490": "However, HM results convey an opposite conclusion for two and three-class inferences",
        "2211.03009_928d29bc9b50f0a518f66333b13ff0e6": "For the two-class inference, the country-specific approach had AUROC scores in the range of 0.78-0.98, whereas the country-agnostic approach yielded scores in the range of 0.66-0.73",
        "2211.03009_e8397e2f81ef0769a7daa3093e6927fd": "A similar pattern can be seen for three-class inference, where scores dropped from 0.76-0.94 to 0.65-0.71",
        "2211.03009_104ccc19a8396d5fb14fc6e0a3ede9d9": "This shows that the effect of personalization achieved with HMs is strong for the country-specific approach, whereas country-agnostic models still did not generalize well",
        "2211.03009_ff4e23aa366ef05b16b06aba23f5bffb": "However, we also noticed that with HMs for both two-class and three-class inferences, models trained in European countries consistently performed better in other European countries than the rest",
        "2211.03009_b4e55cf3e8ed688bab601e41397355be": "For example, in the two-class inference, the Italian model had AUROC scores of 0.76 and 0.78 in Denmark and the UK, respectively",
        "2211.03009_e388c057226a8f75940b31db965b7c9b": "In contrast, the next best score for the Italian model was 0.70 in India",
        "2211.03009_379e74caaf0867706814943d227be4ce": "Finally, for three-class inference, the UK model had AUROC scores of 0.73 and 0.75 for Italy and Denmark, respectively, whereas the next best score was 0.69 for Paraguay",
        "2211.03009_6b7f8365b5f3f4a4cf1ecf402355b516": "These results could be partly justified given that European countries have somewhat closer everyday patterns that could get captured in the models.",
        "2211.03009_7a63304c0ecf17579b7338354e826dee": "\\begin{table}\n    \\caption{{Country-Agnostic I PLM \\& HM: }Two-Class Inference -- Mean ($\\bar{S}$) and Standard Deviation ($S_\\sigma$) of AUROC scores obtained by testing each Country-Specific model (rows) on a new country. Results are presented as $\\bar{S} (S_\\sigma)$, where $S$ is AUROC score. Aggregate of the reported population-level results and results from hybrid models indicated under `Aggregate'.}\n    \\label{tab:agnostic-two-class}\n    \\resizebox{0.95\\textwidth}{!}{%\n    \\begin{tabular}{lrrrrrrrr|rr}\n    \n    &\n    \\multicolumn{8}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Testing (PLM)}} &\n    \\multicolumn{2}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Aggregate}} \n    \\\\\n     \n    \\rowcolor[HTML]{D9D9D9} \n    \\cellcolor[HTML]{EDEDED} \\textbf{Training}  &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{China}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Denmark}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{India}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Italy}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Mexico}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Mongolia}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Paraguay}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{UK}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{PLM}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{HM}}\n    \\\\\n     \n    \\arrayrulecolor{Gray} \n     \n     \n    \\hline\n     \n    China &\n      &\n    .53 (.02) &\n    .44 (.03) &\n    .49 (.01) &\n    .58 (.05) &\n    .50 (.01) &\n    .42 (.03) &\n    .51 (.02) &\n    .55 (.02) &\n    .67 (.04)\n    \\\\\n    \n    Denmark &\n    .51 (.00) &\n    &\n    .47 (.01) &\n    .51 (.00) &\n    .58 (.02) &\n    .50 (.00) &\n    .58 (.01) &\n    .46 (.00) &\n    .52 (.01) &\n    .69 (.03)\n    \\\\\n    \n    India &\n    .48 (.00) &\n    .37 (.00) &\n     &\n    .50 (.00) &\n    .40 (.02) &\n    .50 (.00) &\n    .44 (.01) &\n    .52 (.00) &\n    .46 (.00) &\n    .70 (.02) \n    \\\\\n    \n    \n    Italy &\n    .49 (.00) &\n    .45 (.00) &\n    .51 (.01) &\n    &\n    .40 (.02) &\n    .51 (.01) & \n    .48 (.00) &\n    .50 (.00) &\n    .48 (.01) &\n    .69 (.02) \n    \\\\\n    \n    Mexico &\n    .49 (.00) &\n    .58 (.01) &\n    .44 (.01) &\n    .49 (.00) &\n     & \n    .49 (.01) &\n    .56 (.01) &\n    .47 (.01) &\n    .50 (.01) &\n    .73 (.03) \n    \\\\\n    \n    Mongolia &\n    .49 (.00) &\n    .48 (.01) &\n    .52 (.00) &\n    .50 (.00) &\n    .51 (.00) &\n     &\n    .48 (.00) &\n    .51 (.00) &\n    .50 (.00) &\n    .71 (.03) \n    \\\\\n    \n    Paraguay &\n    .51 (.00) &\n    .53 (.01) & \n    .49 (.01) &\n    .50 (.00) &\n    .55 (.02) & \n    .53 (.01) &\n    &\n    .50 (.01) &\n    .52 (.01) &\n    .70 (.02) \n    \\\\\n    \n    \n    UK &\n    .48 (.01) &\n    .43 (.02) &\n    .57 (.00) &\n    .50 (.01) &\n    .32 (.01) &\n    .50 (.01) &\n    .49 (.01) &\n    & \n    .47 (.01) &\n    .66 (.02) \n    \\\\\n    \n    \\arrayrulecolor{Gray2}\n    \n    \\hline\n    \\end{tabular}%\n    }\n\\end{table}",
        "2211.03009_d86b99963194ff2cecc78e20b4fb7a73": "\\begin{table}\n    \\caption{{Country-Agnostic I PLM \\& HM: }Three-Class Inference -- Mean ($\\bar{S}$) and Standard Deviation ($S_\\sigma$) of AUROC scores obtained by testing each Country-Specific model (rows) on a new country. Results are presented as $\\bar{S} (S_\\sigma)$, where $S$ is AUROC score. Aggregate of the reported population-level results and results from hybrid models indicated under `Aggregate'.}\n    \\label{tab:agnostic-three-class}\n    \\resizebox{0.95\\textwidth}{!}{%\n    \\begin{tabular}{lrrrrrrrr|rr}\n    \n     %\\rowcolor[HTML]{EFEFEF}  \n     &\n    \\multicolumn{8}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Testing (PLM)}} &\n    \\multicolumn{2}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Aggregate}}  \n     \\\\\n     \n     \\rowcolor[HTML]{D9D9D9} \n     \\cellcolor[HTML]{EDEDED} \\textbf{Training}  &\n     \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{China}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Denmark}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{India}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Italy}}  &\n     \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Mexico}} &\n     \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Mongolia}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Paraguay}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{UK}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{PLM}} & \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{HM}}\n     \\\\\n     \n     \n     \\arrayrulecolor{Gray}\n    \\hline\n     \n     \n    China &\n     &\n    .48 (.01) &\n    .54 (.01) &\n    .48 (.01) &\n    .47 (.01) &\n    .50 (.01) &\n    .51 (.01) &\n    .50 (.00) &\n    .50 (.01) &\n    .68 (.02) \n    \\\\\n    \n    Denmark &\n    .52 (.01) &\n    &\n    .41 (.02) &\n    .56 (.01) &\n    .54 (.04) &\n    .51 (.01) &\n    .50 (.02) &\n    .58 (.01) &\n    .52 (.02) &\n    .66 (.04) \n    \\\\\n    \n    India &\n    .52 (.01) &\n    .42 (.02) &\n     &\n    .52 (.01) &\n    .38 (.02) &\n    .52 (.01) &\n    .52 (.01) &\n    .38 (.01) &\n    .47 (.01) &\n    .68 (.03) \n    \\\\\n    \n    Italy &\n    .52 (.01) &\n    .49 (.01) &\n    .47 (.02) &\n    &\n    .32 (.02) &\n    .51 (.01) & \n    .51 (.00) &\n    .54 (.00) &\n    .48 (.01) &\n    .69 (.02) \n    \\\\\n    \n    Mexico &\n    .49 (.00) &\n    .59 (.00) &\n    .44 (.00) &\n    .47 (.00) &\n    & \n    .50 (.00) &\n    .61 (.00) &\n    .54 (.00) &\n    .52 (.00) &\n    .71 (.02) \n    \\\\\n    \n    Mongolia &\n    .49 (.00) &\n    .50 (.00) &\n    .43 (.00) &\n    .51 (.00) &\n    .55 (.00) &\n    &\n    .54 (.00) &\n    .53 (.00) &\n    .51 (.00) &\n    .67 (.02) \n    \\\\\n    \n    Paraguay &\n    .44 (.01) &\n    .51 (.02) & \n    .48 (.03) &\n    .52 (.01) &\n    .58 (.05) & \n    .53 (.01) &\n    &\n    .55 (.01) &\n    .52 (.02) &\n    .65 (.04) \n    \\\\\n    \n    UK &\n    .53 (.01) &\n    .51 (.01) &\n    .51 (.03) &\n    .53 (.01) &\n    .40 (.06) &\n    .52 (.01) &\n    .53 (.02) &\n    &\n    .50 (.02) &\n    .67 (.03) \n    \\\\\n    \n    \n    \n    \n    \\arrayrulecolor{Gray2}\n    \\hline\n    \\end{tabular}%\n    }\n\\end{table}",
        "2211.03009_dab716b85891663a862e89ef2b283bce": ", we show results for country-agnostic models that were trained in seven countries and tested in the shown country",
        "2211.03009_27eda9f88354d8ce20ab438f945d150e": "Compared to the previous setting, where the models were trained in only one country and tested in another, these models capture a more considerable intra-subject variability in model training",
        "2211.03009_2b459db1d78b1bae6f10adb69d47b240": "Moreover, HM results were not included here because, technically, it is similar to the HM of multi-country models",
        "2211.03009_544db2a0ef2167ffbee5b6183ea09a3d": "PLM results show that the performance is not high for both two-class and three-class inferences",
        "2211.03009_6abac6e575f4e8f07e19425d0820ff02": "For some countries, performance slightly increased compared to country-specific (e.g., China, Paraguay in two-class)",
        "2211.03009_4050ccea024438be99356e4d4c46ba80": "For some, the performance declined (e.g., India, Denmark, Italy, Mexico, and the UK in two-class)",
        "2211.03009_bd7a02476a5c682b93bdddcd95b4b3e4": "Hence, there is no clear evidence that having more data from multiple countries would help to generalize better for an unseen country, even in this case.",
        "2211.03009_ecf74b45b06415b2454d58ac0d979566": "\\begin{table}\n    \\caption{{Country-Agnostic II PLM: }Mean ($\\bar{S}$) and Standard Deviation ($S_\\sigma$) of AUROC scores obtained by testing each a seven-country model on data from a new country. Results are presented as $\\bar{S} (S_\\sigma)$, where $S$ is the AUROC.}    \n    \\label{tab:agnostic-ii}\n     \\resizebox{0.35\\textwidth}{!}{%\n    \\begin{tabular}{l l l}\n    \n    \n    \n    &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Two-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{Three-Class}} \n    \\\\\n    \\arrayrulecolor{Gray}\n    \\hline\n    \n    Baseline &\n    .50 (.00) &\n    .50 (.00) \n    \\\\\n    \n    \\hline \n    \n    China &\n    .54 (.01) &\n    .48 (.01) \n    \\\\\n    \n    Denmark & \n    .51 (.02) &\n    .48 (.01) \n    \\\\\n    \n    India &\n    .53 (.03) &\n    .47 (.01)\n    \\\\\n    \n    Italy &\n    .54 (.01) &\n    .50 (.01) \n    \\\\\n    \n    Mexico &\n    .41 (.02) &\n    .54 (.01) \n    \\\\ \n    \n    Mongolia &\n    .49 (.01) &\n    .49 (.01) \n    \\\\\n    \n    Paraguay &\n    .56 (.01) &\n    .55 (.01) \n    \\\\\n    \n    UK &\n    .48 (.01) &\n    .51 (.01)  \n    \\\\ \n    \n    \\arrayrulecolor{Gray2}\n    \\hline\n    \\end{tabular}\n    }\n\\end{table}",
        "2211.03009_f92646cfa07f953248bf4e3d0bca09e1": "\\begin{table}\n    \\caption{{Multi-Country and Continent-Specific with PLM and HM: }Mean ($\\bar{S}$) and Standard Deviation ($S_\\sigma$) of F1-scores and AUROC scores obtained by testing the \"worldwide\" model. Results are presented as $\\bar{S} (S_\\sigma)$, where $S$ is any of the two\n    metrics.}    \n    \\label{tab:multi-country}\n    \n    \\resizebox{0.7\\textwidth}{!}{%\n    \\begin{tabular}{l l l l l}\n     \n     \n    &\n    \\multicolumn{2}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{PLM}}&\n    \\multicolumn{2}{c}{\\cellcolor[HTML]{EDEDED}\\textbf{HM}} \\\\\n    \n    &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Two-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Three-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Two-Class}} &\n    \\multicolumn{1}{c}{\\cellcolor[HTML]{D9D9D9}\\textbf{Three-Class}} \n    \\\\\n    \n    \\arrayrulecolor{Gray}\n    \\hline\n    \n    \n    Baseline &\n    .50 (.00) & % Baseline 1\n    .50 (.00) & % XGBoost\n    .50 (.00) & % Baseline 1\n    .50 (.00)  % XGBoost\n    \\\\\n    \n    \\hline \n    \n    Europe &\n    .58 (.03) & % Random Forest\n    .50 (.03) & % MLP\n    .89 (.03) & % Random Forest\n    .86 (.02)  % MLP\n    \\\\\n    \n    Asia &\n    .51 (.02) & % 2-class\n    .52 (.05) & % MLP\n    .79 (.03) & % Random Forest\n    .74 (.01)  % MLP\n    \\\\\n    \n    Multi-Country &\n    .52 (.03) & % Random Forest\n    .53 (.02) & % MLP\n    .83 (.01) & % Random Forest\n    .86 (.03)  % MLP\n    \\\\\n    \n    \\hline \n    \n    Europe (Balanced) &\n    .53 (.02) & % Random Forest\n    .50 (.05) & % MLP\n    .86 (.04) & % Random Forest\n    .82 (.03)  % MLP\n    \\\\\n    \n    Asia (Balanced) &\n    .52 (.04) & % 2-class\n    .54 (.03) & % MLP\n    .79 (.02) & % Random Forest\n    .76 (.02)  % MLP\n    \\\\\n    \n    Multi-Country (Balanced) &\n    .53 (.02) & % Random Forest\n    .52 (.03) & % MLP\n    .81 (.03) & % Random Forest\n    .78 (.02) % MLP\n    \\\\\n    \n    \\arrayrulecolor{Gray2}\n    \\hline \n    \n    \n    \\end{tabular}%\n    }\n    \n\\end{table}",
        "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594": "Multi-Country and Continent-Specific Models",
        "2211.03009_c7530882e953cd5680faf233534ebffd": "Finally, in Table",
        "2211.03009_7d7dc58d9b67dc2830d164fcbc66ad8b": ", we show the results for the multi-country approach and also the continent-specific approach that is similar to the country-specific; however, instead of countries, we considered two continents: Europe (Italy, Denmark, UK) and Asia (China, Mongolia, India)",
        "2211.03009_e09129b7dc15c6e8fed90adea45ec607": "The primary motivation for examining these models is the result we obtained in the country-agnostic approach, where for HM, models trained in European countries performed better in other European countries with HMs",
        "2211.03009_785f21d36e0b9d75fb7674edccbaddc6": "Results for the continent-specific approach show that models performed similarly to any other approach for both two-class and three-class inferences for PLM",
        "2211.03009_6a807f18abd6ed82ac4671ea019c0166": "However, the Europe model for two-class inference had an AUROC score of 0.58, which is second only to the Mexican model (0.62) in the country-specific approach",
        "2211.03009_623ca96b4fba2d8db43f996fab263d05": "Furthermore, results show that the continent-specific model for Europe with an AUROC of 0.89 for two-class inference, performed better than the multi-country (0.83) and even country-specific approach for Italy (0.82) and Denmark (0.83) and closer to the country-specific UK model with an AUROC of 0.91",
        "2211.03009_f491eef06141ccf17f25863c34e462fe": "Similar results can be seen for three-class HM inference",
        "2211.03009_6e145f500db4566f515b2e28cb4efb46": "This suggests that for western Europe, where everyday patterns might be somewhat similar across countries, continent-specific models could perform reasonably",
        "2211.03009_9ba907992378c7c17a95c4bc72fe0282": "However, for the continent-specific Asian model, it is not the same",
        "2211.03009_c1180887627ede7086cfebe1863eb8df": "For example, for the two-class inference, the Asia model had an AUROC score of 0.79, which is similar to country-specific China (0.78) and India (0.79) results but significantly lower than the result for Mongolia (0.85)",
        "2211.03009_1f751eaafd66b0f6c526c5629fcd1534": "On the other hand, for the three-class HM, the Asia approach reached an AUROC of 0.74, whereas China, India, and Mongolia models reached 0.79, 0.76, and 0.84, respectively",
        "2211.03009_6525bc11e8dac4ac5a10b13209ed2f97": "Hence, continent-specific models did not perform as well as country-specific or multi-country models for Asia",
        "2211.03009_027ffc1af21877811a745d73e1237b29": "This could be because even though China, India, and Mongolia are geographically on the same continent, the behaviors and cultures of students are different",
        "2211.03009_c7a6ff6918b4151a8ae75305c6b8d8d3": "In addition, ‘balanced’ models decreased performance for Europe and Multi-Country, whereas for Asia, it is not the same, where three-class HM performance increased in the balanced case",
        "2211.03009_430a60cc55ff3cbc1c5ec84856a95943": "Again, this is because India and China get more representation in training, leading to better performance in testing.",
        "2211.03009_971f077f2d6951306929868745a64f83": "\\begin{figure}\n    \\includegraphics[width=\\textwidth]{images/FI_CS_HYBRID_2class_v2.png}\n    \\caption{{Country-Specific HM: } Gini feature importance values from RF models for two-class inference.}\n    % \\Description{}\n    \\label{fig:fi_two_class}\n\\end{figure}",
        "2211.03009_33b99b551e07b52309f0aff3d1d36d46": "\\begin{figure}\n    \\includegraphics[width=\\textwidth]{images/FI_CS_HYBRID_3class_v2.png}\n    \\caption{{Country-Specific HM: }Gini feature importance values from RF models for three-class inference.}\n    % \\Description{}\n    \\label{fig:fi_three_class}\n\\end{figure}",
        "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6": "Gini Feature Importance Values",
        "2211.03009_68c803214d06dda4d576d0eb278c42f0": "show the Gini feature importance values for each country for two-class and three-class mood inferences with HMs",
        "2211.03009_d8a5e89fc5663479a355d0fa554b1ac6": "We report diagrams for HMs because they provide the highest performance",
        "2211.03009_3c21d2840ae4842f27885d6f536c20ab": "Further, the top five features within each country are marked with numbers from one to five",
        "2211.03009_7b0dbc82fcb990e817099af3bbfe7823": "Moreover, in both diagrams, values are arranged in the decreasing order of values in China, from left to right",
        "2211.03009_6c1c596737b26dd359d4f1bcaf1bb75d": "For both inferences, many apps had very low feature importance values",
        "2211.03009_4df969032016eed3cab61c1527ec1bf1": "On the other hand, `app personalization' and `app tools' were among the top five features for many countries",
        "2211.03009_42d25bdf57c3eeb91ee8d5062bd2a4f9": "For the UK, personalization apps were highly important in two and three-class inferences",
        "2211.03009_e5502f4c1ee7251e0f3eec4cbe6fae0f": "However, for Mexico, the importance of the feature was relatively lower in both inferences",
        "2211.03009_bd13d509b11a16e1575d14e3ce2eee61": "In addition, the number of touch events on the phone was within the top five features for Italy, Mongolia, Paraguay, and the UK in the two-class inference and all countries except India and Mexico in the three-class inference",
        "2211.03009_081529e5c489dcdf8205261bf37735f7": "This aligns with previous literature that presented findings of typing and touch events indicative of aspects such as mood and stress",
        "2211.03009_29374e29352d13dd653b5756ed480df9": "Another feature discussed in the literature on psychological aspects and mobile sensing",
        "2211.03009_0e6400b1325b0b77824a932893eda553": "\\cite{canzian2015trajectories}",
        "2211.03009_31e590b16e94b1133a1cd9a300986821": ", which appeared again in the diagrams is speed, calculated using location sensors (`location speed mean')",
        "2211.03009_114fd1774c475f67ecfbe038aadd1382": "Diagrams indicate that the feature was in the top five in two-class inference for India and China and three-class inference for India and Paraguay",
        "2211.03009_6645b4d4b1f7e44edc58082404963058": "In addition to these features, multiple features captured using Wifi signals were among the top five in all countries",
        "2211.03009_c07050be68d3e127d32f9d481a1e8c9a": "Wifi-related features (i.e., `wifi std rssi',`wifi mean rssi', `wifi min rssi', `wifi max rssi' - The standard deviation/mean/minimum/maximum of RSSI signal strengths captured with unique devices within the time window) were present with high importance values for all countries across both inferences",
        "2211.03009_c6b6cb8df979d3bf236d4a987ad15756": "Prior work highlights that the number of wifi devices and signal strengths could be indicative of user context, including the location",
        "2211.03009_9facd058e9309a35d1a92f3fac7e0a4f": ", and location-related features have shown to be closely tied to the mood of individuals",
        "2211.03009_4b200da821dc6321dddb0107d5d9f601": "In summary, the top five features for mood inference, regardless of whether it is two-class or three-class, were not the same across all countries",
        "2211.03009_7d9fb7290c54fffcf85a127f84c6f193": "Certain features are unique to individual countries",
        "2211.03009_0f918c7846514523e51abd7c2a4fe557": "At the same time, we can also observe a specific set of features (shown in the left quarter of both figures) that consistently appeared on the top list in all countries.",
        "2211.03009_eed9474fd944d045ff056d20004acaa3": "Discussion",
        "2211.03009_5ffc36c314ff8f5801a02403e71b45d5": "In this section, we discuss the main findings of the paper, and highlight limitations and future work.",
        "2211.03009_0eebd4450e095d5d73493693b025c7ad": "In the country-specific setting, PLMs did not perform well across countries, with the highest performance for both two-class and three-class inferences coming from Mexico, with an AUROC of 0.62",
        "2211.03009_1fb87a687ef6c8300a4f570b07fd3691": "However, performance increased significantly, with HMs showing the effect of personalization within countries",
        "2211.03009_cdd9989edfc483840728b675661f242a": "Comparable performance gains were observed for the multi-country setting as well",
        "2211.03009_5f3be63f738da712f05c62397c0585c4": "However, country-specific models (AUROC scores of 0.78-0.98 for two-class and 0.76-0.94 for three-class) would be preferred over multi-country models (0.83 and 0.79 for two and three classes, respectively)",
        "2211.03009_5ca896561a504a583cbc69ede94eac8a": "Then, in the country-agnostic setting, we observed that even HMs performed poorly compared to the country-specific setting",
        "2211.03009_b3b25b2b4afbdf55d49dc4a20936d96d": "This means that if a model is trained in a different country, even if it is personalized to a person in another country, the model might not perform as well as a country-specific model that is personalized to a person in the same country",
        "2211.03009_25eb591aeb134407f71df8370f7d1f94": "However, we also observed that models perform relatively better in culturally similar countries (i.e., within Europe)",
        "2211.03009_64e12314811fe2c74489d1085102a846": "Within Asia, even though countries are in the same geographic region, cultural differences (i.e., India and China have different cultures and behaviors) could be one reason that did not allow models to perform better",
        "2211.03009_a04df115f0dd3d2f8ad2ef7f6a156059": "Finally, building continent-specific models for Europe worked reasonably better than for Asia or a multi-country setting",
        "2211.03009_0a35831545efe9941535a99bc3aa3a83": "Please note that the number of participants in several of these countries remained small, and so we cannot make any strong assertions.",
        "2211.03009_d5608d39db85861d0dadeb5bf899caba": "Comparison of Results to Previous Studies",
        "2211.03009_579ed885f39b0f9d54e68f78ef91e1b9": "First, it should be noted that mood inference with smartphone sensing data is inherently a difficult task because of the task's subjectiveness",
        "2211.03009_180b70564aafa80d5891bd090e3b0dcc": "In this context, if we consider the results we obtained compared to some prior work, LiKamWa et al.",
        "2211.03009_8105cbd7b6d627060956b698b86fa95f": "showed that they could achieve a 66",
        "2211.03009_2fcf14d9bb99415096285ac56d8a75dc": "accuracy with population-level models, around 75",
        "2211.03009_d1c0c727648220fe9e1396ba2e45d8d0": "accuracy with hybrid models, and 94",
        "2211.03009_9c214aa86068a1123d44c4ed5777854f": "accuracy with user-level models",
        "2211.03009_876081ce8da2d14b6781c3ccb092ba38": "However, comparing the results in their paper to ours is difficult because we reported results with AUROC, which is a more holistic performance metric, especially in an imbalanced class scenario",
        "2211.03009_43e5c9a50e17df319f70142527b85418": "However, purely in terms of numbers, the performance gain from PLM to HLM is greater in our case (from around 50",
        "2211.03009_0653c5b72979a2a90d1739fd5edfc787": "to 80",
        "2211.03009_5472f3459757fd3bb656507369b67c96": "This could be because of our dataset's more extensive set of features compared to their dataset, which only has phone usage-related features such as messages, calls, websites visited, and app usage",
        "2211.03009_a0e937901135bfcc91b9899219a8e8d8": "In addition, they modeled the inference as a regression task using multi-linear regression and provided model performance as a percentage using an error bound of 0.25 around the predicted value",
        "2211.03009_762df031ccb04d92aa2f3b0229c23d17": "Another paper that used a similar dataset was by Servia-Rodriguez et al.",
        "2211.03009_ae0efb6fe1bfd650aa6f0a5190b2dd70": "It is also worth noting that this dataset contains data from multiple countries, even though the analysis did not explicitly focus on that aspect",
        "2211.03009_1f89e1eaf847736e45fa2c6923e7c18f": "Furthermore, they only showed results for PLMs, obtaining an accuracy of around 70",
        "2211.03009_57732674c40aa8c5e7122e5fef338bca": "for weekends",
        "2211.03009_17b2bbe2ae427a3577829115c9f90068": "Again, purely in terms of numbers, this is a good performance compared to what we obtained (AUROC scores of about 0.5)",
        "2211.03009_b148fed99a8205536f881684fa021da0": "However, it is worth noting that they only reported results for weekends, for which inference performance was high, and we do not separate weekdays and weekends",
        "2211.03009_3f47c87e0d72c49da65d4ce5a239282b": "In addition, the feature sets used for inference are again different",
        "2211.03009_1060d9a59b4523c10791cb2c2200ac28": "Another potential reason for the lack of performance in our PLMs could be participants' lack of movement during the pandemic when data were collected",
        "2211.03009_73dc50c3f21a2c915284b190ba90ad53": "This could result in sensors such as location (used in both the discussed papers) not being highly informative of different moods",
        "2211.03009_8af9d1e10308b76f7368acd9ed09f2c4": "Hence, this could lower the performance of our models",
        "2211.03009_6c6b98f5b75e2b97f1f3766f23e8b066": "Interestingly, one common result across all three studies was that fewer negative labels were reported, which could make the development of fully personalized models more challenging due to the lack of data for negative classes from certain individuals",
        "2211.03009_3e951fbb763b0d858276cc3d59b34c29": "Hence, future studies could look into ways of capturing negative mood labels accurately and more often using different techniques",
        "2211.03009_1696f9f57f7aba6ba88aabe908a129cd": "In addition, model personalization in situations where some users lack data for certain classes is a potential problem that could be explored further (a similar skewed labels-related scenario for depression detection has been discussed in a recent study",
        "2211.03009_a7cb15e2b01cc0c97558d09f6787da63": "\\cite{xu2021leveraging}",
        "2211.03009_ce96ce64475d88003b81a20710c10f5e": ").",
        "2211.03009_d18587b103a1306364e47d2acaf38267": "According to Gong et al.",
        "2211.03009_09b6d4a40b8ef3bdf4c9a7d2b200bbee": "\\cite{gong2019diversity}",
        "2211.03009_27825bbb006f98572e7ced1486c8638b": ", diversity and diversity awareness are topics in machine learning that have gained importance in the recent past, and increasing generalization and decreasing biases in models for different populations are two fundamental goals discussed in this domain",
        "2211.03009_77d6031d99c7826e09cf18806b07cc82": "According to them, diversity is achieved in machine learning with data diversification (maximizing the informativeness in training data such that the model fits data better), model diversification (increased diversity in model parameters leading to better learning), and inference diversification (model provides choices/information with more complementary information)",
        "2211.03009_c0fc963b3832ed63af3709a8a32e1593": "Our study examined diversity awareness, primarily with data diversification",
        "2211.03009_4c045f73f1c5c439f13995b957507b10": "Since the whole data collection was done to emphasize the need for diversity awareness in machine learning-based mobile sensing systems, we defined diversity based on social practice theory",
        "2211.03009_154ffe97be7d73ac078e1e3da9fc412c": "\\cite{harrison1998beyond, schelenz2021theory, giunchiglia2020diversity}",
        "2211.03009_b0b15ecd35a0913761ee1c913939dfc1": "Accordingly, diversity is a complex and multi-layered construct that does not exist within individuals but surfaces when two or more individuals interact",
        "2211.03009_c1c3ec1e541b209cd87c987883b3dc54": "Considering these conceptions, data and model diversity can be achieved by considering various types of diversity attributes ranging from country of residence, gender, and age, to personality, values, etc.",
        "2211.03009_61b2b44c77e6e265c47254c396d39a80": "\\cite{harrison1998beyond, schelenz2021theory}",
        "2211.03009_4fcbebe0045e6a19bcaf545df149d633": "In this paper, we focused on ‘country of residence’ as an attribute for analysis because of the way mood is perceived and expressed, as well as phone usage and everyday behavior are different in countries around the world",
        "2211.03009_ee4af4ed459155e88631edcbfd5f2179": "In future work, other diversity attributes could be used to study mood (e.g., studying personality and mood with mobile sensing)",
        "2211.03009_619ec8ab12b765b331048c944017292a": "Furthermore, other constructs collected in the study (e.g., social context, activity, food consumption) could be examined with mobile sensing, using country as a diversity attribute.",
        "2211.03009_065193050ea94ec61e8250365360f583": "In this study, we considered the geographical diversity of users when building smartphone sensing-based mood inference models",
        "2211.03009_0a9b9790435bfd5e73f05d827eea25b5": "Hence, our primary construct of diversity is the `country of residence'",
        "2211.03009_1e05284606b985ddeb8b2b00e5d480d1": "However, depending on the city, even though it is within the same country, the cultural composition of students could vary significantly",
        "2211.03009_33300fe1dd0fb72766996180c6100ad9": "For example, our specific university in London, UK, is considered more diverse and has a high international student population compared to our specific university in India",
        "2211.03009_2fc6df42504e53522d457e171aadef58": "These differences could also affect inference performance",
        "2211.03009_806103cd519c0af0fb0747152e8d4dc9": "In addition, our study also leaves the open question of whether the geographical region affects mobile sensing inference performance, or whether it is the culture of study participants that mediates their everyday life and phone usage behavior",
        "2211.03009_400a7506ac98a893db7b34302f46aca1": "presented some initial results about these aspects",
        "2211.03009_a41683be8e8f6fbdeefb36b5a2438202": "Future work could investigate these aspects further.",
        "2211.03009_b26ed9545874636ffb7c6071e263af5b": "Mood is a self-reported internal state and thus constitutes sensitive information",
        "2211.03009_5073aedac4c00ade3e5e3d94814aef9d": "Ethical implications related to inference of affective states have been discussed in previous literature in affective computing",
        "2211.03009_53162b898a75294c8027298413bea055": "\\cite{cowie2015ethical, pai2022the, mohr2017personal}",
        "2211.03009_e3ea8c1cae198021754713c80a2b6aea": ", ubicomp",
        "2211.03009_8c3e4a16c0f66b92aa8f1f1688cb3117": "\\cite{hilty2015ethical,nihan2013healthier}",
        "2211.03009_3c5546b86c3d33c72209d30cbb32c433": ", and other disciplines",
        "2211.03009_5b0ecade66b0baa6067ecae3f5838b13": "\\cite{bostrom2018ethics, mohammad2021ethics}",
        "2211.03009_833b320698b0c5a7ffa8d934f2e4f711": "From the perspective of possible applications beyond supporting research on youth well-being, as we do here, it is fundamental that human-centered principles are followed and limit their use to cases that benefit individuals and avoid potential harm.",
        "2211.03009_8a61bf26553ac09e81fc071b4948c24e": "In this paper, we showed how mood inferences could be done in the context of a mobile sensing application",
        "2211.03009_debee0667e980b557e1ae7be8ad720b2": "In addition, we also showed how models lack generalization to unseen countries and the need for personalization",
        "2211.03009_584fecc8e33c41777c4fb3c5329b9b87": "However, a limitation of this study is that the study was conducted during the pandemic",
        "2211.03009_387e46c5c961e23f8377e44750ac9a05": "During the data collection time period in 2020, many countries have imposed different measures to curb the coronavirus",
        "2211.03009_13f603a97dd5608491418792930bce83": "However, it is worth noting that, except for China, where strict lockdown measures were not present, universities have been in remote work/study mode in all the other countries",
        "2211.03009_c0801b22ab34e013d45e1b934bf34c96": "Hence, most students engaged in their studies from home",
        "2211.03009_c27ff1013683ba984df4b8cae1eefeaa": "This could be the reason why there are many app usage, touch event, proximity, and wifi related features informative about mood according to Figure",
        "2211.03009_f9427d7eb326dd2439c05ccb6cfbc321": ", Figure",
        "2211.03009_c32ff053dde70041226bc7eee724f5f0": ", and Table",
        "2211.03009_83f2efb3efa1bd5e9925763c7beca341": "It is also worth noting that the seasons in each country during the data collection period were different",
        "2211.03009_d094f68218ea1f864333e368bcdee07c": "On the positive side, none of the countries were in extreme winter or summer seasons",
        "2211.03009_5b0d7c2fd988c262d93d539ed8d1aec3": "The September-November time period in European countries is the fall season, and none of those countries faced extreme cold weather conditions during that period",
        "2211.03009_bf04f3b549240e4a5715392f3defbf52": "At this time, the season in Mongolia was comparable to European countries like Denmark or UK",
        "2211.03009_c7b0b3bf2fb7cc79b7d58146b00ff701": "All the other countries had comparatively higher temperatures",
        "2211.03009_78382217ca74efafb195bc5cfac608a1": "However, given that students in all the sites were affected by movement restriction measures and were stuck at home, we believe that weather conditions might not have affected the study as much compared to a time period when student behavior in outdoor environments would significantly change based on weather conditions",
        "2211.03009_907d5ab6b4c2a3cc750ae1788a436947": "However, the results should be understood and interpreted with this limitation in mind",
        "2211.03009_00113954fe74d063f746f4cbea4fdf78": "Future work could explore the effects of seasons and weather conditions on mobile sensing-based inferences.",
        "2211.03009_ed50f3d94829b059a319d0ca75972419": "Domain Adaptation for Multi-Modal Mobile Sensing",
        "2211.03009_ea53ab750ec93bc288e0e4b5979e9f9f": "In this paper, we highlighted the issue of generalization and the possible distributional shifts in a mobile sensing dataset collected with the same protocol in different countries",
        "2211.03009_bad3d6fd82074f0054769f173f94735b": "Even though issues of generalization, biases, and domain shifts have been discussed extensively in other domains such as computer vision",
        "2211.03009_5b79f868958c15afa1911a10d40bec5b": "\\cite{luo2019taking}",
        "2211.03009_02958afbf7e2fa386583691b6d74b79e": ", natural language processing",
        "2211.03009_e5dae6b9320ccda54a4d506dbbdc54af": "\\cite{elsahar2019annotate}",
        "2211.03009_8fb11805dd99001a0793896a05b759eb": ", and speech",
        "2211.03009_4bf647774e04e02784184eba4010eb05": "\\cite{sun2017unsupervised}",
        "2211.03009_ed3a3d1cbd2f437c6c47bdbc45bc7696": ", smartphone/mobile sensing studies have not focused on those aspects extensively thus far",
        "2211.03009_856413100c81a721d7ebf9d29cb9bb0f": "\\cite{gong2021dapper}",
        "2211.03009_e6474775a94230a02e71a7168aa3a63b": "Even though we provide evidence of the fundamental issue, we did not go into depth about finding a potential solution for that issue, as it is not within the scope of this paper (especially given page limits and extensive work that would be needed)",
        "2211.03009_f4b22f2884dbede946d7be5e08dde7bb": "Further, even though we showed that model personalization (hybrid setting) could minimize domain shift to an extent, other advanced techniques inspired by the work related to domain shift/adaptation in other domains could provide cues for solving such problems in mobile sensing",
        "2211.03009_a76da96190a685084ed6141de6faa402": "Recent studies also suggest that domain adaptation techniques for time series data are limited",
        "2211.03009_34fde28f31f715cc0f1efc7202f9668b": "\\cite{wilson2022domain}",
        "2211.03009_97878b8165f5d21ed4752699abbb128d": "For example, a longstanding problem in the human activity recognition (HAR) domain is the wearing diversity of wearables in different body positions",
        "2211.03009_80b67eb13f66041371b227f29a1fdfef": "The wearing diversity hinders the performance of HAR models",
        "2211.03009_2f95a17defb039c8fb63f01e3298e57e": "A few recent studies suggested that unsupervised domain adaptation could be a solution for wearing diversity issues",
        "2211.03009_caec66214475d3e4084b306d53398a18": "\\cite{chang2020systematic, mathur2019unsupervised}",
        "2211.03009_31da2f825447e7a643fb12ba6c96c5ad": "Further, Wilson et al.",
        "2211.03009_86a708d1ddc713857b06a1fd05108534": "explored domain adaptation for similar datasets captured from people from two age groups",
        "2211.03009_f2185e2a9bb0e079cd01394c8cd5b09a": "However, the above studies focused on time series accelerometer data, which are more straightforward than the multi-modal datasets we are working with within this study",
        "2211.03009_1d6f7254ca5f056a682d68df141dfce7": "Hence, to the best of our knowledge, a research gap lies in solving domain adaptation for multi-modal sensing data coming from smartphones and wearables",
        "2211.03009_7e64e62da0b5e01c424c11b05c0d8aff": "In fact, in a recent study, Adler et al.",
        "2211.03009_5ca7967ff8170f956864cfdb52948af3": "discussed the issue of generalization in multi-modal mobile sensing data and showed that lack of similarity across datasets collected in different time periods does not allow studying generalization of techniques to a greater depth",
        "2211.03009_ccd7de545a67f3fb82c824d09e46dbf9": "Therefore, with the dataset discussed in this paper, we believe solutions to domain adaptation and generalization could be explored further (not regarding generalization across time, but across geographically/culturally distinct areas), hence pushing the boundaries of multi-modal mobile sensing systems towards more real-world utility.",
        "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1": "Other Limitations and Future Work",
        "2211.03009_5f615d8f5507b05c6e76685181cbde5b": "This work has several limitations and areas that could be improved in future work",
        "2211.03009_6d46f81c74055579c3bb7ee7e98a37e0": "First, the dataset used in this study is highly imbalanced, where there are fewer negative and very negative mood labels than neutral, positive, and very positive mood labels",
        "2211.03009_fce51b58fbda7b7cbf53378d9b627812": "However, this distribution is in a way similar to previous studies about valence",
        "2211.03009_6f8cd716b42da228d9171c2cfa0e0424": "Inherently, this also makes both inference tasks much harder",
        "2211.03009_8c589c7bd2fd97f27e6988712a7e173f": "On the other hand, there is an imbalance in the dataset regarding data per country, where Italy and Mongolia had a significantly higher number of self-reports",
        "2211.03009_1f358774618b7b5366f5b9fc71ac51aa": "In addition to the experimental results that we reported with imbalanced datasets, we conducted experiments with stratified down-sampled datasets for each country (each country having samples equal to the number of India, which had the lowest number of self-reports)",
        "2211.03009_d69a26a6c187179b9feeb4c6bb2cf76c": "While we reported some results for balanced cases in multi-country and continent-specific cases, more extensive analysis could be done to explore that aspect further",
        "2211.03009_689ad642d6447f642ea3f04c49f3f94b": "Hence, diversity-aware sampling strategies could be explored in future work to mitigate biases in mobile sensing-based inference models",
        "2211.03009_1a19050edad35084c3963b4f6898adae": "Further, we only considered valence in the circumplex mood model in this study",
        "2211.03009_fc6e0d2495f20a789bb8183f6620526b": "Other time diary questions were used to capture other behaviors and contexts, and we did not want to overburden users with multiple questions or lengthy questionnaires",
        "2211.03009_f3878df87fcb9622ea287cf8aefedebc": "However, we agree that collecting the arousal and understanding the geographical diversity of arousal inference could be studied in future work",
        "2211.03009_a9c99623fd25c17fae759c7bf2ba1055": "In addition, the clinical validity of the valence in the circumplex mood models might be questionable",
        "2211.03009_7aaf617c1728a063e51203e80be3d929": "Future work could look into conducting studies with more clinically valid instruments for mood inference",
        "2211.03009_00e23a0bb5d236816c8080e2e541bc71": "In addition, in this paper, we did not use a 'wrapper' feature selection technique before training models because tree-based models, such as random forest, inherently use 'embedded' feature selection with Gini impurity to find a set of good features to build the trees with",
        "2211.03009_e189a8ab0cbbd33a8dd2c9c4a8de7f67": "\\cite{FeatureSelection2021}",
        "2211.03009_3e0cec159ba91942286fd5fa7fdd142d": ", especially when the feature space is small (i.e., around 100 in this dataset)",
        "2211.03009_bffa390fe38ffa6bf7bb33f864a5dfac": "However, if the feature space was larger, the dataset size was smaller, or if another non-tree-based model was used, using feature selection is highly preferred",
        "2211.03009_27a2c07e4548bd9bb1956a1d62c57819": "Therefore, future work could also look into improving models based on feature selection and finding solutions to the issue of generalization using careful feature selection.",
        "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53": "Conclusion",
        "2211.03009_5a5f403698717160c50de04ff48fdf88": "In this exploratory study, we collected a mobile sensing dataset and around 329K self-reports from 678 participants in eight countries (China, Denmark, India, Italy, Mexico, Mongolia, Paraguay, UK) for over three weeks to assess the effect of geographical diversity on mood inference models",
        "2211.03009_4cbad527a75b3b5e6ac355da63178bfb": "We evaluated country-specific, continent-specific, country-agnostic, and multi-country approaches trained on sensor data for two mood inference tasks with population-level (non-personalized) and hybrid (partially personalized) models",
        "2211.03009_b2561936a37fbca05bd7d87a5241fae3": "We showed that partially personalized country-specific models perform the best yielding AUROC scores in the range of 0.78-0.98 for two-class (negative vs. positive) and 0.76-0.94 for three-class (negative vs. neutral vs. positive) inference",
        "2211.03009_5f8e850fb385d59444145a91f5d61ff0": "Further, with the country-agnostic approach, we showed that models do not perform well compared to country-specific settings, even when models are partially personalized",
        "2211.03009_847fb7836a4d0c493ecf004b391d631c": "We also uncovered generalization issues of sensing-based mood inference models to new countries",
        "2211.03009_e995ac428ebbc9bf2b3b0551bff6459a": "We hope that these findings will be of benefit to ubicomp researchers towards building future mobile sensing applications with an awareness of geographical diversity.",
        "2211.03009_7c07c47fde68f5dc134678d5def5acad": "This work was funded by the European Union’s Horizon 2020 WeNet project, under grant agreement 823783",
        "2211.03009_434b57174af21c7f82abed9c94d475cf": "We deeply thank all the volunteers across the world for their participation in the study.",
        "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62": "Appendix",
        "2211.03009_4d84da0dceec0f12788f3f3b96c435d9": "In this appendix, we describe how features were obtained for each sensing modality",
        "2211.03009_6749a5edbffd4657075bcaabf0eabe0d": "This is an extension of the description we provided in Table",
        "2211.03009_3e8c505a544d9dea69c4186dd5ee1f74": "First, it is worth noting that the analysis was done using a time window of 10 minutes",
        "2211.03009_4cc878c0a6d38e4eb046f2ba82f54772": "This would mean that for any sensing modality, we would filter out data for that particular time window",
        "2211.03009_96692c52377151e9d6ea1fb2556ff428": "In addition to the sensor data within the time window, we also used the last data point before the start of the time window and the first data point after the end of the time window, in some cases when necessary.",
        "2211.03009_3a860784aa6947e7d6d0f8f26016cf3f": "Location data were captured once every minute using either GPS signal or cell tower signals, depending on the most accurate signal available in a particular moment",
        "2211.03009_d21bff1dd4d1cb19a8315a1f01dda8a4": "We used the definitions for radius of gyration and distance covered from",
        "2211.03009_bc8c07f618e507cbc3903d746c96a3cf": "This enables to capture the movement of the individual within the time window",
        "2211.03009_2e3d7694e7a365ecf59d55bc5dbcd0b4": "Prior work has shown that movement could be indicative of different states related to mood and depression",
        "2211.03009_e8f70ec7f009889314287f0d4cbfa5d3": "\\cite{likamwa2013moodscope, servia2017mobile, canzian2015trajectories}",
        "2211.03009_7d6995caa3ed3a2d8fda6cf253cb49e2": "In addition, we also calculated the mean altitude using altitude values captured with location information.",
        "2211.03009_3d55b5f139a8320724eea23867f21fe8": "There were two types of bluetooth devices logged with the mobile application",
        "2211.03009_680dfdddb80943e405a6c281f91c69f8": "They are: low energy and normal",
        "2211.03009_dac78b2fcc3d1b1a511cbd2ec9626330": "For each type, the mobile application logged a list of devices found with device IDs and signal strengths to each device",
        "2211.03009_c394987c276c3537535eb72246388c5c": "Then, we derived a set of features with a similar approach to",
        "2211.03009_a23467a10beb238444cb95ba637d280b": ", including the number of device found, and statistical features regarding the signal strength to other devices in the vicinity",
        "2211.03009_6758e1893d86b0344c0c46c1955d866d": "This sensing modality provides the user context as prior work has shown that these features could be indicative of whether the user is in a device-dense closed space or not",
        "2211.03009_7a300274e2466e01e783c047a07c688f": "\\cite{santani2018drinksense, meegahapola2021one}",
        "2211.03009_f5941d58e6bf9209a4a29258e870e1b1": "For Wifi, first, it was calculated whether the user is connected to a network or not",
        "2211.03009_c88a29fe128152427b7916d4c26b1029": "Usually someone connecting to a network indicates that they are in a familiar environment (i.e. home, workplace, university)",
        "2211.03009_3dd6a2272a92c0e780ecf67d73f4e132": "In addition, similar to",
        "2211.03009_dbd8035238878038ee8a6c09e06c25ef": ", we also captured statistical features related to signal strength for all networks in the vicinity",
        "2211.03009_422f577bfea49040fa164e1bd465b09c": "This also provides data about the user context.",
        "2211.03009_fb5a5293511d165478ea3a3f00e93514": "The mobile app captured whenever users got a notification",
        "2211.03009_f70bab7a9a570cac7fc110cdc647fb19": "In addition, in certain cases, unless the notification was clicked, the same notification would be displayed again (e.g. this could happen in WhatsApp)",
        "2211.03009_52aa943422f574852053325322b2663e": "Hence, to capture these details, we calculated the number of notification posted by the system, and removed by the user, with and without the duplicates",
        "2211.03009_6dfd2daa8f73fe47952dcb21787b7808": "This gives an indication of the phone usage behavior of users.",
        "2211.03009_d6cc54792a06d08fb2a27f513d2fd47d": "Prior work has shown that proximity sensor reading could give an indication on where the phone is",
        "2211.03009_b4a4ec62deb8cedecc0365ca31e4747b": "Hence, basic statistical features were captured for the proximity variable.",
        "2211.03009_ec32a6a79ae2473a8a7db9f5c4115344": "The step count was captured in the study using two techniques for reliability",
        "2211.03009_7b5a6e9176972a7e42bbde339db33437": "First, the step count was derived using the total number of steps taken since the last time the phone was turned on",
        "2211.03009_e548d2a7cb688b609ba238ccfde26f45": "In addition, using a trigger in the system that sends an interrupt every time a new step is detected, the app also logged a separate step count called steps detected",
        "2211.03009_c71d697986eeb6e6216599c6697c9788": "We used both these features in the analysis.",
        "2211.03009_b7677d9fbdf690aff71116aa197b844e": "The mobile app provided the activity a person is doing, two times per minute",
        "2211.03009_c5ef67a502850788d00433ee310e8d5a": "This activity was derived from a probability distribution of 8 activity types recognized by the Google Activity Recognition API",
        "2211.03009_e2080ae79d10cf50b6175f21bad61b8a": "Therefore, we have a label of the activity the user is doing, roughly each 30 seconds",
        "2211.03009_68c050a7266705a65dee7e5e199037db": "For example, if the first time window is from",
        "2211.03009_01b6e20344b68835c5ed1ddedf20d531": "to",
        "2211.03009_e9b6705a8947f6a2103050660e738327": "$T+10$",
        "2211.03009_86c5a2a047d29699b6456e7cb01957e3": "mins, if the first activity label is at",
        "2211.03009_dedfbad0ae3dd4532363783197527aae": "$T+1$",
        "2211.03009_38287d167509bf5ae11ab23102bb0294": "mins, the second activity report is at",
        "2211.03009_e1a1bbc45fd70058d21ee960486d9d8f": "$T+2$",
        "2211.03009_ad9b1219400a22419419ee01200a9bd0": "mins, we would assume that the user has been doing the first activity between",
        "2211.03009_16765ff016e0a83a1771fce272ce6046": "min and",
        "2211.03009_1f5aabace95531b103d552ecc20d2b6c": "min, for 1 minute",
        "2211.03009_7093b6d2716f60d7532fef1a08dcb2ad": "Similarly, we would calculate the approximate time of doing all the activities",
        "2211.03009_1c14bfe98cc4a4e1d5afcf7dd481f15f": "However, it is worth noting that sometimes, the first activity label we get could be after 1-2 minutes after the start of the time window",
        "2211.03009_70b6a7f1917a18e431579f307bcc11d0": "This could happen because of inconsistencies in the data logged by the application",
        "2211.03009_fc2d2951ab5e68a221217cfd43110f30": "In such situations, we would also consider the last activity report before the start of the time window (let's say at",
        "2211.03009_d6a8745292ee044c894bcd13851df776": "$T-1$",
        "2211.03009_eaedf9b247355ae4f14a30793aaeb786": "min)",
        "2211.03009_e816cbf92141e9985b77126588990942": "We use the label of the last activity and include it in the calculation assuming that the user has been doing that activity from",
        "2211.03009_d8bd79cc131920d5de426f914d17405a": "min",
        "2211.03009_151d7ef7992bafa754d4254b703978c5": "Hence, using this technique, for each time window, we would have a distribution of activities the user has been doing in seconds.",
        "2211.03009_c1ca4dc50e12344500e151746e9aa4cb": "The mobile app logged whenever the screen was turned on or off, with timestamps",
        "2211.03009_deac75cb66e34bc3fc80897775b1e931": "This allows us to calculate the time users spent with their screens turned on",
        "2211.03009_adfd89d63754d8dcbca10d1e9ef656ab": "mins, if the screen was turned on at",
        "2211.03009_609a6b96c590e037f125f9d45be37ca5": "$T+3$",
        "2211.03009_983f4b094921bacd0ef250dc20f79229": "mins and turned off at",
        "2211.03009_503c52c8687d6807731898e21736b173": "$T+9$",
        "2211.03009_40418340e63fe71fe52622123bda89af": "mins, we could assume that the screen was turned off from",
        "2211.03009_d18050d2eee9377040a0a57f6ab4c9fb": "mins, and then it was on from",
        "2211.03009_bcdc61c9e1eba78ec94f831266a09e94": "We consider 1 such turn on-off time period as an episode",
        "2211.03009_fd8b81d9731a78c541cc2e88030ff9e5": "A 10 minute time window could have multiple such episodes",
        "2211.03009_3676e8f3a8abae409fd7f2a6c2e7f9ac": "Hence, using these values, we derived the number of episodes, statistical features for time spent in those episodes, and also the total time spent with the screen turned on",
        "2211.03009_266911addfc14b6cefa5061f55d15670": "The distinction is that this allows us to distinctively identify a person who has the screen turned on for a longer duration vs. another person whose total screen on duration is the same as the earlier person, but turn on and off the screen more frequently (e.g. in a situation waiting for a email/message from someone, turning on the screen to see the time, etc.)",
        "2211.03009_af8f8bc0942aa9eac7cbafdf36a089e2": "We believe capturing these information could have value when studying attributes regarding mental well-being specially since screen on time has been associated to mental well-being in a lot of prior studies",
        "2211.03009_4a63e0d50be2c8442c9ab9095bbfc473": "\\cite{tang2021relationship}",
        "2211.03009_a0af9a5033528097dbe055086e3bdd96": "In addition, the mobile app also logged all the touch events (this could be a tap or a keyboard press event)",
        "2211.03009_486656c51b1d42246451d30aef478f51": "Using the values, we derived a feature for the total number of touch events in the time window.",
        "2211.03009_769264ca156dbe4b34d253e36e8e5e4e": "Prior work that used app usage either considered the usage of individual apps",
        "2211.03009_4449a05884ffe55db4930709c4bb8886": "or app categories",
        "2211.03009_9d6088aade484116d48c2bcc83fe2be3": "For this study, we felt that it's better to use app categories because of the heterogeneity of the dataset, where users from different countries would use different apps belonging to the same category, to do a similar task",
        "2211.03009_bc8537ea7787ae0b533e59743b6326a5": "We followed an approach similar to",
        "2211.03009_23cd8f811421fca78434abfa196142ab": "and obtained the google play store app category (i.e. action, adventure, social, education, entertainment, etc.) for each app in the dataset, and used it to calculate app usage times",
        "2211.03009_66a75a6bcc6c98320113b6f972095ce5": "App usage time would be calculate from the time an app is on the screen to the time it closes or go to the background",
        "2211.03009_9b30cfef39a40e3ce537874fd7144181": "There could also be instances where the phone screen is on and there are no apps on the screen",
        "2211.03009_42fab2af9e281a0e9949dd9651e88f25": "Such time periods were included in the category called \"not",
        "2211.03009_36aec00ab8478199935d743dbfb3e768": "found\"",
        "2211.03009_d8be17b11dad65af6ada7237daba267b": "In addition, whenever we could not find an app category for a particular app, it was also included under the \"not",
        "2211.03009_6d2011b3fca00b12dcbe09fa5073416d": "found\" category."
    },
    "hierarchy": {
        "1": {
            "2211.03009_e353dbe42c8654f33588d4da0b517469": "2211.03009_9a7891a027a82bb26f895519d3e68a3b",
            "2211.03009_ee1d86667244b34af7a0e8cbb64a311d": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_3146ef71b3e74a013dc23c2d3d8b7674": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_a848d2bb2f4501e575ceba7c87243018": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_335924debaba11f2b402fa101b1b4902": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_0615ca0bcad2947f18d010dc3d967c8e": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_555c5f3013c94b56262877c925a12a33": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_8d9510dbb95efda5fc5de9ccf519530d": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_2077ffff24ce4a2040931deec75606a0": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_d19a0ac655b8cf28df1bcd50fb10a598": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_54a91c3b126ca2703f0754825f0fbfb1": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_413777eeb2e9c5669e435f8dda7a91ec": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_92748717ca96628e8a4e658620fc7ab1": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_61cfaa28a124e6811e6b5e6595a09109": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_0b3d4dfbff09b19c48e14ef03f2aaf5b": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_caa59772923f7ada7fb76ecffdb8e000": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_524a428f4b50d386066c83fa8c41de01": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_3efe4ac2b8a3e8fe61ab4c93d07aedc9": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_ed2efc94933fabf68527f18c1959b71f": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_27ebd0f272a327acf2f2bef6070cedea": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_40669d7f88430909ecc73320eb4d5e78": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_50509a01d8bd029c1b71cbff15d748cd": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_0c27d3bb6c4c989c9d60bb3d0259f515": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_729f8ff38b50aeac7f5ba4ad4f6c0c21": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_ca28dabe78fe29043ca3a2924026613c": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_5dd14615efeb2d086e519ed35efd3f73": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_0b79795d3efc95b9976c7c5b933afce2": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_8d08bd9135ec964d6936a97404f19d0c": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_fb925c8d948b50c23cf5cecb0badd17d": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_b0ff07611537fc9620cccadfc3213e21": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_15d6052f037e8aecd01b4734172a040a": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_85d02c08f8d6afec763df2d11981ca60": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_ca75675abf3d8f20701493a9fc59c8a3": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_097a96c3f4b82cc15e811e376cca492c": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_e29ed7da72c887456c0a4041bc6b1467": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_b92d646718b68c9b9723dc6013c56f92": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_163800ea8021b00c8a7c1f1877e0b9f1": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_41bc7de2b8959f1389bf85288f06e9bb": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_9a8e1203525b089a58d558d361d4123e": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_1bc46f45bf06f14db6df996ec9c38256": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_724c4fa20964cda8e8daf6902108ee79": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_8feb318ae8043c5ec5ba50c8d7eccfb7": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_dd6b938e4d54df95406e2c4ce016b41e": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_ebb674b8f10a47e869fb5841a76c0adf": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_1038d5c13f16f022b3c56b47cbbfcd9d": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_7548424e1b5cd4fe58871a2b9ad505ea": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_e48d1825cac370ea94b3994c1502245f": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_3e55977a58dee6a7a92291da294ff81b": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_ae1ea0a73498590f023898304130f8e0": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_6db92e91420f5da12c4a2ef50da9cfe1": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_21d1760f82190564feb7f873a771a0d5": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_12b7785a9a692fe5f02945abc27983dd": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_2219f6f69b41de80fa98a3e65833ddbd": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_2eb6eabbea0105e4724a1f243c651386": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_63368bf0d18509ac2c10f2115690fc60": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_0666ffcf97c5334350ec92acc68d03d7": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_c737b1e496f4e07c4e8cac597131b313": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_299cbdb88b00552310fdb07053d5871d": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_85c34941264b454f68d9bdb45fb3326f": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_814ad27dd2da47cf5f5d2e47a4732d7f": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_540b1b795113df6aac7ba59b272f248b": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_6624bf8ba396e74c9ed02c94cc7591ec": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_6d16a85b7ab7b23773b95641e67d0a42": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_d5ccbe8facfaf9a8f2b4561749277f3b": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_48ba5122d7f8b7301d13da658daceca4": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_441e912b40309c64f9ba94849c48c869": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_b73dda40a34c3537059bc58b694b4012": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_bd857965dd0782b59f0e6d98b4e09f72": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_8ebc0e5aedc2f2cff31741ee95e5b70e": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_b31e0147e174ca0e303f867f7e21a0d7": "2211.03009_0b79795d3efc95b9976c7c5b933afce2",
            "2211.03009_a8f65dd93445b90d34246cc201862695": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_7d74f3b92b19da5e606d737d339a9679": "2211.03009_a8f65dd93445b90d34246cc201862695",
            "2211.03009_3f9b507228bc1dee77d85f5745ddc04f": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_b87f6b7a145f75db316b865210144b3d": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_2615d058650d223901ac6b676fde1c98": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_3a47f6fbcc8a227453f3f55ed513a526": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_87fbec7de0ed7d814e9b0f18f27acb20": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_a348d6047f5b10e397f8b77ee2380cda": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_68902bd1ced7390ffd2357d439901cad": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_4d88e0e607efdd656d1e270fec64be44": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_5896db290370e547bd2211cc02dfde62": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_006992a4de9c78925209cb82cb5cf0c6": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_a634d76842e31f9efcaba35dcf675a8c": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_d92cb204aafe9d08b59dfe21b4f19105": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_0c89c32b52d2135b86b96556b378a753": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_8f478b2636c989e945e160cd9a2fa2bb": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_8a6ffa39ffee132f61627067b81dcec0": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_279e513272e417d3799bc25b04f38a4b": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_008c18e423608254a3b5e7fb2b27b90e": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_4352e33d2992f99a7a28f5a2c7432368": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_d8a96369d6f749fd678fb94eb29ebbd4": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_365d57045d688d635eff42b0c4015e65": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_2e2d69a7178955d1c78950920f27785d": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_458d6fc470a427d7a449d5f335e2211d": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_bef2faa3029262d4e0c215b0caf54960": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_d2c24d59e0baff4d0155fbdf62590867": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_da2ec937720c20e3405664c5e74891d3": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_5981ee1d2dc26e7e2ae5adcb7028f227": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_74e839a22db4c4411aea03874379c049": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_eb6e9fd4aa33851dc0f208f2442039af": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_5058f1af8388633f609cadb75a75dc9d": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_f36791fd11b29f26e27f40a1e26281f8": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_983e5073694b42a67c7ad75492a425d3": "2211.03009_f36791fd11b29f26e27f40a1e26281f8",
            "2211.03009_e5ced83bc8521ae58759544f1385c2d7": "2211.03009_f36791fd11b29f26e27f40a1e26281f8",
            "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa": "2211.03009_e5ced83bc8521ae58759544f1385c2d7",
            "2211.03009_a462b796e2a58e0a661756c35314ab9a": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_7faed00a79757065ac13ba18d5adcb55": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_5d2cc2a65729f737c14d45bd3414950e": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_c697714c3bf5bd0846cd880898444bf9": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_b9bc458fa4b2876950ed8d68596833ac": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_a14fa2e71453206b0f65666ce13dd97d": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_6c8437069c65e77e3f88930e0c941cc0": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_b91b86447f5144c2a79030487d76e10e": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_49d1b729615b44b65e87a70384a981d4": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_93d782ae0137be66f83cf7fb7264549e": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_be5d5d37542d75f93a87094459f76678": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_82239188158ac2ff70430afe3eddacb9": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_0e6fc1f73ccaec99fdebebbb80be2748": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_db94a1c940454d5693c49c295ce7d09e": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_0c2d477673ad5f14b8583cc988b59e65": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_8cef47f6f219b66134cbc25455340f4a": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_63a7c81ca627c0cb89a2325c13126ed6": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_a1076f1705c11b60b4585d2393a7e8ec": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_5c29a87beeed9333ee90527f3c082c51": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_9371d7a2e3ae86a00aab4771e39d255d": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c9115adb319d4f4a9aa140df4b5fa661": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_61dd6d1d9c1285417da5158650b7c1dc": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_b1a5b42ab9b6890565e3babb96e154af": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_a0a4fc7a2c17431f28352b3c5d5dbdec": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_52de106c2fa8a289f4f0600234a20c09": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_85ccf014ddc645b654409ccb2c185d71": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_ed42518ada7cf5f60d22365f39f9cae8": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_907bd851d4413441dd1b506ecd1c42df": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_139aa26c1ce1a4b5d73a39aa66c06f1e": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_f41fe5e77fb90874892b15a82965cacc": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_ebcc03f24f0b9ad074e876e850e47114": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_98a53c1cae62f841a6a565c27e71d744": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_9db2935111e9202cea904436610362fd": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_498ad85002702522347e02a2d0b37d31": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_bc0a5a6789136e4daa257d8b8141afe8": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_9a1c220c1afcf27e72fb3d242a41c212": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_8abc74a127225e7337152c4796645753": "2211.03009_80e680a28f68ed2e0e80c52ae2c772fa",
            "2211.03009_c687040d465a9cc872409591d7558f22": "2211.03009_e5ced83bc8521ae58759544f1385c2d7",
            "2211.03009_af029582cebba015ba107205540ec198": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_399a0c6264634d64606548b09650dae9": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_c282eaf861739b2f80de55c1a82f26fb": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_b5ede90e27706c31caa705a8ef68b02e": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_031107325c69b1c9a4b134b95d85df62": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_1afb74fe7e712eaa1f50c9ece962b9c4": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_7e7c08f234f6419f2b98ba0421b7606c": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_9842199cc376f88bce3aaf8affba4b01": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_f19ce4925c6ebbec2e21cc9e4f1ddb15": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_0c0abad7832177aa397088ec95b00115": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_d3425b3a18530462ae0581e507f4a25e": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_df7501dffc22ebbb45440b1e3b9af111": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_ed575673d2ccd43e8e1c8a1d9e6ecb32": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_ad8883bbe62d857ae2312be98ffd527b": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_cdaa1e5433daeddf252dcf7dc77747ea": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_707ef42617c5e26b83be6028383eb036": "2211.03009_c687040d465a9cc872409591d7558f22",
            "2211.03009_70f40d568404952ec3236f2274cfd772": "2211.03009_f36791fd11b29f26e27f40a1e26281f8",
            "2211.03009_90fcf16dab7eb88755865a9fca8edb30": "2211.03009_70f40d568404952ec3236f2274cfd772",
            "2211.03009_53fcaa4aad7016752b098e50f55d7513": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_ad2df2a343b9fe2ca8b872d0b8132be0": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_07afaaf8045b049e2742ee930644624f": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_332fd5c869aced0286e84b107b71c89a": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_92a5584ad85b8ffc346540a539f84ab8": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_a3eca3239d7640e66baeb88e98ca39bf": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_86564e7450bac027071fc7ef32929029": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_3c1ac42abf451d60064a6352f8ddf80d": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_f5cb7bd57f559a5fcb260ce14c23f0bf": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_7d83d8b7f71416ed0ad4b3bed3ddf5b7": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_3771fbc8c1c16099848dbc4bb5d9c3ee": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_392b0329815af4a8fde385f36e9c00b1": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_23e23cb9bfee9934e9234d8ccee4d08b": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_a8a28b51f098d09edfe753e506088b55": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_da7652b1744e3cd4befe12fb5ceec943": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_314c28b6f1fd26b0fd63a6046a353fd6": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_eba86585ce89def97bede72cba64cc71": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_652b6c7c9525caf180bcb6d05d43e1e4": "2211.03009_90fcf16dab7eb88755865a9fca8edb30",
            "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444": "2211.03009_70f40d568404952ec3236f2274cfd772",
            "2211.03009_6c7442140678240dfec8fbbd12d90189": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_7c217d420cd50c61043cc17b2cac6232": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_72859ca70671157ea1e5e5245e5380b1": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_6e8874f937a3fd6a00fd1b3788a1b51f": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_ecb52927aa04f15fd7646845fd17d229": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_4df4e4f48a300c2bfa928993e5b836bb": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_0bef340f08cb771340dba1839b6d769a": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_4f28270ab5df39c98b7e37c259655156": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_7765ab6aa640e4ec3d584cb24b91f7c1": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_bfff6800a07b38a22497c939385bd071": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_872d66e8955c95157640a7e0f5833027": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_92371f3a363f1eaa09c5e8dbdeeb5764": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_e071bc399cde10dd9474d980c2985161": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_0781693c039378cf7bb64526cf74dd26": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_89cc4c7fe1dec6b21cc7941960434d23": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_b05d319cb2f0b797db0ab4daebb469a8": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_f25b4aabb0341fceb69bd8a7aac90f5d": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_16f32c089b270cf2a5b1626704386c26": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_82e1d17888d8e501a6d182a296e2ad08": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_ac683f14d004e5b13bdb52a322b8abd6": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_6a57e661677006c9e7aa36cc9d34c45a": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_29c226519c3ea85a710814948ba7b1cf": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_a914a276a6a008e61e7958ab5745685d": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_b1ff18f7c319815acd9b1beaada25d2d": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_bfd7a877e07fcda6dcbc109c41919127": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_900b2c91700b10f8a8e67192e3f81bc6": "2211.03009_4b4c9f88c75b048a84c4e2a4bea02444",
            "2211.03009_eaa7a0f3534da1c29a67c2544781f43d": "2211.03009_f36791fd11b29f26e27f40a1e26281f8",
            "2211.03009_b090903d5fb4feba267e3bac79ad272d": "2211.03009_eaa7a0f3534da1c29a67c2544781f43d",
            "2211.03009_35734c7e922eb797d73d2c7a7a464b02": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_f2c44461c652ecd6cbd3df312602982d": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_c581252937f0e45dc74cd3f5ccf80148": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_90c207baf76ea5adc2955f8ae0de76ca": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_30731e059415c8e678da019069733126": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_62111bef6f927ad0502d669e71944c1d": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_070d5a8cb1d83594e252f6fbca30e9df": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_5e6775b19737f516b00d5d1e4d4e3684": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_f7e9d8d7b9c3f5872d9e651b4241f6c1": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_e6c516fd46fb12c66bd699a1e96b8a64": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_3856be1833d8fbef4cd578af432b8ee3": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_7159fe9505a0fad16a537a0fe0ad5f36": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_94e76c2b495ab694d621bd5db4615240": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_4458b4e002c8cf5b9330f72882fbea74": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_ec541878dc7ef370a80f8f306e059d5f": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_3b6f406288d8d2249555869eea3d1b52": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_b701c09c9444e55142480061e3b09f43": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_0372fbd538d68605e615b2896fbb2a54": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_a07f9255d586d769589065af68ccc41a": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_54c9b1258381ce90a056d8fd7240cbd5": "2211.03009_b090903d5fb4feba267e3bac79ad272d",
            "2211.03009_c7c0d8d3aa3fa493a63085349e433484": "2211.03009_eaa7a0f3534da1c29a67c2544781f43d",
            "2211.03009_5bb61e667352be9bab38a3575842a7df": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_88b82755d9958656b2a7eae65eb89a7d": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_df0fb717d880b5c65eccfb58e00ed022": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_8720aa36c5796bcaa54ab13e218660ce": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_0e221333926c3fd029b513d937af069e": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_fda172adbc212308649f465ccb2e8fbb": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_c34fe76ffb57bc76d093f09de57cbafc": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_9c4a18ae768495639dcdc6122293d7a3": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_915c33faae0fea39edbbd71d42b1f7d3": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_2058cfc75b30dccb1e29d19aa4b4351b": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_72c2b863df57eac9e681cacd132ac3e6": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_4fa6ebd98e27553bba6cb7d55f8f5b94": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_af088c178231616d1e886c64c3680a76": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_36d269f61feacc3cf8d77f1bbcd2cd22": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_60cbba5b4b0e8ef9895fec917019deee": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_cb457d311fbe54a8aa862a7d9f05c62e": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_61be4edb9ff868fafd592d686900231d": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_4d847f0cd4f6bb0eaa8fc082ceadd579": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_aedfda4cade53bd6d9e4aea60b14513c": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_17c24917ee086e5a9c90433e8fd8d297": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_3898954ec94c09102b774e0a4418fc3e": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_e336f016924c2c8890cf5b17c1faf863": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_b77a69a622a926201936a028bacaf0c9": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_5638fbefdbab79b0a2a5d67d88db7670": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_b4e9944bd641954ff9f003bb75ed1f30": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_cb050d4a26dac7b01295193570aad8e7": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_972e9876a1973f64446b26bbd9378749": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_b65f937e6dfca43f1365a0ef03a4bce1": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_3631aca0599a735a3afbb0afb37ecffc": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_7bf8911650c0293f1228bcf0c2930391": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_e47e9685fe0063a191ff29c4305ba6c5": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_79ffbefe578d07e8be2c77ea2cf101ac": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_57c3a1ee55a84f57262764c6033dcc22": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_f6405e3fc509ee0dd052f5313ae64e77": "2211.03009_c7c0d8d3aa3fa493a63085349e433484",
            "2211.03009_45ff46d868bdb38d75fa89a38562a5cd": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_6efcbc235b3721756a1f95f6426af09a": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_2f67357b4bf46f6867b841f6b2d2ad76": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_3f8d7be6c886259a0eec234b6ff30f3a": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_d0be9a5fd874bc76fd0aaab1949c1199": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_67cae1cfc38e0a310127696fc7c3a8a3": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_99ef51cf4db76e509c49d6503d8cc909": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_d9f3c70be527d6eb6bf066517ad22db9": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_4021ee4f7f2ceb8033f0b86888e580df": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_ca0e721d45d878e1a3c1b36097e941e4": "2211.03009_4021ee4f7f2ceb8033f0b86888e580df",
            "2211.03009_40314e505c2edd2c21043ebaffcb4f82": "2211.03009_4021ee4f7f2ceb8033f0b86888e580df",
            "2211.03009_9d285ed93fc43dc534ae0cf1d37c15bd": "2211.03009_4021ee4f7f2ceb8033f0b86888e580df",
            "2211.03009_ce00b7dff6201f65489fcbe404495377": "2211.03009_4021ee4f7f2ceb8033f0b86888e580df",
            "2211.03009_7a28d40b076019e5132a8f052886d24a": "2211.03009_4021ee4f7f2ceb8033f0b86888e580df",
            "2211.03009_fef9cda501692aeb26b0ee272ec904df": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_d71c7020ce0c03357a9cac3fbb7595c7": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_5fddf88c58c98df72ea22498a80f0b07": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_a1593c3e3bf2d528e30590cdb214309e": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_0352cff7e859bea20c0f244316a2adf1": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_434e2275b3dd029b6e064a6f46890893": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_315c20917d582c67fe1ce19d26e30cd0": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_5e655b135614f9720d31a14baaaecaf1": "2211.03009_7a28d40b076019e5132a8f052886d24a",
            "2211.03009_20262e314742c673494dbb831c2b4202": "2211.03009_4021ee4f7f2ceb8033f0b86888e580df",
            "2211.03009_cd952ecc2d9c081d11651d3012e98f5b": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_1ef44087f6c9a1409c6c972a9e37a6fd": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_6048759ee2e4da70bc5617d08522fc22": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_d3ead7150ca1438031390dc658d9352f": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_9d0de2aaafbccccd118a5a6ff54e6bfc": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_301310a388a8a0f905a3487b1a0ec796": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_65cfc378d28448a0bd14289701fa2c01": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_a186ce8e0bdca05a330622596241ba23": "2211.03009_20262e314742c673494dbb831c2b4202",
            "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_495069d6f22648bf1bcb7f4a56e2dd86": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_89a17c99597560dba1239339d05f63b5": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_84b56574633f9882d8764bd16647c185": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_24241f44ac26edef0778ded2f462f1de": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_5673d2a98915f194c4574de1fbc3dd1e": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_03e9a41892a5f6a569102ab4ad30969c": "2211.03009_5673d2a98915f194c4574de1fbc3dd1e",
            "2211.03009_a63d4382fff675349461697f32dc2f3f": "2211.03009_5673d2a98915f194c4574de1fbc3dd1e",
            "2211.03009_f7564127ef84f83fb8eaf5563bd3f9a2": "2211.03009_5673d2a98915f194c4574de1fbc3dd1e",
            "2211.03009_8490f305594660b5255f5f4bb5d52ff3": "2211.03009_5673d2a98915f194c4574de1fbc3dd1e",
            "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_c0efc6b32659b441f847377e646c905c": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_cee11e2b813dcbc50dbddde03053004d": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_0689ec10825b4eccfab66dea69879029": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_74363a68d510937d65d84a496e579cb4": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_d568332a5dd7235411903da2ecb2eda9": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_b280c82ea4692eaf19a5f7ade1d878b8": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_6a9a4c49c1b6742a904c04fcfa4d2e11": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_585de41a34edabc468132c8a2aab2148": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_830fc0c781573ddb13c877ba73dc3cb9": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_9f5fe612f28ba3abf2ca850dcfdffcfe": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_98a6a61c9ab16bb96fad18a864d68c10": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_0273a1d53731c8408a2bb07ffe044625": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_3950ed8ca69b1282117ad082939bebda": "2211.03009_199c0a6fadc6f7f0915273f5d3cd2b3d",
            "2211.03009_1a51fba8d166789d4ea99920df72015f": "2211.03009_4e6aea3a506c8b7be3c374e442d1dfa4",
            "2211.03009_b25fae92c78d9ffa0316edad6ddf3db1": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_c50f3492787c223b1a7980fdb8f5bf5a": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_6ac52f18b5dcb8ce31c659c5c23462b3": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_4193ff63e50333d05767da84f5763d53": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_456d6f324985400021ee02660f04a36b": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_2de9413bf988804f4e12bd11a446aab0": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_477a7e1af0e8cf2dfa1234a0f0c93d8e": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_ed388ca25ae05cf11d6dee8de27f63b4": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_31566d43272af3f5d2365b9319be58f2": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_2f118ee06d05f3c2d98361d9c30e38ce": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d19a06fb1c097f46d536472d6f15f394": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_8f6b3305f414e69b6aeae338a6f1f3b9": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_aadb61f5ce4bef9f58b9fbccaed36958": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_c869f5c784d6a7566f98158787490be0": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_640fd0cc0ffa0316ae087652871f4486": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_0f164aef149dd4ed1fc89cc5dd0cbcbc": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_d9cdea392375bd7618fe076b93792ee5": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_32c6e843b49494836ab9ed69a495506e": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_1eef7c7d9faace3e296df856e909199b": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_1a0a2e275c940ef509e4819da5c06e0e": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_53e1ecc37b1e04f1eb71ab58104dc9d0": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_cb11352fcaea6151d660f29f089ce001": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_395ebe4eb036fac01ea8c30fff40836e": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_960424f6f7fc164915ca56b1f5f401c9": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_0739a7f0161d5e747a1da0958d78828c": "2211.03009_1a51fba8d166789d4ea99920df72015f",
            "2211.03009_368f46984b7e507bd8bfdf666efe5330": "2211.03009_45ff46d868bdb38d75fa89a38562a5cd",
            "2211.03009_06db71b1c5c39c829e951190f5f7f1aa": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_9247de8259c96d06996bf93df19ec890": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_0eb24e16362eb6d9f964dd0a6b8bcf3c": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_8d4cc30fca5a408903549096d554d719": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_6b6cb39acc14ed810fe6c3a41c2bfe18": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_d19e9a5f0e90fd44120574059d665c19": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_928c8b0e707f80e7e488d35b123a29f4": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_d4913d3efd9a531592ae2d140d7905f6": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_3087aea5e533ebde1045ad5fd06eb49f": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_8ca256cbf6793428fe2498163461159d": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_ceab50459921c4fe0b0d410f8706bad8": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_04cc4cfae0c2b0434104b8e2b1647a7d": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_ea40371d24f176dcf68d391119c075a5": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_78846b74fff6829d60fdc98ac36e2994": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_a206c7e4bb9813dd4a8d31aed6f045cb": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_31958a60dfd0620c050c2b21b30b96d8": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_ee92933a3a0f3e8a154d43d018359e39": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_5584ac8a359f48edc7b9296f5dc0cce3": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_46ef091e27829da495e00ee40cd4a436": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_92915556be38bdb2c16ce02a21d6027c": "2211.03009_3087aea5e533ebde1045ad5fd06eb49f",
            "2211.03009_a0454ca3429f151e82e372de7a697869": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_f2c4d7cf068b5d04fbdefee931d048f9": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_eb308966b92ec2d5a2be2c50c4892024": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_b78b6df36f8052c99b682fcb335eac82": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_07a8794ab35dddcce204ff0ea2665841": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_69d9d23b654d11b243ff1c94839cd610": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_11685338ab7cadd6973f9255b35b865b": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_63abc75feb518f8bf8a15d287b818e58": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_033d3fa96012fc6e218f4cd82c569195": "2211.03009_a0454ca3429f151e82e372de7a697869",
            "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_ecbde8d121e0152245c745246613f0b2": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_7e7dc04814b24a5674fc03a58f127ede": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_5a074ab51a59f138bbdbd4b0ef7d0acd": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_d8698f3558c99e12653404bd3adaa915": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_3f66c2f9362a9c2c892d1040ea64d9fb": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_a47661cc32cc9246aa20d23ccc219129": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_bd37be2f811211412b963e22d1024ebb": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_ae99e9f864bfc442d46b10a41b0aa2f2": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_085de4b9ce51c4413d4fd5246ff1430f": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_26c463bd369bc3c6aaf864f480cefd12": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_ff0d9c0ae114d36d70f7edc3f4a8a406": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_2e1c58565751930d1c002c96ea2a98d8": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_1078dfeaaa5cc39b04330a9774e47e95": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_e52d15ea4e9280bf255ba22f558aab20": "2211.03009_4b7a76eb698ca761c2c09f7fba6c5dc3",
            "2211.03009_48452539f0e4eb44c328eb58e150bc9b": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_b5f5035cbf36e645e1e198537260fd5a": "2211.03009_48452539f0e4eb44c328eb58e150bc9b",
            "2211.03009_c883b3d43d6134ebfd0925db6f9c4075": "2211.03009_48452539f0e4eb44c328eb58e150bc9b",
            "2211.03009_43fcb00d5037f956529aaf835512e571": "2211.03009_48452539f0e4eb44c328eb58e150bc9b",
            "2211.03009_91bf8878dd3cb63e088a09d757224e0e": "2211.03009_48452539f0e4eb44c328eb58e150bc9b",
            "2211.03009_14a34c08521eb91f596ab7b7c0afa960": "2211.03009_48452539f0e4eb44c328eb58e150bc9b",
            "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca": "2211.03009_368f46984b7e507bd8bfdf666efe5330",
            "2211.03009_07fc4be2f69877763c7de3b8690cc9f0": "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca",
            "2211.03009_9ccfaa46fce9dd05306dea32051d6614": "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca",
            "2211.03009_4c2905aabb0f5f953a18cab851b5d636": "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca",
            "2211.03009_e219277a83c1da4af1199dda698746f8": "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca",
            "2211.03009_0a7188ce7947b679683b5e0090e2b322": "2211.03009_a01674133b5b3f7f2f4440cdedaa9dca",
            "2211.03009_1049e007fa59df903167e9cfbc470aef": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_be81ae1119a12bd07c2b2207490dba32": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_e8c72146788910c54a3e471c8125ce90": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_666df2f48cd16f38212c093999248769": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_c7f5173eb49ead5a7869ba0d161fcd29": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_175a86e3ace994ad93a601c9547327fa": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_1071f01918a5d64a129a0b44e5ea7af4": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_1d28ba8c4fdb4a056e93ba80a70b3a37": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_cb19dbc32b1649e84133212409b52563": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b2c925867dbc485068a4ea91c396c9d1": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_18c8732f190a96d84c94188b3fda4d91": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b47d06934be25d35b94b8e89bf7b5228": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_21a26d7e7075722dea1eee2cdca93f8c": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_5232776d9f7419292bd9cd5281bb59b6": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b2cc3cc2a21983c75825c388b92acc13": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_5f7a86f3c315a9f68ce88aa64e9250ea": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b474aedeeace1da25bacf91be42f7d67": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_bc67ae4fa4cfb7cc26a67bc21b6f00f5": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_9eeac81dcb07318976a5c540565d1ffc": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_c95ac75011d83fad81c542ab5538533a": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b92e86dd0caaea36a95ad072acf09346": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_ad8ab65f4af3bec8989e643f65ed803a": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b08e025c4204f66e1dba058e53b98914": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_193bd11cc5c1a38ab7345fab5e4d1910": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_66c8ad0c6ea82d6baabd3070986db6b5": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_66fa4944d6f4f7c9e3c7a7818a2a2b7c": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_305a1bc92db8a0bfea479b1bb11863c2": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_9d2df0a6f59e37d4e1e8db3beb926932": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_43ea6220b772639c3f3c3af3e6b2664f": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_ca200516178dc61c5f9dd8561bcbd189": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_c01277832e04aecb44b72feaab907d58": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_d016197b86ff91d04652b49e5778a9e4": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_8f1c2c2ffcd4b2c82de3273cf598f043": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_f378c6ef2c442c67e708a782d112b7f2": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_78bf75fd3a322b57796a6bbc3aef4329": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_a95f76432a5690399278831e382e1d04": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_2377c54d46b44c56fde64f72678bf57e": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_c207bbedea834aa7f3a221816d04eed6": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_a437f9880cf97aed497b2fc27a2c64ee": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_2f6264d1274d52379a60cd8d0f67cb4a": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_62834b202a9f105d7d57edb2cafbf523": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_7b8b56463fd366992ae9be3a64c83fc5": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_93e4c06e0b6ed69396b44670177b3273": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_3830e9ebfa1e8fe78d82c4c33599b8ac": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_6b84b58cb7030a07f6ec235902bcd063": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_12ce857508d2a4af7ccd8935c075d9c7": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_286a98d89f6d622095bb4e23086c56f6": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_3f58a2b7a5b7e0f76de4563408254d75": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_e7f03c99fee04ac2bbda37b24103a7d2": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_20bab44e5f93b8eb6ae3107dba29c8ee": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_c8e02cf4e60c62641afb3cba12f38041": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_100ce6fb8ee6c705c46b6755989cd040": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_d030873bbafc73115f9604337c2a3481": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_b8c23c960a109d4e98c3c948ec3bacb0": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_0d6831767d01d7182e3922b4a7a05b57": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_4df19f60cec3d4d9f876ce5cb5bb12e8": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_149c6e3f95aa560dd4e7827478cd1aae": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_ecb793d43f5ea1d72e325549c20b7d1b": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_bd0ef877f5a02fa1bc719ed5e95c4dd4": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_941b673926f75cbae8371d59a63422d4": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_9b469b6811fd18e0004aa938e49b0128": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_1462b1e4c9adc14c91e9fbeeb6465114": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_0f6a59a176d91846e0a5b46780793205": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_e3702884a575f3ff2962627a23ad9a75": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_36bcefdfa13f0051fa4507d79ba73546": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_3d160114e963c802541b6a83fee6a00d": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_770c83a495b3ec9e35fb13995b51745c": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_3fab810469e5d134e2ca922ad5943fbd": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_279d4fd79e20111ca7e9b4297d014bdb": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_a0b551425eb0fb702f884e81b420b966": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_2921639ba923031992ae4cbfafa40e3f": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_f05282b432057477aa421e7e141361a7": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_29a9a5fb9129d3cbe21a5ad3a8eaca19": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_3bb17cbccb3abfdd4a7288d727f6e69b": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_bc727ed50036cfafbd9186f6b26ea7df": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_ce6f00034cd85982a3f939cb52137b04": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_f0ee7a0929c8bcf48a7f296db0c4c24a": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_5652ea65ddf91406303f7c3818491392": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_e83f6679b80d47367272d93379f3f575": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_1bdf0b7040eb6b05f8bc22e06c386578": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_1d99a189b36389427338aa24ca810b4d": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_1dc96758f7bb4f6c67ef8cdb557b4e65": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_72a53ad1c9b95cdd72505f4943cc5b30": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_87ca9ed768b23b3c1db3857109b686c4": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_4c7d6f8cb87365801e5a43e1af4a0538": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_19eccc7e3bfbe61a136f6cebfb401ea9": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_2f42d904f8b6ec80f38280f5432407a2": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_5d75d55b99eaf918ccdb7de1a99b58d8": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_4376ecd02f2a4f8bdc3a0f767552c792": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_d573689af59f30fe68863022f8b4897d": "2211.03009_1049e007fa59df903167e9cfbc470aef",
            "2211.03009_e2265fa77c3f9df75d9f5b698a352323": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_d575842d81dec3a51d3f41c166db8bf4": "2211.03009_e2265fa77c3f9df75d9f5b698a352323",
            "2211.03009_2ccadd8689f3881e4d0ab72c57df23f0": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_fe7e5e6fedb779385d9743259e76b4c8": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_05fbb6792748c449bd8177660c851bd3": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_af8adb91dbe1d2ada70995078bd27bc4": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_ff3ce76350d671de2455bcda16e190e3": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_9a6bb153fc144f2925b60cd01e5ada30": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_03e3e49c1a6aa41bd88437a8fe67f9d8": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_eeea3d682ae870241f43df3658b7dc9d": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_7aa9219d84bc520d073fe91873044571": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_976a07fbdbaad237f45916ac9f6a4570": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_b783a9f41de0139201477f4f157c6f13": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_c9d54e3c02a9e777469eef13b0337e25": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_aa67b0f7422920317be0d5c63f924f3d": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_d11f6c6abd38b49c6ea597a74a90ef7c": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_cb39903dca7791bdd79bb21323825a83": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_d2a5ea4f99967a09ee1f224a3c875e83": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_529fe307e786653d481706f600619e30": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_d9735aca47bf4a74888ce9cea922f9bf": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_9080353851f40d3e28e1610c5e20b516": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_af34062e3180bf170583aa02e546d111": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_75df74ffb56c419961af888621baaece": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_ad083528f39c21c7cff4fa35fed416ea": "2211.03009_d575842d81dec3a51d3f41c166db8bf4",
            "2211.03009_e05b0bc885cf71d13ff0d225796323de": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_6c7b3da92dc7696fd2c5a260fb78cbf2": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_55a049b8f161ae7cfeb0197d75aff967": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_56e06de359ecb9c9ee3f4bdd82535192": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_875dfc39706fc3eb0b3bc313417d8254": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_f9c4988898e7f532b9f826a75014ed3c": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_b9d7c3b2c027a75ba37907bf50540f47": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_2a4447249acfee344f832816d3a99022": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_8bf8854bebe108183caeb845c7676ae4": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_2e48f7c09c24a049c4f1c82aefdc6fd2": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_91bf767c9a5546790d2422e29ea556ce": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_ee0971ffa2d49b847d90c3f25797b484": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_9c05b44ebfa5f3e3d8bb9afccd332222": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_37da842cc09d6afb19f036c0727aef27": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_0ff597398171a35b7903832640458c9c": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_98c36084e2f923df581b9617afea1987": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_f9d11348d33d2c7260a2780d63b941c6": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_e299ee374db21397f413b712d05d7221": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_55a1bfe0bcac990ace50e3de0485609e": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_e7fa5253b8af25f0b0f42c8aeade834a": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_b5ada2f0602080ec9a3115ce0ef3c509": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_31ec8cc35ad40c81d10bb4310abaa907": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_603ff91ae45330dd1f4311693e6b1f87": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_b6b8776f0e64728425ca9cd8fdda1df5": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_bcd7f5bceaf5781c2f75093314af0a0f": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_e55b64ece1158db92eb6d461c4beb958": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_a85b6730ee75cf88844996259a079904": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_bf0207bd4688c798b3137d0e36c6fda9": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_c7d46bbf68f297fe05366f0ad15a659f": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_ef59c5448b95df48c98669d16a7107f5": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_62e77a62658e277d6dba530fd92e5cff": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_0ca7de549219df7453ce7cac4dc83c19": "2211.03009_7d74f3b92b19da5e606d737d339a9679",
            "2211.03009_fd69c5cf902969e6fb71d043085ddee6": "2211.03009_e2265fa77c3f9df75d9f5b698a352323",
            "2211.03009_92b304be58de448ea24b3fbe9ec036b8": "2211.03009_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03009_84d8298209171837bf0e668735a9ba23": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_bddab35aee1a33c20b1d9b4f642a2d7c": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_b8234ee6f8b325d79fdf912df6f89d6f": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_f3cbdf0c7e8bd0252a944727266d8167": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_b136e72efdf709ff08da36636a2fb856": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_b0bdcfc681065a9855fb24dd1d258b1a": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_4ce85958757ae9e11abbbdb1b8295a93": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_64a04c17d704f300997d6e32a8dde7a3": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_731d433ced6c3f029292a2eb20d0bf3f": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_5b5871163c316de3b10ccc28dc70d7c5": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_77f3904ddd7d9b02ecb7af7ef9f63f72": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_cecdbe22e808ab29fdb29dad9fc73a79": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_6a8412d498136cc702f90447edb6c13c": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_c5810cec1faf1d3fe9604bd1449d015a": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_22c8b0707b18ca52fc75760f4d8179ad": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_8a3f545253e3d2dfe0c4de3dc1901865": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_4b34ae288d93bf6d2b65917ba2bebec3": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_7e5f19623cf92c3b7a55445202d88d02": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_b87225d4b52ffe29cf9c804cb5b0d1cb": "2211.03009_92b304be58de448ea24b3fbe9ec036b8",
            "2211.03009_291efcada0f980f2202fa0a2a14b6261": "2211.03009_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03009_84ef0921c808770d858fbae3ba572ec3": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_51c45b795d5d18a3e4e0c37e8b20a141": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_54811f467db274f5bbca328368d5aa42": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_f385133ba911fbbeffb3173e10671094": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_f9987df42223c650fb1b32254a86bbe9": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_e9507cdb9b1a6be11074cd4d3907def3": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_5efbba7cd6e9bf4c5f680778d1d46102": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_bb2c2441b01660f61cbb4d874a4db03a": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_a778b292f226a7544a7466ea73a24638": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_4f7469a17c3296e587716360adc94490": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_928d29bc9b50f0a518f66333b13ff0e6": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_e8397e2f81ef0769a7daa3093e6927fd": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_104ccc19a8396d5fb14fc6e0a3ede9d9": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_ff4e23aa366ef05b16b06aba23f5bffb": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_b4e55cf3e8ed688bab601e41397355be": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_e388c057226a8f75940b31db965b7c9b": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_379e74caaf0867706814943d227be4ce": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_6b7f8365b5f3f4a4cf1ecf402355b516": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_7a63304c0ecf17579b7338354e826dee": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_d86b99963194ff2cecc78e20b4fb7a73": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_dab716b85891663a862e89ef2b283bce": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_27eda9f88354d8ce20ab438f945d150e": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_2b459db1d78b1bae6f10adb69d47b240": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_544db2a0ef2167ffbee5b6183ea09a3d": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_6abac6e575f4e8f07e19425d0820ff02": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_4050ccea024438be99356e4d4c46ba80": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_bd7a02476a5c682b93bdddcd95b4b3e4": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_ecf74b45b06415b2454d58ac0d979566": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_f92646cfa07f953248bf4e3d0bca09e1": "2211.03009_291efcada0f980f2202fa0a2a14b6261",
            "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594": "2211.03009_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03009_c7530882e953cd5680faf233534ebffd": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_7d7dc58d9b67dc2830d164fcbc66ad8b": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_e09129b7dc15c6e8fed90adea45ec607": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_785f21d36e0b9d75fb7674edccbaddc6": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_6a807f18abd6ed82ac4671ea019c0166": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_623ca96b4fba2d8db43f996fab263d05": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_f491eef06141ccf17f25863c34e462fe": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_6e145f500db4566f515b2e28cb4efb46": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_9ba907992378c7c17a95c4bc72fe0282": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_c1180887627ede7086cfebe1863eb8df": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_1f751eaafd66b0f6c526c5629fcd1534": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_6525bc11e8dac4ac5a10b13209ed2f97": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_027ffc1af21877811a745d73e1237b29": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_c7a6ff6918b4151a8ae75305c6b8d8d3": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_430a60cc55ff3cbc1c5ec84856a95943": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_971f077f2d6951306929868745a64f83": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_33b99b551e07b52309f0aff3d1d36d46": "2211.03009_f0213fd235a262e45f7fe5d3aa3b8594",
            "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6": "2211.03009_fd69c5cf902969e6fb71d043085ddee6",
            "2211.03009_68c803214d06dda4d576d0eb278c42f0": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_d8a5e89fc5663479a355d0fa554b1ac6": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_3c21d2840ae4842f27885d6f536c20ab": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_7b0dbc82fcb990e817099af3bbfe7823": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_6c1c596737b26dd359d4f1bcaf1bb75d": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_4df969032016eed3cab61c1527ec1bf1": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_42d25bdf57c3eeb91ee8d5062bd2a4f9": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_e5502f4c1ee7251e0f3eec4cbe6fae0f": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_bd13d509b11a16e1575d14e3ce2eee61": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_081529e5c489dcdf8205261bf37735f7": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_29374e29352d13dd653b5756ed480df9": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_0e6400b1325b0b77824a932893eda553": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_31e590b16e94b1133a1cd9a300986821": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_114fd1774c475f67ecfbe038aadd1382": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_6645b4d4b1f7e44edc58082404963058": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_c07050be68d3e127d32f9d481a1e8c9a": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_c6b6cb8df979d3bf236d4a987ad15756": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_9facd058e9309a35d1a92f3fac7e0a4f": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_4b200da821dc6321dddb0107d5d9f601": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_7d9fb7290c54fffcf85a127f84c6f193": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_0f918c7846514523e51abd7c2a4fe557": "2211.03009_c9eda49a9c5c1892ff7f6ee820d05da6",
            "2211.03009_eed9474fd944d045ff056d20004acaa3": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_5ffc36c314ff8f5801a02403e71b45d5": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_0eebd4450e095d5d73493693b025c7ad": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_1fb87a687ef6c8300a4f570b07fd3691": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_cdd9989edfc483840728b675661f242a": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_5f3be63f738da712f05c62397c0585c4": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_5ca896561a504a583cbc69ede94eac8a": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_b3b25b2b4afbdf55d49dc4a20936d96d": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_25eb591aeb134407f71df8370f7d1f94": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_64e12314811fe2c74489d1085102a846": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_a04df115f0dd3d2f8ad2ef7f6a156059": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_0a35831545efe9941535a99bc3aa3a83": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_d5608d39db85861d0dadeb5bf899caba": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_579ed885f39b0f9d54e68f78ef91e1b9": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_180b70564aafa80d5891bd090e3b0dcc": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_8105cbd7b6d627060956b698b86fa95f": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_2fcf14d9bb99415096285ac56d8a75dc": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_d1c0c727648220fe9e1396ba2e45d8d0": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_9c214aa86068a1123d44c4ed5777854f": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_876081ce8da2d14b6781c3ccb092ba38": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_43e5c9a50e17df319f70142527b85418": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_0653c5b72979a2a90d1739fd5edfc787": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_5472f3459757fd3bb656507369b67c96": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_a0e937901135bfcc91b9899219a8e8d8": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_762df031ccb04d92aa2f3b0229c23d17": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_ae0efb6fe1bfd650aa6f0a5190b2dd70": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_1f89e1eaf847736e45fa2c6923e7c18f": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_57732674c40aa8c5e7122e5fef338bca": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_17b2bbe2ae427a3577829115c9f90068": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_b148fed99a8205536f881684fa021da0": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_3f47c87e0d72c49da65d4ce5a239282b": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_1060d9a59b4523c10791cb2c2200ac28": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_73dc50c3f21a2c915284b190ba90ad53": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_8af9d1e10308b76f7368acd9ed09f2c4": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_6c6b98f5b75e2b97f1f3766f23e8b066": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_3e951fbb763b0d858276cc3d59b34c29": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_1696f9f57f7aba6ba88aabe908a129cd": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_a7cb15e2b01cc0c97558d09f6787da63": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_ce96ce64475d88003b81a20710c10f5e": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_d18587b103a1306364e47d2acaf38267": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_09b6d4a40b8ef3bdf4c9a7d2b200bbee": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_27825bbb006f98572e7ced1486c8638b": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_77d6031d99c7826e09cf18806b07cc82": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c0fc963b3832ed63af3709a8a32e1593": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_4c045f73f1c5c439f13995b957507b10": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_154ffe97be7d73ac078e1e3da9fc412c": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_b0b15ecd35a0913761ee1c913939dfc1": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c1c3ec1e541b209cd87c987883b3dc54": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_61b2b44c77e6e265c47254c396d39a80": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_4fcbebe0045e6a19bcaf545df149d633": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_ee4af4ed459155e88631edcbfd5f2179": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_619ec8ab12b765b331048c944017292a": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_065193050ea94ec61e8250365360f583": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_0a9b9790435bfd5e73f05d827eea25b5": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_1e05284606b985ddeb8b2b00e5d480d1": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_33300fe1dd0fb72766996180c6100ad9": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_2fc6df42504e53522d457e171aadef58": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_806103cd519c0af0fb0747152e8d4dc9": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_400a7506ac98a893db7b34302f46aca1": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_a41683be8e8f6fbdeefb36b5a2438202": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_b26ed9545874636ffb7c6071e263af5b": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_5073aedac4c00ade3e5e3d94814aef9d": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_53162b898a75294c8027298413bea055": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_e3ea8c1cae198021754713c80a2b6aea": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_8c3e4a16c0f66b92aa8f1f1688cb3117": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_3c5546b86c3d33c72209d30cbb32c433": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_5b0ecade66b0baa6067ecae3f5838b13": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_833b320698b0c5a7ffa8d934f2e4f711": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_8a61bf26553ac09e81fc071b4948c24e": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_debee0667e980b557e1ae7be8ad720b2": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_584fecc8e33c41777c4fb3c5329b9b87": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_387e46c5c961e23f8377e44750ac9a05": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_13f603a97dd5608491418792930bce83": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c0801b22ab34e013d45e1b934bf34c96": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c27ff1013683ba984df4b8cae1eefeaa": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_f9427d7eb326dd2439c05ccb6cfbc321": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c32ff053dde70041226bc7eee724f5f0": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_83f2efb3efa1bd5e9925763c7beca341": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_d094f68218ea1f864333e368bcdee07c": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_5b0d7c2fd988c262d93d539ed8d1aec3": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_bf04f3b549240e4a5715392f3defbf52": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_c7b0b3bf2fb7cc79b7d58146b00ff701": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_78382217ca74efafb195bc5cfac608a1": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_907d5ab6b4c2a3cc750ae1788a436947": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_00113954fe74d063f746f4cbea4fdf78": "2211.03009_d5608d39db85861d0dadeb5bf899caba",
            "2211.03009_ed50f3d94829b059a319d0ca75972419": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_ea53ab750ec93bc288e0e4b5979e9f9f": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_bad3d6fd82074f0054769f173f94735b": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_5b79f868958c15afa1911a10d40bec5b": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_02958afbf7e2fa386583691b6d74b79e": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_e5dae6b9320ccda54a4d506dbbdc54af": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_8fb11805dd99001a0793896a05b759eb": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_4bf647774e04e02784184eba4010eb05": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_ed3a3d1cbd2f437c6c47bdbc45bc7696": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_856413100c81a721d7ebf9d29cb9bb0f": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_e6474775a94230a02e71a7168aa3a63b": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_f4b22f2884dbede946d7be5e08dde7bb": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_a76da96190a685084ed6141de6faa402": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_34fde28f31f715cc0f1efc7202f9668b": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_97878b8165f5d21ed4752699abbb128d": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_80b67eb13f66041371b227f29a1fdfef": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_2f95a17defb039c8fb63f01e3298e57e": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_caec66214475d3e4084b306d53398a18": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_31da2f825447e7a643fb12ba6c96c5ad": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_86a708d1ddc713857b06a1fd05108534": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_f2185e2a9bb0e079cd01394c8cd5b09a": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_1d6f7254ca5f056a682d68df141dfce7": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_7e64e62da0b5e01c424c11b05c0d8aff": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_5ca7967ff8170f956864cfdb52948af3": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_ccd7de545a67f3fb82c824d09e46dbf9": "2211.03009_ed50f3d94829b059a319d0ca75972419",
            "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1": "2211.03009_eed9474fd944d045ff056d20004acaa3",
            "2211.03009_5f615d8f5507b05c6e76685181cbde5b": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_6d46f81c74055579c3bb7ee7e98a37e0": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_fce51b58fbda7b7cbf53378d9b627812": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_6f8cd716b42da228d9171c2cfa0e0424": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_8c589c7bd2fd97f27e6988712a7e173f": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_1f358774618b7b5366f5b9fc71ac51aa": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_d69a26a6c187179b9feeb4c6bb2cf76c": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_689ad642d6447f642ea3f04c49f3f94b": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_1a19050edad35084c3963b4f6898adae": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_fc6e0d2495f20a789bb8183f6620526b": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_f3878df87fcb9622ea287cf8aefedebc": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_a9c99623fd25c17fae759c7bf2ba1055": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_7aaf617c1728a063e51203e80be3d929": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_00e23a0bb5d236816c8080e2e541bc71": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_e189a8ab0cbbd33a8dd2c9c4a8de7f67": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_3e0cec159ba91942286fd5fa7fdd142d": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_bffa390fe38ffa6bf7bb33f864a5dfac": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_27a2c07e4548bd9bb1956a1d62c57819": "2211.03009_6bc6f16d8a721e083e6f4156c9feadd1",
            "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_5a5f403698717160c50de04ff48fdf88": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_4cbad527a75b3b5e6ac355da63178bfb": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_b2561936a37fbca05bd7d87a5241fae3": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_5f8e850fb385d59444145a91f5d61ff0": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_847fb7836a4d0c493ecf004b391d631c": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_e995ac428ebbc9bf2b3b0551bff6459a": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_7c07c47fde68f5dc134678d5def5acad": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_434b57174af21c7f82abed9c94d475cf": "2211.03009_6f8b794f3246b0c1e1780bb4d4d5dc53",
            "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62": "2211.03009_e353dbe42c8654f33588d4da0b517469",
            "2211.03009_4d84da0dceec0f12788f3f3b96c435d9": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_6749a5edbffd4657075bcaabf0eabe0d": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_3e8c505a544d9dea69c4186dd5ee1f74": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_4cc878c0a6d38e4eb046f2ba82f54772": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_96692c52377151e9d6ea1fb2556ff428": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_3a860784aa6947e7d6d0f8f26016cf3f": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d21bff1dd4d1cb19a8315a1f01dda8a4": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_bc8c07f618e507cbc3903d746c96a3cf": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_2e3d7694e7a365ecf59d55bc5dbcd0b4": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_e8f70ec7f009889314287f0d4cbfa5d3": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_7d6995caa3ed3a2d8fda6cf253cb49e2": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_3d55b5f139a8320724eea23867f21fe8": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_680dfdddb80943e405a6c281f91c69f8": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_dac78b2fcc3d1b1a511cbd2ec9626330": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_c394987c276c3537535eb72246388c5c": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_a23467a10beb238444cb95ba637d280b": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_6758e1893d86b0344c0c46c1955d866d": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_7a300274e2466e01e783c047a07c688f": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_f5941d58e6bf9209a4a29258e870e1b1": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_c88a29fe128152427b7916d4c26b1029": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_3dd6a2272a92c0e780ecf67d73f4e132": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_dbd8035238878038ee8a6c09e06c25ef": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_422f577bfea49040fa164e1bd465b09c": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_fb5a5293511d165478ea3a3f00e93514": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_f70bab7a9a570cac7fc110cdc647fb19": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_52aa943422f574852053325322b2663e": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_6dfd2daa8f73fe47952dcb21787b7808": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d6cc54792a06d08fb2a27f513d2fd47d": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_b4a4ec62deb8cedecc0365ca31e4747b": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_ec32a6a79ae2473a8a7db9f5c4115344": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_7b5a6e9176972a7e42bbde339db33437": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_e548d2a7cb688b609ba238ccfde26f45": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_c71d697986eeb6e6216599c6697c9788": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_b7677d9fbdf690aff71116aa197b844e": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_c5ef67a502850788d00433ee310e8d5a": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_e2080ae79d10cf50b6175f21bad61b8a": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_68c050a7266705a65dee7e5e199037db": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_01b6e20344b68835c5ed1ddedf20d531": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_e9b6705a8947f6a2103050660e738327": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_86c5a2a047d29699b6456e7cb01957e3": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_dedfbad0ae3dd4532363783197527aae": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_38287d167509bf5ae11ab23102bb0294": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_e1a1bbc45fd70058d21ee960486d9d8f": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_ad9b1219400a22419419ee01200a9bd0": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_16765ff016e0a83a1771fce272ce6046": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_1f5aabace95531b103d552ecc20d2b6c": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_7093b6d2716f60d7532fef1a08dcb2ad": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_1c14bfe98cc4a4e1d5afcf7dd481f15f": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_70b6a7f1917a18e431579f307bcc11d0": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_fc2d2951ab5e68a221217cfd43110f30": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d6a8745292ee044c894bcd13851df776": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_eaedf9b247355ae4f14a30793aaeb786": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_e816cbf92141e9985b77126588990942": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d8bd79cc131920d5de426f914d17405a": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_151d7ef7992bafa754d4254b703978c5": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_c1ca4dc50e12344500e151746e9aa4cb": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_deac75cb66e34bc3fc80897775b1e931": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_adfd89d63754d8dcbca10d1e9ef656ab": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_609a6b96c590e037f125f9d45be37ca5": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_983f4b094921bacd0ef250dc20f79229": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_503c52c8687d6807731898e21736b173": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_40418340e63fe71fe52622123bda89af": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d18050d2eee9377040a0a57f6ab4c9fb": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_bcdc61c9e1eba78ec94f831266a09e94": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_fd8b81d9731a78c541cc2e88030ff9e5": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_3676e8f3a8abae409fd7f2a6c2e7f9ac": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_266911addfc14b6cefa5061f55d15670": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_af8f8bc0942aa9eac7cbafdf36a089e2": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_4a63e0d50be2c8442c9ab9095bbfc473": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_a0af9a5033528097dbe055086e3bdd96": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_486656c51b1d42246451d30aef478f51": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_769264ca156dbe4b34d253e36e8e5e4e": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_4449a05884ffe55db4930709c4bb8886": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_9d6088aade484116d48c2bcc83fe2be3": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_bc8537ea7787ae0b533e59743b6326a5": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_23cd8f811421fca78434abfa196142ab": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_66a75a6bcc6c98320113b6f972095ce5": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_9b30cfef39a40e3ce537874fd7144181": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_42fab2af9e281a0e9949dd9651e88f25": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_36aec00ab8478199935d743dbfb3e768": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_d8be17b11dad65af6ada7237daba267b": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62",
            "2211.03009_6d2011b3fca00b12dcbe09fa5073416d": "2211.03009_cff1be7f7b27cf1ec2e7be8bcc63df62"
        }
    }
}